{'TRUMP 2020': 'RETWEET so Trump and others will see! https://twitter.com/JFord1984/status/1053801611514892288', 'Sandy C': 'This is the best ad ever! I just posted it to my Facebook. You deserve a medal for making this video.', 'o Wendel': 'Fuck cnn', 'Trevor Marr': 'Reject the Left!  Vote Right in November and EVERY Month! Give President Trump the Mandate to hold the Criminals responsible for their crimes!', 'Randy Cox': "Let's do a GoFundMe to get this on TV.", 'vsummers33': "Most accurate and persuasive ad I've ever seen, the Dimms are nothing but National Socialists, yes, Nazis.", 'kenny whitmire': 'Go Trump... Hang Killary and Osamabama..........', 'Daniel J': 'I used to be a DemocRAT, now I loathe them.', '#MAGA TEXAS': 'Great job! @PotusPress sent me# They know who you are, awesome!', 'Pee Bay': 'JOBS NOT MOBS!!!', 'V8RallyRanger': '/you should have included the clinton sound bit of its us back in power so thats when civility will start again thats more powerful cry babies loosing has to take to violence to win', 'EffE': 'VOTE REPUBLICAN! NOVEMBER 6TH!', 'Bailey Balzer': 'Well done!!!', 'MedicalJokerXP 413': 'You won’t have shit if Trump dosnt do something with the environment and not just money', 'Opinion Pole': 'The whole American political scene explained in 1:24 minutes. So true. BRAVO', 'Return Of the Mac': 'Excellent message and imagery.', 'musicsuxnowadays': 'This is so great.', 'Leon Tabasco': 'Great ad! The RNC should use this.', 'MSTdesign354': 'Good', 'Jazzbo Jackson': 'Liberals are pieces of SHIT', 'Panga 22': "Every one of Trump's rallies is a mob of the angriest, violent, hate-filled, low IQ people on earth (can I add fat and ugly).  These events should have napalm bombs dropped on them.", 'Les Holte': 'Share! Share! Share! Post it to FaKebook, Twitter, Instagram, MeWe! What a gr8 video.', 'ZuQunft': 'VOTE RED for Humanity', 'GlobalVortex': 'Great vid, but I would remove the part with the torture because that was from earlier and replace it with something else. Also replace part that shows British flag on label at the beginning. Show entire Clinton statement  "When we\'re in power, that\'s when civility can begin again." Then send it to Donald Trump Jr. who might show it to POTUS.', 'ricky4001cs': 'the music is too much.  Turn it down by 10-15%', 'Teresa Morgan': "That's exactly the way it is! Great add! Run it non stop! Red wave is coming 🇱🇷🇱🇷🇱🇷🇱🇷\nWe love our President!", 'Chatty216': "Get it Mr. Trumpdo the damn thing. I'm not voting for that crap. Jobs nor Mobs baby", 'Andre Paquin': 'Hello from Canada.\n\nI thank God every day that President Trump ruined the political elite ruling class, and MSM\'s plan to foist their "Bush vs Clinton" rematch upon America and the Free World.\n\nIf Trump hadn\'t stepped in, humanity would be suffering immensely under a Clinton Cartel kleptocracy because once Low Energy Jeb had won the RNC nomination, the MSM would have turned on him like a pack of rabid dogs (just like they did with McCain and Romney), and President Klepto would have been the inevitable outcome.\n\nMoving on to the Dem\'s 2020 presidential nonination front runner, have they linked Warren\'s DNA to any cold cases yet?\n\nAnd to all you TDS afflicted libs with Russians running amok in your twisted lib/prog alternate realities,\n\nI\'m a real Canadian, born and raised in Canada and there are many more like me who owe Trump voters a great debt of gratitude for allowing America and the Free World to dodge a huge bullet by electing President Trump over that drunken sloth, Hillary Reject Clinton.', 'DRKTROOPER15': 'This needs to be on every TV in the country', 'JCJR': 'This needs to be on TV in every congressional district.  Very powerful and to the point.', 'El Chongo Loco': 'First Day of Early Voting. just got back from county courthouse, Fredericksburg , Tx  Long line, took me at least an hour to get through. RED WAVE!!!', 'Kenny Strawn': 'My great friend RC Maxwell posted this on Facebook and his version has gone viral — no surprise because he’s in it. The guy in the PJW shirt standing right next to him in the pic that made him famous is me — and no surprise: this ad is not only spot-on but completely accurate.\n\nI in fact DMed this video to Mimi Walters (my representative) on Facebook along with a request to have it televised locally, and she did indeed see it.', 'David P. Whitley': 'Have you uploaded this to Facebook where it is sharable there?  Native video on FB displays better than links here.  Great job!', 'Bezaleel life': 'This must go viral', 'medicatedification': 'You Brother, hit this one out the fckn park!\nThis Veteran is very proud of You!\nThank You!\n😔\n🙏', 'Sanityy': 'This is the absolute GEM of Youtube.', 'John Smith': 'Outstanding. The ad should also include images of thousands of illegal invaders marching on our southern border.', 'ProtocolZero': 'Nailed it.', 'Kathy Young': 'Make it go viral', 'paulette barrow': 'THIS NEEDS TO GO VIRAL CONTINUOUSLY,CANT WAIT TILL THIS WITCH IS IN PRISON', 'V. Lee Walker': "Trump is a phucking nazi and those who support him are nazi's!! Pink Blue Tsunami!! November is coming!!", 'Jon Gianulias': 'democRATS = #PARTYOFSLAVERY dems miss THEIR Slaves...  I chose JOBS.', 'Class Hound': 'The thinking person votes Republican.', 'Advantage Prints': 'Jobs not Mobs!\nhttps://www.ebay.com/itm/292782972320', 'Darrell Pierce': 'WOW... they did a really good job with this...', 'Margaret Rose': 'Proud of you GOP!!And this is from a registered democrate, VOTE RED !!!!!', 'Drake Mordred': 'Spread it quick before YouTube deletes or shadow bans it!', 'Eddie Johnson': "Concise and a stark contrast that's frightening. And the most disturbing irony is that it's lifted exactly from their own words and deeds. Trump 2020, this is the definitive ad of the decade.", 'Tom Smith': 'I posted this Video to my facebook page', 'Debra Steinman': 'I retweeted it, then I tweeted the article that alerted me to it.', '771blahblah': 'Great 👍 👍👍', 'keybplayer': "What a stark contrast between progressive Democrat's mob mentality and the Republican Party's jobs economy. The Left is only interested in power and control and as the video demonstrates they will stop at nothing in their misguided attempt to win back Congress and the White House. These anarchists are a blight on society and the best way to defeat them is at the polls on election day. Every American born patriot should share this video with their friends and neighbors since it defines the radical Left to a tee as well as their despicable agenda. Democrats are out of ideas and it seems the only thing they have left is to attack and ridicule other people who happen to disagree with the Left's socialistic ideology. Keep America Great by electing more Republicans into office!", 'Shawn Hennessey': 'Hillary Civility and joyous partying will start when your ugly ass is in jail with your pervert husband.', 'NomadArt USA': 'Civility will start again when Hillary is in Prison...😝', 'Thomas Gunn': 'Mobs not jobs.', 'Ryan Massie': 'The invasion of america by foreigners will never end until the country is ruined beyond the crapiness of the holes these invaders crawl out of', 'Johnny Penso': 'Brilliant. I expect POTUS will retweet this.', 'Patrick McGuinness': 'Wow. Very good and professional.', 'jwka2001': 'who the fuck is the neanderthal looking motherfucker at 1:02', 'Shadowmaster625': 'And this is why they want to completely lock down the web. When they get their way, the only jobs left will be for people who sit around all day searching through the matrix for videos like this so they can delete them while laughing demonically.', 'reference2me': 'Interesting how the Mob hides their faces ...', 'Kathy Sale': 'SPOT ON!! I tweeted it to President Trump! You need to be hired!! #MAGA!!!', 'KENTUCKYUSA1': 'Incredibly powerful!', 'Ted X': 'Any Conservative who believes the US economy is improving is just as severely mentally-retarded as the Libtards, who believed the same lie when it exited the mouth of President Obama.', 'Zack TheBongRipper': 'Powerful. MAGA.', 'Odd Zee': 'Gov needs to get out of americans way, and let us create jobs. At best, trump brings a foreign country in to "create" a few jobs? WOW And creating more alphabet agencies is ridiculous...who pays? Where\'s our HUMMER\'S...Where\'s our GM? He can\'t even bring those back....REWIND USA, Trump. NAFTA 2.0 is TTP mislabeled.', 'Thisisnotmyrealname8': 'Finally, someone figured out how to make a political ad. Nobody even had to approve of this message.', 'We The People Rising': 'NOVEMBER 6TH VOTE REPUBLICAN!', 'SocialismIsGood NPC': 'System Error', 'John Campbell': "Now that's a top notch ad and is filled with facts.", 'James M': "Great, great, great.\nI'll add to comments wherever I can.", 'l1': 'If you’re on Twitter (I’m not) tweet this to trump. Everyone', 'klutch14u': 'The needs to run across the country, on a loop.  Time to take the gloves off and show those with their heads stuck in the sand or up their ass what the dems really are.  The little bit they pay attention to is spoon fed to them by liberal "journalists" and rarely, if ever, see what these wackos actually act like.  Their little orchestrated tantrum over the past 2 years is nothing more than a threat, that unless you give us our power back, we\'re going to continue to shred the country.', 'jonescarp': "Gee, I just can't decide", 'Jim Dandy': '*BEST. POTUS. EVER.*', 'Sharon Stone': 'Excellent.', 'Batman8657': "Trump's done a lot, but his single greatest accomplishment is giving the GOP their balls back.", 'Dan Meyertholen': '"the hard truth about our criminal justice system: It\'s racist ... I mean front to back." – Elizabeth Warren\n\n#DEMLIESMATTER', 'Its Didi': 'So much MAGA ❤️', 'Dan Strickland': "Pretty good. As some as have said below, using Hilary's full quote would give the overall message a much more powerful statement. But still good@!", 'Media Buster': 'Great job!  I have a similar powerful video:  https://youtu.be/E0e9fFWvKBQ', 'Jeremy Buchanan': 'Game over Democrats', 'Ryan Mattock': 'Just share..', 'Truth Teller': '27 triggered beta cucks disliked this video.  You 27 can suck a big orange schlong.', 'Evan Keep': 'Wonderful ad!', 'Cellar Door BH': "In a world of NPC's...be a PLAYER! #Sendreinforcements #JobsnotMobs #VOTE", 'Josif Maracine': 'Fuuuuuuucccccckkkkkk ! \n\nWhat an effective ad.  \n\nWhat do the “ Crazies” have ?  Socialism?  We’ll take everything you worked for and give it to illegals because that’s our NEW  voter base?  Fuck them ! \n\nVOTE REPUBLICAN !', 'Clifford Rutley': 'We need these people making videos for us Brexiteers.', 'Scott Halloween': 'This,THIS is why youtube fears us. And they should.', 'Live Stream': 'MAGA', 'Yordan lol': 'Put this on Twitter and we will retweet', 'John Besharian': '"BOOM!!!" [I\'m posting it on both FaceTube (as a friend calls it) and on its new replacement, "MeWe"<mewe.com>,.', 'Isaiah': 'Found this on r/the_donald\nAmazing video man, possibly the best polAd we have!\n#jobsnotmobs', 'jermzdee': 'This dude fucking killed it.......', 'Traunch Trauncher': 'should have included the ENTIRE KKlinton statement at the end.  he cut off the most important part.  that she says that until leftists win, violence is justified.  its just pathetic.', 'SAPWOW': 'Honestly, this is the best political ad of the year. A bit long, but someone needs to pick this up and spread it. Everyone, TWEET THIS AD AT TRUMP!!! Get this guy a job making these ads professionally. THIS IS HIGH QUALITY! #MAGA', 'David Ziffer': 'FINALLY THE GOP has figured out how to communicate with the public!!!', 'Dennis Vance': 'Rioting is the leisure activity of the elite class. Vote Republican for the rule of law, not the law of rule by fear.', 'elizabeth schleimer': 'lock them all up!'}{'PureWhiteLilly': 'AWESOME!!! Vote straight Red in November!', 'Steve Holt': 'Logic and truth vs the Lefts emotional insanity', 'JoshBroChill78': 'Sums it up nicely.', 'turduckenheadsail': '0:13 shows a British flag and product being stiched ... change it to a USA product or something generic', 'Thug Life New Shit': 'Awesome', 'samechick': 'So well done!', 'Paula Applegate': 'OMFG, you people are so indoctrinated, get your head out of your ass and get a breath.', 'emeeeych': 'Excellent', 'Subuntu': "I'd suggest giving the slightly longer quote by Hillary about when they get back in power civility can begin, not everyone has seen that quote and it's not entirely clear on context as it is.   Truly awesome video though and I hope GEOTUS tweets this out or it's used officially.", 'Lord Rothschild': 'Great video but you missed "CUCK NORRIS" in the ad :)', 'James Flames': 'ORANGE MAN BAD', "Scooby Don't": 'This should be on every commercial break on CBS, ABC, NBC', 'amoergosum3': 'I just read this comment on The_Donald: "Should have used the whole quote from Hillary saying once they are back in power that\'s when they will be civil again. Not everyone has seen it and half of the quote lacks context, really a big misfire at the end for anyone who hasn\'t already seen that whole Clinton interview."\nCan you upload another version which inclúdes the whole quote?', 'adfa afasd': "Bam, that's a good video bruh", 'Seth Shugart': 'Fantastic video. Great job, Pede.', 'Chris Anon': 'How long before the radical left people at YouTube headquarters delete this video? I hope others have copied it and are ready to upload it again if necessary. I will be!!', 'berserker': 'I approve of this message', 'Scott Kellogg': 'Brilliant.', 'SNSDatDPRK': 'I want a job... not a mob', 'Jelly Bryce': 'America first! not israel', 'CHL41993': 'Very cool', 'Vivek Tiwari': "Awesome America! Good luck from Modi's India!", 'SouthernNYer': 'This kicks ass.. Excellent job!', 'zed1207': 'Particularly ironic after Trump lauded a GOP Congressman who body-slammed a reporter.', 'duckfield': 'This is better than anything any marketing firm would make. Trump has a free unstoppable marketing team.', 'Annmarie Kane': 'Stunningly powerful! How do we get this on TV in Battleground States?', 'kimmiedearie': 'People on twitter want to give you credit. Did you create this vid?', 'DF WORKS': 'LOCK HER UP!!!!!!', 'Charles Bradshaw': 'how are you not getting paid by the GOP yet?', 'Arnie Cardenas': 'Very powerful.', 'The Drunken Pyro': '/pol/ brought me here', 'Hank Hill': 'Amazing man', 'Bill Swindle': 'Everyone, make this viral! Make America Great Again and Keep It Great Forever! 🇺🇸', 'BigBoi': 'The magic stick is working!', 'Bryar TXE': 'Trump should upload this to his twitter and facebook accounts', 'beach bum0331': 'i find it funny youtube suggest dumb republican comp after this video.....im pretty right leaning and dont watch alot of left leaning shit....never got this suggestion before...lol wtf', 'UFOs not Religion': 'Love it.. CANADA next please.', 'Astral Belt': 'ok\n\nthis is epic', 'Kevin Main': 'Maga  boner intensifies', 'Rusti Mccollum': 'Love it. Sell it to the GOP for a commercial!!!!!', 'Drek Picken': '15 thumbs down, go Fu#k yourself, bunch of Pricks!', 'Emiya Shirou': 'Oh boy...', 'Pepper Conchobhar': 'Shared and spread.', 'Pham Nhat': "I want to jam a pen into Hillary's eye socket so much.", 'Amm0sexual R': 'This is a very well made video and does a great job getting the message across. The only issue I see is that at the 0:14 second mark, the hat being stitched is a Kangol which is a British company, not USA.', 'TopNewsHits': "I'm trying really hard to disagree with this video, so I can have some fun with the NPC meme... but I honestly can't think of a damn thing. Awesome video!!! I guess I'll wait for some real NPCs to show up and I'll take some notes, lol.", 'whocareslol222222': 'commenting before this goes viral', 'dozo': 'Drumpf is finished for sure this time!', 'chinavon': 'I\'d only add one thing to the "Mobs" portion.\xa0 In our Liberal cities we also have mobs of homeless drug addicted criminals. Crime is way up.\xa0 I see it every day now. Used to be a nice safe city.\xa0 Dirty needles, feces and garbage in playgrounds, parks, bike paths. That\'s the constant never ending failure of Liberal governance.', 'Jack Fleshstalk': "The democrats are running on a jobs platform too but too bad it's in 3rd world countries so their corporate masters can make a killing off cheap labor.", 'Ted K': 'Trump has been a Godsend for America!!! Democrats have become the party of crime and obstruction!!!', 'smashingartful': 'Nice ad!', 'Watch Maga': 'Someone has to get this into the hands of the GOP election committees!!', 'Andrew Tucker': 'thanks, needed a good laugh', 'LaserDroid': 'A whole lot of Heresy coming from The Left. \n\nJust making an observation.', 'DR.NEGA': 'and china gdp is 6.1 %.......why so serious trumpings.......even clinton back 2000 had gdp 7.4 %......why flash the 4 % when obama earned that with 3.7%', 'Nicole': 'brilliant!', 'Brian Gardner': 'This ad needs to be played on every tv stationand website 100 times a day.  Everyone share this video.', 'KimmyTexas': 'Awesome.  Hope it goes viral.', 'stacy mirba': 'This is incredible.', 'johnny tsunami': 'Stop. I can only get so erect', 'lilbuffy': 'holy shit well done', 'Bless ed': 'I liked it.', 'swimkin': 'I am voting all Republican this time.  No DEMS have my vote.', 'JellyFishSandwich': 'I think what I find most amazing about this is you barely scratched the surface of leftist violence/ mob tactics. You could probably do two or three more of these.', 'YHZH': "How can you say unemployment is down because of trump, it's quite clear that it's down because George Soros is hiring so much people to protest Trump.", 'JC R': 'Apotheoses achieved. Wow. I would love to see the creator of this video, do a similarly compelling video showing the out of control mobs approaching our southern border.', 'uhhhhiii': 'I hope Russia promotes the shit out of this video on social media.', 'Bretton K': 'Get trump to retweet this!', 'Steven Delgado': "The Republicans want to gut Medicare, Medicaid and Social Security. If they do that, I'll be on the Mob team 😉", 'Chucky USA': "Magnum opus..and I'll be sharing the **** out of it..", 'tangom3nas': 'This is a masterpiece!', 'ToiletGaming': 'If I lived in USA, I would vote for Trump', 'Bigboy123': 'Powerful.', 'Tommy Gibblers': 'Powerful.  Republicans are going to turn out in record numbers to vote, I can feel it in my plums.', 'MrBlue1190': 'Amazing', 'USA 2017': 'The MOB Animals clawing at the doors of the Supreme Court. only thing missing.  Otherwise. perfect', 'ella 101': 'Absolutely stunning. Brutal. Spread this like fire.', 'Seattlerunner': 'Seems like an easy choice to me..', 'SemperAugustusBubble': '84 seconds and no one is ever voting Democrat again. Nice video.', 'Betty Deluxe': 'Professional and powerful. Great work!', 'Dan Nguyen': 'MAGA', 'sugreev2001': 'Jobs, Not Mobs!\nGet this ad on TV.', 'John Bryant': 'OMG! So true!', 'Mike Wurlitzer': "Carpet bomb the country with this ad. It is the only way to get around the propaganda machine the democrat's  MSM house organ has created.", 'Dan Carlson': 'GET THE FUCK OUT AND VOTE GOP PEOPLE! OUR COUNTRY IS AT STAKE! LITERALLY!', 'Kevin Robinson': 'Amazing', 'Chris Martin': 'We need a Facebook friendly version of this as Youtube only shares as a link.', 'don monfort': 'Music-noise way too loud.', 'Jacob Paul': 'Please let Trump use this! Great ad', 'ChadBoltzPro': 'This is an incredibly persuasive ad. Bravo!', 'took rat': 'The choice is clear.  It is time to reject the communist globalists and MAGA!', 'Your Marriage Mosaic': 'This is hands down the best video I have seen!!', 'Uncle Putin': 'Sign me up, Baby!'}{'SAMO': 'Redwave incoming!!!!', 'MrJeffcoley1': 'Hard to argue with that.', 'rastarum': 'First show mob and later jobs that will be more effective.', 'TheAUricle': "Hey its a great and persuasive vid! My only gripe is you're portraying TODAY'S BOOMING Economy, using video of auto building from the 1960's and also very dated skyscraper construction. Other than that, 5 stars!!", 'JamesWInGermany': 'How is this video not already viral?', 'Constitution 1A': 'Great Job! This is an excellent video and thank you for creating it #JobsNotMobs', 'Andrée Langlois': "Amazing!  Great franco-Quebecer's support to RED WAVE!!  Where You Go 1 Where You Go All Love you bros and sisters of heart xoxoxox", 'Gospel of Sophia': 'Excellent. We will be posting on the American Intelligence Media Truth News Headlines.', 'Chris Stackhouse': 'This is excellent work man.  I agree with the suggestion of reversing the sequences though.  End on the positive note.  Truly outstanding video though friend.', 'James Lawrence': 'Use a less angry looking shot of trump...need one of him looking civil, not punching the air', 'cowgirlmoon': 'This is EXCELLENT!!!! Share, patriots, SHARE!!!!!', 'Paul Ahlstrom': 'Keep it coming! Just play this ad over and over and over and the red wave will be so huge the country will arrive at a #GoldenAge', 'Flafi Lool': 'Great, great job! Thank you!', 'MSNPC': 'Every republican and right leaning independent that does not vote elects a democrat', 'A R': 'WOW!  \nWhat is the soundtrack?', 'RT': 'WOW! #MAGA #KAG2020 #WALKAWAY #JobsNotMobs', 'Toobula': 'LOL, what utter propaganda garbage.', 'elMak': 'I vote jobs ❎', 'SkepticAll': 'Awesome video. Needs to be spread everywhere.', 'AIRCAV006': 'This is our message, now spread its like soros writes a checks to Antfia!', 'Jess D': 'This is the only ad needed for this election cycle!! Excellent.', 'Matt': "Most persuasive ad I've ever seen. You need a job at a PAC", 'ohperkele': 'Trump should tweet this.', 'Andrew Hendricks': 'Sell this to a super pack and get it on the air', 'Noah Stiles': 'Excellent!! What software did you use? #JobsNotMobs', 'DarkMatterX1': "Too bad it's not real", 'Nasime Forever': "Fuckin' based!", 'Peter Clouds': 'This is beautiful'}