{'Jane Doe': "Storms here in Spain are reaking havoc. The media is not reporting anything to do with crop losses. I've never seen such fierce storms in my 20+ years here in Spain. Vegetables and fruits are getting more expensive by the month.", 'Joe Meyer': 'Trudy’s Snow Cone, now in GSM Rainbow Flavors!', 'jose ramirez': 'GORE!!!!!....Stop hidding in your prepper shelter !!!  Dont you see..Its all covered with snow!!!', 'TheGateKeeper': 'I Cor. 1:27 "But God hath chosen the foolish things of the world (GSM, climate deniers) to confound the wise (Global Warming Crew); and God hath chosen the weak things of the world (us) to confound the things which are mighty (the elite);" my emphasis.', 'fathead adolf barry': 'i accidently grew corn in my garden by throwing handfulls of wild bird seed on the dirt..', 'Paul Hyland': 'This this thread on an Irish weather forum   https://www.boards.ie/vbulletin/showthread.php?t=2057903068&page=6    is very interesting. \nPeter O\'Donnell ( MT Cranium) is a meteorologist with his own model and he has been extraordinarily accurate in long range forecasting for a number of years. \nHe has given a forecast for the coming winter and sees strong signals for what he indicates will be historic cold  in parts of America and Northern Europe. \nThis is how he does it........\n"As always, my forecast is based on a blend of traditional concepts and exclusive research into "index values" on the assumption that at least some variability in the climate can be linked to variations in the solar system magnetic field (a complex response to relatively small changes in solar wind output and effects on the earth\'s linked atmosphere and magnetosphere). \n\nThis is his forecast under the profile Roger J Smith. https://www.netweather.tv/forum/topic/72635-the-seasonal-forecast-thread/?do=findComment&comment=3911916\nIt is worth reading his summer prediction which is above it.', 'Larry Stead': "I was in Alberta last week and the news was reporting a 50% loss on the grain crops like wheat. But not to worry because we are on a global trading system and a little bit here and there is no big deal. Don't worry be happy.", 'Ironic Dichotomy': 'Why are they demonetizing videos for mentioning Indonesian Disasters???', 'Magin': 'wait the sun now affects plants? since when?', 'James Coleman': "We have been blessed to have some nice weather lately and we're seeing more crops coming off but not a clue of the quality. Hopefully it's good for human food.", 'Thomas Boese': 'Earth’s Crop Yields are "ALWAYS" Affected by the Sun...\nPure simple thinking...\nNo Sunlight, no plant growth...', 'FixItStupid': 'TY', 'grindupBaker': 'I had no idea Earth’s Crop Yields were affected by the Sun. Maybe the sunshine does something to crops and stuff. Research it.', 'Ice Age Farmer': 'Why did the references to Indonesia have to be removed?', 'Fiona RossMunro': 'David, after this video started, it was paused and a message from YouTube appeared saying, This content is not suitable for most Advertisers. They really do not want you to tell the truth. Thanks for all you do.', 'Dwight E Howell': "Why is snow at this time of yr in Canada at all remarkable? I know for a fact that on 9/13/1950 Lawrence County TN had a heavy snowfall. My father remembered it well because mother picked that less than auspicious time to go into labor and he had to drive her about 30 miles on dirt roads to get her to the hospital for my delivery. That's the sort of thing that gets burned into your brain till you die.", 'Alice de Janze': "If you're in Toronto, Canada and eligible to vote tomorrow, the 22nd, don't forget number 11 on the ballot, FAITH GOLDY for Mayor.", 'Tony Neville': 'Australian Christmas turkeys up 10 to 20 percent on prices', '1SunScope': 'Wow! You can’t report on Volcanoes, Tsunamis and Earthquakes without being demonetized, Wtf?', 'John Dearing': "Harvesting in a winter wonderland. Oh the farmers they're a crying cause winter wheat it's a dying. Food prices on the rise it's a global warming surprise. Harvesting in a winter wonderland.", 'Tyler Young': 'Is it just me or have you used this thumbnail before? Lol tripped me out for a Sec', 'Brian Jenkins': 'Not suitable? Wow, Google IS losing it.', 'Nancy B': 'Shade cloths and low tunnels becoming the norm maybe?', 'Don Thursby': "News flash...crops have ALWAYS been effected by the sun.  And be careful what you say so you don't debunk the global warming hoax.", 'Peter Brewster': 'real small potato crop this year really poor, :)', 'farmin abit': 'David, on this video the audio cuts out just after you say "good afternoon everyone" and comes back when you say " into the headlines for agriculture". During that period, at the bottom of the page it says "Not suitable for most advertisers" and below that line and inside a yellow box\xa0"Confirmed by manual review". I didn\'t see any comment about it, thought\xa0you should know.', 'Jason Sharma': '@0:08 David, +Adapt 2030, pin this comment if you could. This also needs discussed. Not only are these types of conversations simply "taboo" in controlled environments, but they are also discouraged and censored? Sheeeeeesh!', 'Dan Steele': "I live in southern Ohio and we had the wettest September on record and September was the 2nd wettest month ever recorded. I don't know if my soybeans will be clean enough to sell. Lots of damaged beans and Cargill, ADM, and other mills are looking very closely.  Too much rain and heat all summer. Sustained 90 plus degree weather made the blooms fall off my tomatoes and half runner beans. It was  a tough growing season.", 'Gwenna Hedden': 'Hey could you please report current week snowfall', 'Anthony Poole': 'Are they? News flash  Canada always had snow and cold 😂', 'meermuizen': 'thanks David', 'Dutch Prepper': 'Altrough there are a lot of cold anomalys the worlds temperature is rising again at 0,7°C but time will tell what the long term brings.', 'Mack Grevace': 'We live on a planet where the weather has always fluctuated wildly.  Randall Carlson talks extensively about this, examining ice cores from Antarctica.  Humans in this form are but a blip.  As we know by now, anything can change at any point and trying to guess at this point is futile.  Enjoy life and try to get along with people.', 'look closer': 'Quote, ; Is this the end of the beginning, or the beginning of the end... Cheers from DK 🍻 take care.', 'Born & Bred KI': 'Yes very bad early snow. Was rough on farmers for sure things looked grim. However we have a great break in the weather in southern Alberta this week and crops are flying into the bins. Any wheat that was out maybe affected but I’m hearing a few guys saying even with the moisture that their wheat still isn’t feed wheat. So some good signs in amongst a bad season.', 'Rodd Wayne': "Thanks David. I grew up in Calgary in the 60's & 70's and it never snowed until Halloween. I now live in the Columbia Valley in SE British Columbia. This last week has been sunny everyday, frost in the morning but warm days. We had a heavy snow about 1 month ago that pulled down many trees. The ground was not frozen to hold the roots. Stay safe eh:)", 'trut van troy': 'https://youtu.be/ZT9ptdaX98k This video shows how serious gsm is. Prepair.', 'Ben Hansen': 'Actually it was a double whammy. Forest fires caused very thick smoke for all of Aug. delaying the crops development because of low light and then it snowed in sept. The southern half of Alberta is around the 40%, but the north is only around 10% harvested.', 'capt nobody': 'IM A NOVICE MINI GARDEN BEGINER, STARTED 1ST CROP 3 YEARS AGO, BOUNTIFUL, 2 YR,  NOT VERY GOOD, 3 YR.  MY WORST YET, AND ITS ORGANIC, WORM INFESTED SOIL,  ITS DEFINATELY  THE SUN, AND CYCLE HITTING CROPS,  IM  NOVICE ,TO FARMING, BUT I CLEARLY  SEE  IT,  WERE  , US,,  YOU, ME,  ARE  IN  DIRE  DANGER OF  A  WORLDWIDE  FAMINE COMING, LORD HELP US, FORGIVE US,  THANKS  2030.  STILL PLANTING..', 'cityguyable': 'Where is the best place to get some good quality MREs and/or freeze dried or canned food. Like non gmo organic stuff?', 'No body': "Earliest snow in michigan that i can remember.  This year has been difficult to grow food.  A hot spring kills the low temp crops you grow in spring.  Now an earlier winter and cold weather affects the late season crops.  Our seasons seemed to have disappeared this year.  Hot to cold, no in between.  Tomato's however did do well this year, watermelon too.  Hard to grow these plants this far north.", 'TheGreen Jarret': 'Bit of snow,  here right now, after 2 days of elevated cosmic rays, thats not very shocking but its still is a total bummer, my poor chrysanthemum still flowering...\n\nGoing back to sleep, for the second time !!!!', 'Hidden Harvest Grow Lights': 'Thanks David!!', 'Paint freights Jesse waits': 'Crops are always effected by the sun. Its snowing in canada? GASPS. Lol', 'ENOCH': 'awesome update !!!! so greatly appreciate your time to produce these videos. look forward to all your new videos. thankssssssss', 'Royan Mangeli': "I don't care, so should you.", 'Greg Silverado': 'cattle feed...... hard red winter cattle feed', 'Dottie kidwell': 'U can thank the government with their geoengineering weather control.', 'N Brown': 'Umm yes the crops always are affected by the Sun lol ;-) Always some losses just gonna be much more losses now :-( We had snow and small hail and 40-50 MPH gusts yesterday at 60545. Looking for a high Monday of 60 f. The yoyo is active earlier this year', 'scottie hall': 'Do you mean that sun simulator they got up there burning up the plants and trees since spring with leafs first came on the trees. And then they tried to blame it on a bug. Get real. And wake up.', 'tara gillette': 'Thank you David for the update! ⛄⛄⛄', 'Terry Moore': 'Food output is being affected by climate change which is caused by the pole shift...', 'thomas persson': 'Thank u', 'this person': 'this topic gives me the chills.', 'Soleil Vert Music': 'funny as I live in eastern canada and they never talk about this snow in the media', 'steve w': 'Shameless plug: "survival prepping for normal people" YouTube channel', 'open minded': "I've got my onions and garlic in! Oh yeah and basil on widowsill.", 'Jef Schobert': 'https://m.facebook.com/story.php?story_fbid=1141206836042132&id=411413722354784'}{'Jane Doe': "Storms here in Spain are reaking havoc. The media is not reporting anything to do with crop losses. I've never seen such fierce storms in my 20+ years here in Spain. Vegetables and fruits are getting more expensive by the month.", 'Joe Meyer': 'Trudy’s Snow Cone, now in GSM Rainbow Flavors!', 'jose ramirez': 'GORE!!!!!....Stop hidding in your prepper shelter !!!  Dont you see..Its all covered with snow!!!', 'TheGateKeeper': 'I Cor. 1:27 "But God hath chosen the foolish things of the world (GSM, climate deniers) to confound the wise (Global Warming Crew); and God hath chosen the weak things of the world (us) to confound the things which are mighty (the elite);" my emphasis.', 'fathead adolf barry': 'i accidently grew corn in my garden by throwing handfulls of wild bird seed on the dirt..'}