{'noemi barrios': 'jOHNNY ENLOW ON THE Elijah list prophesy include race horses too check it out  very revealing there is a horse named JUSTIFY that won all the races', 'T Kinney': 'Ripped & stripped is frazl dripped. Define [phonetic][IPA(key)] by 3.', 'Donnie Jones': 'I see prophecy world is in favor of killing people now. Your as fake as Mark Taylor. Tell vlad I said hey or at very least the republican propaganda pushers your working for.', 'maureen8cruise': "Yes...FEMA was going to round up Christian's and God has a sense of humor....now they they will be rounded up.", 'Eric Dell': 'I pray Obama and Clinton go to prison. Praise God.', 'Alex': 'Does anyone know the name of the woman on this show or where I can find more of her shows online? Thank you and God bless!', 'Ed Ca': '🤣🤣🤣 let’s give them some Water Boarding   DAs bush says is ok to do 😎👍🏼', 'Kevin Mason': "Be honest my Christian friends.. You can't wait to see your Christian theocracy, prophetic signs?? Jesus weeps.. Describing people as degenerate??? .Christian by name, unchristian by action. Christian Taliban", 'Kate Walsh': "George Soros has already signed most of his assets over to his sons to carry on the attack on democracy so it isn't going to make a lot of difference if he dies. His sons are already taking over his evil planning. I know it will make a emotional impact on good patriots but it's not going to matter until God takes action on the whole family  and businesses.", 'Mini Cats': 'Mark I have no problem with you saying obama will go down and be charged with treason.  I pray to God that happens!! Praise and Glorify You Lord!!', 'Angela Skinner': 'RIGHT ON MARK. WHAT ALMIGHTY GOD HAS BEGUN IN THIS NATION, HE WILL SEE IT THROUGH. PRAY BELIEVE TRUST & VOTE .  WE ARE CO  LABORERS WITH OUR GOD...IN HIM WE TRUST TO TAKE BACK AMERICA  & MAGA......RED TSUNAMI   2018   2020  🙏💖🇺🇸🇺🇸🇺🇸🇺🇸', 'JesusIsComingSoon!': "I pray for our enemies so easy to judge them I know that justice will come because God is on the throne and always will be Obama, Clinton's, Bushes and all those evil people will pay one way or another. I pray for their salvation cause hell was not created for people..God is a righteous and loving God and He wishes no one to perish but to come to Him through His son Jesus. We all deserve the death penalty ..if it weren't for Jesus.. we may have already been there!", 'Debrorah Dykes': "Folks, martial law will be necessary-and those in the cities that are not antifa ... will be glad it's there ... has to be, Obama allowed the US to be invaded for 8 years ... realize how many people in the US that do not share our values ... so it will be interesting!", 'Dorothy Hall': 'Red', 'N Brown': 'There will be dancing in the streets when THE OBAMAS AND CLINTONS GO TO PRISON.  SERIOUS DANCING!!!', 'Mimi S.': 'Please, Remember,  THE  Executive Order that goes into effect on Jan 1, 2019 about MILITARY COURTS , needs to be active before the Clintons and obama are arrested! \n         * this allows for Spousal benefits NOT TO BE USED in Military Courts when spouses charged with illegal activities!  \n              All EOs are on-line.  Please Read them!     WWG1WGA!', 'Final Evangelist': 'Martial law and tribunals came when Hitler came into power. If we see this in USA, this in NOT God, but a fascist government like Hitler and Mussolini.', 'some body': 'The book of Esther was written as a allegory that as Evil  Haman plotted against Rightous Mordecai  and built a galliw to hang him, Haman was hung by his own device so shall the deep staters be hung by their devices against Trump and America', 'The End Is Near': 'NO ONE TRUSTS PROPHECY WORLD AFTER LYING DECEPTIVE CLICKBAIT TITLE USE', '91: 1': 'This is not a new interview', 'Windy Hicks': "Yes Sheila I've been thinking the same thing. Thank you for saying it he needs to die already and it would be very easy", 'LA NETA DEL PLANETA': 'NOBODY is in control!!! NOT the beast NOT satan NOT the false prophet!!!! but GOD ALMIGHTY YWHW and YASHUA his SON....', 'Kellie Hodges Annas': 'Amen! God Bless!', 'soMAGA Mama': "You want to see justice? You better get out and VOTE! If Republicans don't retain control of House and Senate, there will be no justice.", 'ipmala': 'Obama is a MUSLIM.... and Hillary is a Satanist.  I hope Trump destroys them both.  God Bless Donald Trump.', 'Patti Clark': "If Obama is stripped his SCOTUS appointments will have to be renounced won't they? Fulfilling some of the prophecy.", 'Chris Campos': "Once the Clintons and Obama's are being rounded up the 45th will need to declare martial law for the safety of the public. The Clinton's and Obama's along with the other deep state criminals will be locked up in Gitmo", 'D. Damn it!': 'McCain was not the worst but he got you!', 'John Morris': 'I seen a weird date 11-11-18... anyone confirm what it is?', 'DB Rox': 'I love the super hero villain comparison! Perfect! 👍😂 Red wave! MAGA', 'BOB THE BUILDER CAN WE FIX IT': 'HES RIGHT. IT JUST HAPPENED\nhttps://www.goupstate.com/news/20180914/horse-named-barack-obama-euthanized-at-world-equestrian-games', 'TheCodesearcher dotcom': 'mark taylor is a verified FALSE PROFIT....you who Yoke yourselves to him share in his fate.... thus says the bible', 'Morningflower J.': 'Once the truth is out on what they did they will lose many many supporters.\nLots of people are already leaving. They can see somethings not right.', 'Stephanie King': 'Sounds like mickey mouse rims to me.', 'Hal Kranz': 'Psalm 62:7-8 Trust', 'Exposing the Darkness with the Light of Truth': '*PRAISE THE LORD GOD ALMIGHTY!!*  *WE PUT OUR TRUST IN HIM COMPLETELY!!*', 'teresa cissna': "People are freak out I have my family prepared that's what everyone needs to do not rather we have or not have martial Law right now he has to take the country out the UN HANDS FIRST AND HES DOING IT", 'Stephen Heyer': 'All Christians will report to FEMA camps for re-education.', 'Night Wolf': 'America has been under martial law since Lincoln. It was never rescinded.', 'Tammy Eaton': 'Hildog and the others are about to do the orange penguin PERP walk!!!', 'Native Centurion': '*RED DELUGE is about to get started....    the DemonicRats ( aka CommieRats) are squealing & cannibalizing each other!*   Deus Vult!', 'John Revere': 'They, the luciferian inbreed elite cabal Illuminati minions were going to use martial law to round us all up into FEMA camps, where they would then take our children to eat, sexually assault, sale their organs sacrifice them and feed to their fake died deity baal god... \nthen use their guillotines that they have hidden throughout all of United States on us, AND use the thousand and thousands of huge plastic grave caskets we found that these DEMONS were then going to through eight beheaded victims in each one... then torch it up and Incinerate is all. \n\nTRUTH BOMB... these guillotines are hidden throughout all of the arm services throughout the United States and elsewhere.', 'Kathy12Ray': '*For a time is coming when people will no longer listen to sound and wholesome teaching. They will follow their own desires and will look for teachers who will tell them whatever their itching ears want to hear.* 2 TIMOTHY 4:3\nBE CAREFUL CHILDREN OF GOD....ASK HIM TO LEAD YOU AND SPEAK TO YOU HIMSELF,  IN JESUS NAME!', 'sam jones': 'How can you keep pushing out these videos every day? Is there money in it?', 'Joseph Long': 'I am gaining interest in your broadcast. Unlike most preachers I have heard, you sound real. I would like to know your take on chemtrails for controlling the weather, 5G for mind control and who is controlling these things. Does all of this fall apart if the dems win the midterm, or is there some chance we can get this cleaned up?', 'Solena Allen': 'Soros is actually 10 years older than believed. I believe Soros is already dead. It is now his son Alex causing the problems.', 'Linda Brooks': 'No fake prophecy re: the CARAVAN.  This is kinda  huge buddy,  maybe you should check your frequency.', 'Chatty216': 'Antifa is the worst, totally unhinged!', 'sonia jones': 'O bam mah going to prison', 'Joyce Taylor': 'Thought I read somewhere the Wikileaks was going to drop critical stuff on HRC by the 21st.  Today is the 21st.', 'mike peterson': 'The democrats already have the House of reps ( its over people). They are killing it in early voting. Its not even close. They will have a 5 to 10 seat majority  2 weeks from wed( guaranteed). The best hope for republicans will be to hold and pick up a couple of seats in the senate. 2019 will be the YEAR OF A SPLIT congress and NEVER ENDING impeachment talks and investigations against Pres. Trump. They will put an end to the Trump agenda.This will be the beginning of the collapse of America. The end times will finally begin. The new world order will begin as well as the mark of the beast. Get ready your chip awaits you.', 'Libertywatchman37': 'An Excerpt from the America America Prophesy: \n (Personal Observation: \nI supposed it is well to remember that Our God,  if considered at all, is by some who ‘takes Him with a grain of salt’ and thus the fear of God’s Wrath and judgment. not only in the hereafter, that "sometime in the future" if at all, is not a consideration. \n It would seem logical to conclude from all indications that Our Creator has reached the point of being totally “fed up” with the people who are citizens of this Republic that He had created for His Special Purpose and who concentrated to His Service which has deteriorated to the condition that rivals the conditions that existed in Sodom and Gomorrah. So many of those same folks who, in effect, take Our God’s judgment very lightly, or so their demeanor indicates, may well change their tune shortly when He through His Designated ones continue to witness His Wrath, His Judgement that continues to fall and that in some future maybe date but now today.\n\n WE AWAIT WITH SPECIAL INTEREST THE DEMISE TO BEFALL ONE AND ALL OF THE KIND OF MUELLER, ROSENSTEIN, THE CLINTONS, AS WELL AS ALL OTHERS WHO ARE OF THEIR DEMONIC KIND; ONE AND ALL OBVIOUSLY TOTALLY DEVOTED OF BOTH SELF AND THEIR GOD, LUCIFER THOSE OF US WHO BELONG TO THE HEAVENLY FATHER AND THUS TO OUR LORD AND SAVIOR AND REDEEMER, JESUS CHRIST FOREVER LEAN TOTALLY ON HIS PROMISES SO WE SIMPLY AWAIT THE TOTAL DEMIST OF THE ENEMIES OF OUR TRIUNE GOD AND THOSE OF HIS ELECT WHO ARE CONSTANTLY UNDER ATTACK. WE THEREFORE LOOK FORWARD TO THE FRUITION OF THIS DIVINE WARNING WHICH AWAIT EACH AND EVERY ONE OF THOSE WHO COMES AGAINST EACH OF THOSE WHO BELONG TO OUR HEAVENLY FATHER AND ESPECIALLY IN THIS DAY AND TIME THOSE OF HIS WHO ARE ESPECIALLY ANOINTED; HIS PROMISE SPECIFICALLY AS FOLLOWS:.) \n\n AN EXCERPT FROM THE AMERICA AMERICA PROPHESY\n"The Spirit of God says, “The Supreme Court shall lose three, and My President shall pick new ones directly from My trees (Five actually; one already appointed; replacing the murdered Scalia, one awaiting appointment and three that will either be prosecuted or step down to avoid prosecution.) Are you still not convinced that he’s My anointed, and that he’s the one I have appointed? Why can no one figure it out? The news media, the people, and the so-called wise? Why, when he’s attacked, do his poll numbers rise? Those who attack him, their numbers go low, even to the point of a big fat zero. It’s simple to see, this man I have appointed, for in My word, is your answer. I said, “Do not touch My anointed, especially My prophets.” If you are still not convinced about what My word says, another sign will be given. It will be a WARNING TO ALL, especially those who will NOT LISTEN.” The Spirit of God says, “The sign will be El-Chappo, El-Chappo, your evil reign has come to an end. Who do you think you are attacking My anointed? Turn yourself in and repent and I will spare you. If you do not, you and those that follow you will surely die a very public death for the entire world to see. For no one touches My anointed. I the Lord AM an all-seeing and all-knowing God. l will be the one to disclose your location, the den, the den, that you and your vipers hide in. For the time is short and the spirit of death is at your door, and the world will see your dead body and the red shirt you wore.” ~ COMMANDER IN CHIEF PROPHESY; AMERICA AMERICA PROPHESY conveyed vis Mark Taylor ——Forwarded by J. A. Wyatt, Jr., Mississippi State Univ. Class of ’61. IN OUR TRIUNE GOD WE TRUST; all else is highly suspect! \n\n WE AWAIT WITH SPECIAL INTEREST THE DEMISE TO BEFALL ONE AND ALL OF THE KIND OF MUELLER, ROSENSTEIN, THE CLINTONS, AS WELL AS ALL OTHERS WHO ARE OF THEIR DEMONIC KIND; ONE AND ALL OBVIOUSLY TOTALLY DEVOTED OF BOTH SELF AND THEIR GOD, LUCIFER. THE 50 TO 48 VOTER SENATE VOTE CONFIRMATION SERVES FURTHER TO IDENTIFY AND "SEPARATES THE GOOD FROM THE BAD; THE CHAFF FROM THE GOOD GRAIN\'\'; VIVIDLY PROVIDING IMMEDIATE UNDENIABLE IDENTIFICATION OF LUCIFER\'S LEGIONAIRES IN THE BODY OF THE U. S. SENATE; THAT JUST AT THE CONFIRMATION HEARING LIKEWISE SERVED THE SAME FUNCTION IN REVEALING AND CONFIRMING THE ID OF LUCIFER\'S LEGIONNAIRES IN THE HOUSE OF REPRESENTATIVES. \n\nDEMOCRAT REVEALED AS WHAT THEY TRULY ARE WHICH IS . . . LUCIFER\'S DEMONIC LEGIONAIRES, EVIL PERSONIFIED: DEMONCRATS!\n\nREPEATEDLY, OVER AND OVER AGAIN, THE VENEER IS BEING STEADILY STRIPPED AWAY; THE CLOSETS of EVIL OPENED FOR ALL THAT WILL TO SEE; THE EVIL REPEATEDLY EXPOSED.', 'harolyn allison': 'here is some scripture that says it all about Hillary Clinton. Revelation 22 verse 15. for without are dogs and sorcerers and whoremongers, and murderers, and idolaters, and whosoever loveth and maketh a lie. Micah 5 verse 12. and i will cut off witchcraft out of thine hand, and thou shalt have no more soothsayers. Ezekiel 13 verse 6. they have seen vanity and lying divination, saying the Lord saith, and the Lord hath not sent them. and they have made others to hope that they would confirm the word. Exodus 22 verse 18. thou shalt not suffer a witch to live. these are for Hillary and please by all means read them to her if she is executed. the punishment for treason is death.', 'Deborah Baker': 'I would be the first to have a TV station if I had the money. Faith based and clean programing.', 'Elizabeth S': "For the last 2 years there is not a week that goes by when there hasn't been A CRISIS and/or the deeds of Dirty Democrat Unearthed and Exposed.   Eveything the Dems meant for harm GOD has turned and used against them, and not only that, but the Fearlessness of President Trump has emboldend other nations to take a STAND AGAINST THE DARKNESS and to fight back through the power of THEIR VOTES.  \n GOD is granting the entire world a Second Chance and yet NONE of it would have happened if Donald Trump hadn't been chosen to be the man to STAND IN THE GAP for the United States of America- GOD Bless him and grant him all the Courage that he will continue to need to shoulder the burden of his job.", 'Sharon Hartman': 'Red October = Early Voting! Got my red vote in already!!', 'Julie Vigeant': "I do believe that Trump won't have any choice but to Order some Martial law when the mass arrests begin for safety reasons. It's just common sense for Pete's sake. I think something BIG, WONDERFUL and JUST is well on its way.", 'MrEvilbyte': "November is when everything will go down, everything will happen. Quite possibly the world will be shaken to it's core.\nI can hardly wait....", 'Regina Terry Megginson': 'AMEN!  CHRISTians CANNOT be held by these demonic illuminati.  Period! 🤗😇', 'MOODY V.': 'Lady stop puting it on so thick you sound stupid the way your talking thanks Mark for your videos', 'Sandi Que': "Oh, Mark.  I believe in the word of the Lord God Almighty.  I believe in the Lord Christ Jesus.  I believe in the Holy Spirit.  I know His will be done.  I don't have a lot of patience when I see innocent children hurt.  Oh, Lord, please hurry and unleash your wrath on this EVIL. AMEN.", 'Paul Walz': 'Obama is toast. Take that to the bank', 'fawn999': "George Soros is a worlck. why is he still free t fund all his evil followers??  I can't wait for him t b aressted and put away..he is sooo evil. !!!", 'Pam Fletcher': "Rev. 12:13,14 is America's divine destiny!  Trump is right on track!  Even so Lord Jesus, come QUICKLY!", 'S Miner82': 'Soros has access to life extension health therapies.  He has a long life ahead of him.  That needs to be stopped.', 'Teri Badeau': 'Ovomit & Killary will be in prison,  while they wait to be put to death for treason,  murder,  and probably many other crimes!!  Remember,  our POTUS does have the evidence!!  And soon We WILL see the proof!!  Soros will also be put to death!!\nIt really is hard to be patient,  as we watch these evil satanic scumbags continue to wreak havoc!!!  \nPlease Lord,  make it happen soon 🙏🏼🙏🏼', 'Tracy Goad': 'I trust president Trump. I trust in the Lord. I just pray everyday for peace.Pray Everyone .', 'JB McGregor': '.  I do not listen to anyone in the media nor do I believe anything they say or write. All of this has been happening for so long yet there is no evidence of anything being done to any of these thugs.  A few have been charged with leaking and they get a whopping 2 to 4 years jail time, gee that is terrible.  These Antifa thugs are still being allowed to protest and injure at will.  No punishment for this at all.  Congress will never support anything our great President has done nor will do.  I pray daily about the mid terms, our great country and of course, our President, his safety as well as for his family.  Gitmo has cushy quarters, chefs, internet, etc. the whole nine yards so this is punishment?  People that have committed treason against our country (there have been many) should be hung.  If others saw this done in public, you could safely say it would be remembered for decades.. If these evil pedophiles, those involved in devil worship, human trafficking, sexual abuse of the innocents are ever brought to justice, it should be made public for all to see.  Nothing should be covered up behind closed doors as so much has already been done with all of these closed hearings.  I pray because God is in control and nothing will be done without His knowledge & blessing.', 'Life & Life more Abundantly': 'Pray to Christ that these illegals get deported, get with Christ and start standing up against the tyranny in their own nations now. This illegal invasion is of the devil.', 'Catalina Isenhart': 'I STAND WITH MARK RED TSUNAMI WWG1WGA.', 'Transfurgroomers1': "Mark's right...  everything they were using against us will be used to trap them", 'CAJUN Jamis': 'PUNISHMENT FOR "TREASON" IS DEATH!   Not "Going to Prison"!'}{'noemi barrios': 'jOHNNY ENLOW ON THE Elijah list prophesy include race horses too check it out  very revealing there is a horse named JUSTIFY that won all the races', 'T Kinney': 'Ripped & stripped is frazl dripped. Define [phonetic][IPA(key)] by 3.', 'Donnie Jones': 'I see prophecy world is in favor of killing people now. Your as fake as Mark Taylor. Tell vlad I said hey or at very least the republican propaganda pushers your working for.', 'maureen8cruise': "Yes...FEMA was going to round up Christian's and God has a sense of humor....now they they will be rounded up.", 'Eric Dell': 'Write term limits this November for Congress on your ballots.', 'Alex': 'Does anyone know the name of the woman on this show or where I can find more of her shows online? Thank you and God bless!', 'Ed Ca': '🤣🤣🤣 let’s give them some Water Boarding   DAs bush says is ok to do 😎👍🏼', 'Kevin Mason': "Be honest my Christian friends.. You can't wait to see your Christian theocracy, prophetic signs?? Jesus weeps.. Describing people as degenerate??? .Christian by name, unchristian by action. Christian Taliban", 'Kate Walsh': "George Soros has already signed most of his assets over to his sons to carry on the attack on democracy so it isn't going to make a lot of difference if he dies. His sons are already taking over his evil planning. I know it will make a emotional impact on good patriots but it's not going to matter until God takes action on the whole family  and businesses.", 'Mini Cats': 'Mark I have no problem with you saying obama will go down and be charged with treason.  I pray to God that happens!! Praise and Glorify You Lord!!', 'Angela Skinner': 'RIGHT ON MARK. WHAT ALMIGHTY GOD HAS BEGUN IN THIS NATION, HE WILL SEE IT THROUGH. PRAY BELIEVE TRUST & VOTE .  WE ARE CO  LABORERS WITH OUR GOD...IN HIM WE TRUST TO TAKE BACK AMERICA  & MAGA......RED TSUNAMI   2018   2020  🙏💖🇺🇸🇺🇸🇺🇸🇺🇸', 'JesusIsComingSoon!': "I pray for our enemies so easy to judge them I know that justice will come because God is on the throne and always will be Obama, Clinton's, Bushes and all those evil people will pay one way or another. I pray for their salvation cause hell was not created for people..God is a righteous and loving God and He wishes no one to perish but to come to Him through His son Jesus. We all deserve the death penalty ..if it weren't for Jesus.. we may have already been there!", 'Debrorah Dykes': "Folks, martial law will be necessary-and those in the cities that are not antifa ... will be glad it's there ... has to be, Obama allowed the US to be invaded for 8 years ... realize how many people in the US that do not share our values ... so it will be interesting!", 'Dorothy Hall': 'Red', 'N Brown': 'There will be dancing in the streets when THE OBAMAS AND CLINTONS GO TO PRISON.  SERIOUS DANCING!!!', 'Mimi S.': 'Please, Remember,  THE  Executive Order that goes into effect on Jan 1, 2019 about MILITARY COURTS , needs to be active before the Clintons and obama are arrested! \n         * this allows for Spousal benefits NOT TO BE USED in Military Courts when spouses charged with illegal activities!  \n              All EOs are on-line.  Please Read them!     WWG1WGA!', 'Final Evangelist': 'Martial law and tribunals came when Hitler came into power. If we see this in USA, this in NOT God, but a fascist government like Hitler and Mussolini.', 'some body': 'The book of Esther was written as a allegory that as Evil  Haman plotted against Rightous Mordecai  and built a galliw to hang him, Haman was hung by his own device so shall the deep staters be hung by their devices against Trump and America', 'The End Is Near': 'NO ONE TRUSTS PROPHECY WORLD AFTER LYING DECEPTIVE CLICKBAIT TITLE USE'}