{'Paulson Prasad': 'CNN the worst narrative a news channel can offer', 'Novac 3': 'Jim Acosta should give up already while he still has SOME dignity left', 'shadow panther': 'communist news network spewing out there fake propaganda once again nothing new there', 'Michael Parleblue': 'CNN should be banned from asking questions!', 'Chris G': 'Thank you Mr. President!  Take care of America first! MAGA 👊', 'David Tovar de la Lama': 'CNN will do anything to change reality. Running dogs of the elites of EEUU =CNN', 'The Goat': 'USA !!! USA !!! USA !!!', 'R_ Reveley': 'CNN cucked numb nuts', 'John Chase': 'Ban That piece of shit and CNN.  Race baiting, false news spreading, liberal, NPC  scumbag.', '99v8cobra': 'Trump Rocks.   USA', 'Jamie Lannister': 'A brain damaged puppy aborted could own Jim Acosta.', 'Maxx Gibbs': 'God bless this President and God bless the United States of America!', 'Alexandra Shaw': "you're either a patriotic nationalist who loves your country, or you're a unpatriotic globalist who doesn't love your country. There really isn't any in between.", 'Werner Sunkel': 'Cnn are terrorists', 'Cyphlix': 'Jim acRacist', 'Dave Stevens': 'Dear diary,\nTrump was mean to me today...', 'Christian Alvarado': 'A President is supposed to be a nationalist just like a congressman is supposed to be a statesman.', 'organicsuperman': "You know what's amazing with Trump, the amount of scrutiny the guy get's put under for everything he says and does but the likes of Obama when president and Hilary were not even given 50% of this type of treatment all because they kept the media happy and said the right things from the scripts, it's pathetic ! TRUMP 2020 is inevitable. What the hell is wrong about being a nationalist ? aren't we supposed to care about the countries we live in ? Oh but GLOBALIST is ok and nationalist is not and somehow because you are a nationalist this means you are inwardly ? media spin is out of control.", 'Chris 570': 'CNN is terrible', 'Mario Uno': 'May our GodLord bless the best President of the U.S.A.ever. long life Mr.President Donald Trump. The very best ever. Our GodLord sent Him.', 'Train Boxing at Home - Ty Thomas': 'Jim Acosta is an absolute deranged psychopath', 'Martin Gordon': "When Jim Acosta's hair turned white it was a secret dog whistle to his white friends that he was white. What a racist!!!", 'raymon kravagna': "CNN just can't wait for a race war!!", 'T. H.': 'Mexican Americans For Trump \nI’m also an AMERICAN NATIONALIST 🇺🇸', 'Kevin Fugikawa': 'Jim Acosta is an idiot.', 'Lawrence Willey': "Jim Acosta like all the other arsehole reporters are supposed to report the news not dictate or accuse people, this so called reporter should be sacked he's a bloody aggravating parasite!!!!", 'Redrum': 'CNN   IS THEE ENEMY OF THE PEOPLE.', 'Yotsuba Koiwai': 'Acosta is a little bitch.', 'Pt Bot': 'White POWA! \nOh CNN... so cliche', 'South London Metal Detector': 'never ever have i ever seen a President so disrespected discusting', 'fdoarzola': 'Jim Acosta hates America...', 'Timeoftroubles': 'I’m Mexican, I’m conservative and I say Acosta is a lying, race-baiting, piece of shit.  MAGA!!!', 'vnfight': 'Fuc.  K Jim Acosta', 'ebayfools': 'One of my Trump hating friends freaked out when Trump called himself a Nationalist. The idiots on the Left look up to this shill Acosta. Unreal.', 'ghads31': 'Destroyed', 'Radix Malorum': "Nationalist just means someone who is for the political independence of one's own country.  If you don't want the US to be independent then you're a traitor.", 'L. Bailey': 'A dweeb Costa.', 'dtadeo2006': "TRUMP so busy and on the go doesn't even have time to fix his hair sometimes.", 'Scott Capell': 'Go Trump Tsunami of red x 1000000000000000 million!!!@@@', 'brickbatz': 'Jim Acosta is a professional troll.', 'frogsoda': 'Jim Acosta hears dog whistles. What does that say about Jim Acosta?', 'HashimTheDream': 'I AM A NATIONALIST JUST LIKE MY PRESIDENT! SIT YOUR BITCH ASS DOWN, ACOSTA!', 'James Lucenti': 'Acosta is a walking dildo,an idiotic moron who should be working as a cashier at a porn store. He has the i.q. of a cracked bowling ball without finger holes.', 'Barry Smith': "Dear Diary ....why dont people like me? i am a poorman's beta george cloony. who wouldnt like that?", 'deadboy600': 'As usual, Libtards are trying to make a stretch and connection to something that\'s just not reality. \nThe full name of the Nazi party was, "National Socialist German Workers\' Party." The word "national" in German is pronounced "Nat-zee-oh-nal" and so the party name was abbreviated to \'Nazi." If you look up "Nationalist" in the dictionary there are a few interpretations but they all revolve around one core thought which is simply love of country, patriotism, and interests in primarily advancing and improving one\'s own country and the lives of its citizens. Real bad word huh?\nBut because of WWII and The Nazis, the word "nationalist" became associated with Nazism, fascism, and racism. So needless to say Liberals jumped all over this after Trump declared himself a Nationalist.\n*What\'s ironic is that Liberals are quick to jump on the word "nationalism" but I guess nobody noticed the second word of the Nazi Party\'s official name..........."SOCIALIST."*', 'truckeemick': 'jim acosta is from a long line of homeless and stateless ass holes. does not deserve to be a us citizen. does not know how to treat his homeland or the most loved and respected potus in a lifetime. he is a treasonous traitor who needs to be checked.', 'The Undaunted': '"Nice try, Jim. Now fuck off." Said Trump never.', 'Aaron Garrett': 'I love the fact that this great president loves his country this much and cares about the working men and women of this country trump is a godsend he the greatest president I have seen in my 54 years if he would have ran for president   When shit stick was running America would be in way better shape right now  love trump great job .Jim Jim Jim can’t believe you got a job at all . the last three presidents sold out America there nothing less then traders that should be in prison', 'Aitutakikuuipo': 'Why does Jim Acosta still have a job?', 'Clinton Rusthoven': "I'm a white nationalist...there, I said it! I'm white AND I'm a nationalist!!!", 'Victor Johnson': 'Acosta should be beaten up by the secret sevice guys for that.', 'LIV FAST': 'LOVE MY PRESIDENT!!!!', 'go wild': 'CNN ,ENEMY OF THE PEOPLE,', 'Darla Murray': 'Fuck Jim acosta ,go get him trump!!!!!😇😇😇😇😇😇', 'Joe Griego': 'CNN is a hate group', 'lakeraiderfan56': 'CNN= the Clown News Network....the Counterfeit News Network', 'Gregg Powers': 'Trump is "THE MAN"!!!!', "DAVID AFTER GOD'S OWN HEART": 'we may hear with our ears, but understand with our mind. Acosta is part of the warped left..he twists every word President trump speaks because his mind is warped.I am not from US, but for the first time in so many decades you have a President who thinks of his people first.', 'Toby Wright': "Everyone I know hates CNN.  They're a laughing stock.", 'christopher mozdzen': 'Jim Acosta. A Professional CUNT', 'AroundSun': 'Dog Whistle = insert phony evidence where clearly none exists', 'True Grit': 'Being a Nationalist is being a Proud American.', 'adam adam': "Trump lays nuclear bomb all over Jim's racist crap.", 'Ken Aguilara': 'TRUMP OWNED CNN Ocosta here ... My God CNN- do you even love our country?? WTF??\nLove my President!! TRUMP in 2020 !!!!!!!', 'Lafe Crick': "I'm a Nationalist too  so suck on that Jimmy BOY Acosta", 'Donald Adams': 'Jim A is an asshole.', 'Simple Truth': 'Jim is a socialist. CNN and MSNBC are propaganda.', 'michael kohlberg': 'Yesssssss', 'Christian Frenz': 'Jim Acosta pledges allegiance to Israel', 'Ken Driessen For US Congress WI 7th': 'Trump is only a Nationalist in the Nazi sense of the word,  other than that in reality Trump is closer being a wahhabist than a Nationalist once you realize he has more business deals going with the Saudi Princes than even the Bush family.', 'G Milla': 'TRUMP FOR LIFE PRESIDENT!!!!!!!', 'Milo The Russian Blue': 'CNN loses again.', 'A I': 'FUK CNN PERIOD.  YES I DID MISSPELL A WORD.', 'usssanjacinto1': 'CNN: Trump announces he was to invade Europe as a nationalist.', 'bellmeisterful': "Jim's not interested at all in what he's saying. Hes thinking, oh good, he didnt deny being a white supremacist/racist. Thats it.", 'Jose R Fernandez': 'That is why 911 happen Moran judging with money. GOD IS THE WOMAN. Polank america', 'Levi 501': 'Love the Trumpster!!', 'Proud to be American': 'Acosta is SCUM. This pathetic  freak comes from Cuba, Acosta is an enemy of America!', 'Saul Garcia': 'finally! a prez that puts america first. trump is a patriot. liberals hate that trump is putting america first!!!!', 'Thefireman 285': 'I would crawl on my bare hands and knees over broken glass to vote for President Trump!', 'Scott Nagelberg': 'Acosta loves Acosta.', 'TheFloridaPappy': 'Why do they let that scumbag Acosta anywhere near the Whitehouse?', 'OarsmanPower': 'I hope we get more intelligent business people in office. President Trump has been on a roll his entire life. To him, America is a place he loves, wants to protect and doesn’t give a shit what the left thinks. I love it.', 'BumbleBeeTuna': 'What is wrong with a President taking care of America first?', 'LaughTooHard': 'This race crap has really gotten old.', 'AleX HaZe': 'CNN is a cesspool', 'Mike Hunt': "And for all u red STUPIDS MS-13 was founded in L.A. it wasn't till some where deported back to their countries the gang grew !! A little TRUTH !! for the day", 'Gary Simard': "He should have called him out for insinuating that he's a racist. Then tell him to leave and never allow him in again until he apologizes for asking such a disgusting question.", 'Joseph Dunbar': 'Did Jim Acosta say dog whistle? So is Acosta calling trump supporters dogs?', 'dede denver': "How the hell does Acosta keep his job?  What a prick.  I can't dispute anything that our President said here.", 'Charles Martel': "Note how liberals are the only ones who talk about race.  All the left does is yammer on about race, typically either painting one race as a victim or quite frankly, vilifying whites in hate-filled diatribes.  If the left would shut up about race, we might actually begin to see some peace in this country and get along.  But they don't want that.", 'Norbert Nagy': "I don't get it when jim says u sending dog whistle \nSo its ok to call white people dogs but its racist to call black monkey 🤔", 'Pirates Fate': 'Acosta is a Cuckold sissy twat!!!', 'Anthony Warren': 'CNN stands for criminal news network network', 'Biffalo Bull': "I never thought I'd consider anyone an equal to Reagan/Jefferson/Jackson et al, but in 2 years in the office, he's already right there. If I'm a senator or congressman and want to be re elected till I die, first thing I'm doing when Trump's 2nd term ends is propose a national park in my state with Trump's statue in it.", 'Colonel Quail': 'Why even let asshole propagandist acosta in the oval office', 'MrSideboom': "Nationalist vs globalist... I'm a nationalist too!", 'Jesusjuice32': 'Cnn will cut the whole 2 min response to the last 10 seconds where he says "so yes im a nationalist and proud" to make him look like a white supremacist supposedly sending "code signals"'}{'Mark Ross': 'How can ANYONE hit a thumbs down to this? Get out of this country if you hate t so much. And, Jim Acosta isn’t smart enough to understand Trump answer. Maybe the 40 thumbs down aren’t either. Trump 2020', 'Mike Hunt': 'The most PATHETIC part is you stupid motherfuckers think cause your repukes your exempt from getting fucked along with the rest of the country 🤔 truly PSYCHOTIC', 'Charley Vee': 'Acosta is a fucking moron', 'ǝsoןnoʎuıʍı': 'God Emperor Trump', 'Jeffrey Werner': 'Glamour boy Acosta, where in the hell did he go to school?  With people like that at CNN, no wonder they can’t average over 700k viewership daily for their shows.  They are Cesspool CNN.', 'Luke Henry': 'He should lock Acosta up', 'Mike c': '"Jim Acosta" code for douchebag', 'James Graham': 'Our President is absolutely Right!', 'road dogg': "Don't worry Acosta, with the immigration laws in place now whites won't be around much longer and then America will be a third world shithole equally.", 'monjiaitaly': 'WTH is wrong with being a nationalist?', 'daniel madeira': 'SHITTY ACOSTA KKKKKKK', 'Sijpie88 Sijpie88': '(I’m Dutch) I wish we had a leader like Donald Trump, and i cant believe that how much he try to do only good things\nfor the people of America, that they (lefty’s and CNN) stil hunting for bad news.\nThey are the real traitors of the American people in my eyes.\nGO TRUMP !! ✌🏼', 'The real Yooper': 'Why don’t they bar dick head Acosta from the White House?  He’s nothing but a liberal leftist \U0001f92ethat has a huge ego that requires constant stroking.', 'Josh Bascii': "Is there a reporter worse than Jim Acosta? Who let's that Ass-clown into the oval office?", 'white zombie': 'Proud boy right here', 'Lbolting005': 'Jim Acosta is a bitch ass nigga man made hoe', 'Dee Smith': 'Acosta touched my balls.', 'N': 'I hope to God we bury the fucking Democrats come November the 6th....I personally want to see CNN and all the dumb shit reporters come un fucking hinged.... This man definitely has my vote in 2020', 'Spencer Carr': 'Europe has opened their borders.  Not to us, but Muslims lol.', 'Steve Koss': 'Acosta a Cuban Commie Bastard!', 'Sniping': 'What a RACIST !!!\nHe wants to lookout for the United States first “  \nthen other countries second ? \nThat’s  a racist remark and cnn says it’s so..........\nWhat kind of world are we living in ? \nWhere did the logic go ?\nWhat country would take care of it’s own first “\nThen take care of others ?\nThis is CNN...........\nI guess If you thinking \n“” ONE WORLD ORDER “”\nthen you would understand this thought process.', 'Macca': 'Jim Acosta is a CNN blowjob.... CNN is fake news', 'aeiq1219': 'Moron Jim Acosta, just working hard to provoke Trump and make him look bad in the public eye, such a slime, gutless piece of shit.', 'Jaymz B': '38 NPC down votes', 'Red Wave': 'Nelson Mandela was a *Nationalist*\nGandhi was a *Nationalist*', 'DavidV': 'I have no words for how stupid Acosta is... There are no words to describe what a selfish, stupid, feckless moronical hack this guy is.', 'RetiredOlNurseyMamawME': 'Good for our President👏👏‼️', 'Rusty Shacklefordussliberty': 'Jew Acosta with the new boy trump doing a "work" our liked out fake paradigm the Jewish elite suck at script writing', 'seamorgh21': 'Jim Acosta is trash. He needs to go take a vacation in Gitmo.', 'Fox Moulder': 'Enough said! Trump put the hammer down. If you do not believe what he said, research it. What he says is 100% true. Trump is making hard decisions that nobody else wanted to do and it needs to be done or our country will continue to suffer and lose ground. You may not like him and you may not agree with everything he does or how he does it but you cannot argue with facts and what he presented is FACT. I voted for him and at times wished I had not but as we get deeper into his first term I am once again glad I voted for him. I wish he would lay off Twitter and be more careful with his words but he is more than words like most. He is all action.', 'Osman Chaudhry': 'Jim likes to get ripped a new one he actually likes it', 'Mark Duxberry': 'jim is a right cunt...maybe jim should FUCK OFF and find his roots...', 'randall pearcy': 'Communist News Network', 'DuWayne Huss': 'Did Jim Acosta say he likes little boys and not in a good way? That is what I thought he was trying to say or that is what he meant.', 'katman77018': 'why is it we have to pay israel all this money every year and protect them and give them all our high technology stuff, and then they go and sell and or give it to russia and china?   trump is full of shit. its all a reality show and always has been', 'Tony': 'Im Voting Democrat on December 6th!', 'Dilly Dilly': "Who's side is CNN on? Certainly not on America's.", 'Crazy Fish': "I guess I'm what Trump is.", 'Push Back': "Too bad Trump didn't have a mic to drop.", 'tanmoy313': "Why does trump believe an Arab Muslim over American Christians like Republican senators??? I don't get it", 'Aaron Haskins': 'Nationalist does not mean White Nationalist. White Nationalism was a creation of the Democrats.', 'James Engeman': "Trump is such an asshole. He thinks everything is about money. He doesn't understand shit about Domestic or Foreign policy. The reason we pay more to NATO is because we have the largest economy in the world, although Trump is changing that. We have military bases in Germany. Have you seen any German military bases in the U.S. We maintain a military presence all around the world. Who should pay for that, Luxembourg?", 'Andrew ///': 'You can’t argue with him. Clever chappy. Scotland x', 'Jason Litherland': 'Doesn’t matter how good his response was. People still FEEL like he’s a white nationalist. And that’s all that matters to low IQ cable news viewers', 'Jesse Dunham': 'Jim is a dumb fuck', 'Marco Yankovich': 'CNN = Very Fake News', 'Carmelo Chemtrails Killer': 'Is acosta that stupid or a Moron?hes and instigator get out of our Nation this is a Nation of all Races domb ass am tire of your stupidity everything you do is to create division', 'cartelli50': 'Acosta’s a bum. CNN = Garbage Network', 'Joe Smith': "CNN Acosta gets schooled again.  I'm a nationalist also, maybe Acosta is a Nazi race batter with one line of work fake news reporting. That's how Hitler build a crowd.", 'Gee G': 'If you love your family and love your country, you’re a right wing extremist', 'Everett Carroll': 'Anyone know Jim Acostas\' address? I think someone would like to send him a "package"..', 'Caz Gerald': 'Will it ever be OK to punch a globalist?', 'joe 90': 'The evil media. Go pres', 'Greg Hample': 'Jim Acosta has gerbils stuck in his ass', 'WaywardTiger': 'Jim is the douchiest of douches', 'Lee Deville': 'Ghandi was a nationalist... So was Mandela.', 'jedi26 jedi26': 'There is just no comeback after that response, Jim must go embarrassed and went to his safe space after that.', 'Doctorknowledge Nyathi': "Trump's Lecture", 'Ferdinand Marcos': 'A few colleagues and I have had discussions from time to time. We have them in our office in a private setting. We don’t dare discuss politics in public because we know we will be thrown under the bus by liberal HR. They will wash their hands of us at the first complaint, where we might had said something that wasn’t politically correct. So, what we have said was that we knew that our country was seriously doomed. There was no way to bring it back from the destruction of the left. For too many years they have watered down our constitutional rights, imposed their socialist agenda upon us and handed our jobs to foreign nations that has lead us to the brink of our own destruction of a once great nation. But... A miracle has occurred, we never saw it coming. My colleagues and I absolutely know that President Trump has saved our country. We believe in him. We voted for him. We are voting for his agenda. \nWe are what’s known as The Silent Majority. We can’t speak aloud yet, But We Can And We Will Vote! Thank you President Trump! Thank you our great Commander in Chief!', 'Paul David': '👌👌👌👌👌👌👌👌🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🤗🤗🤗🤗🤗🤗🤗🤗', 'Dino Cline': 'Ya Bitch!!', 'columkenn': 'CNN is shameful. Hopefully their ratings continue to plummet', 'Carlo Bruno': 'Why the reports are so full of crape', 'NewPScity': 'FUCK CNN. Clown news Network', 'frank': 'Love our President. 2020 is going to be suicidal for the left lol. \nMAGA 🇺🇸', 'Jake Cutter': 'The greatest President America has ever had, and perfect timing as he came right after the biggest disaster America has ever had (Obama). If only the idiotic left could open their eyes and see the greatness that is TRUMP.', 'Benjamin Trif': 'Boom Jim got head shoted!', 'Scott 250r': "CNN is a joke.  Lies Lies Lies. Jim Acosta is such a Doosh bag and has little dick syndrome. That's why his wife left him.   TRUMP 2020", 'Mike W': 'CNN IS A GARBAGE SO CALLED NEWS CHANNEL', 'Scott Gust': 'LOL coded language?? LOL! nice try socialist fake news!', 'Mike B': 'Jim acosta is pure evil.  He Hates this country with every fiber of his being and wants to tear it down.... kind of like Obama.', 'William alvarez': 'Jim is a idiot', 'ssbro3': "The attack on cnn and dems can't be coincidence. Making dems victims will get them pity votes. They get sadder by the day. Dem days are gone baby gone", 'LATVERIAN1': 'TRUMP 2020', 'Jensen Beach Florida': 'Acosta is a Communist!', 'Number one Duno': 'I am a Nationalist!🇺🇸', 'dande tande': 'Jim Acosta Beyond retarded for real now', '20sentryboy': 'Wow, they never stop. How much more can they possibly embarrass themselves and destroy mainstream media. They never actually listen to what trump says, they only hear what they wish he would say, fucking morons.', 'Electric Boogaloo': 'Nationalist definition: a person who advocates political independence for a country. ...Nowhere is that racist. Democrat perversion is a helluva thing.', 'Jake C': "Nationalist means you are patriotic. It has nothing to do with race. Leave it to the left to put a bad spin on this. They can never give the President any credit whatsover. It's disgusting and I think many Americans are sick and tired of the constant bashing.", 'Bob Walsh': 'Trump loves America !! I agree, take care of America First', 'Erik Schroeher': 'Jim Acosta loves himself some Jim Acosta. All this guy does is grandstand and quite frankly, he sucks at it.', 'Chest Rockwell': 'Kavanaugh 2024', 'VIP P': 'Brilliant.  Fuk CNN', 'Josif Maracine': "Jim Acosta`s definition of Nationalist  =  white supremacist, KKK, KKKilary and Obama and the leftist Democratic party. \nPresident Trump`s definition of Nationalist  =  America First.   Doesn't matter if you're white, black, Mexican, Asian, Orange, yellow, pink or whatever.  AMERICA FIRST !", 'leafyutube': "Efficient video. It shows CNN's race baiting and fake news both at the same time.", 'Drikus Diamond': "What is wrong with Acosta? He didn't interrupt POTUS", 'Adam William': "So 10+ pipe bombs have been sent out to several top democrats and/or CNN. Right before the midterms. And by God's grace NOT A SINGLE pipe bomb detonated? Sorry folks, but I ain't believing that. \n\nJust another crazy strategy the democrats are using to try to swing another election in their favor. Sexual misconduct/rape didn't work against Trump and Kav, so now they're sending out pipe bombs they knew would never really detonate. Democrats are crazy, and they're desperate. Scary times in the United States.", 'Crypto Dali': 'No, CNN...Nationalism does not mean White Nationalist.  LOL', 'justanotherlikeyou': 'America First!👍🇺🇸', 'Phil': "Trump's patience with these lying scum race baiting media, especially treacherous c*nts like Acosta, is admirable. Meanwhile I'm patiently waiting for the day of reckoning and if an enormously large group of traitors are not soon hung or locked up for ever, I'll finally and fully understand the entire democracy left/right thing (as my gut tells me) is a big scam.", 'scooter Smith': 'Fucking shut down cnn they are fucking mentally unstable lying assholes trying to divide this country every single day. The fuckin mail bombings sent to Hillary soros etc they couldn’t wait 2 minutes without blaming President Trump as if he sent them. President Trump came out and condemned these actions and they say his words are hollow. They blame him saying he is causing this YET NOT A WORD about Waters Nancy telling the American people to get up in there face chase them out tell them they aren’t welcome for having a different opinion . These demorats who wouldn’t even READ the transcripts of women who came forward accusing Bill Clinton of rape were the FIRST ones to BACK UP Crazy Dr Ford WITH ZERO EVIDENCE. Wake up people. They are unhinged and mentally unstable.', 'Randy Miller': 'I LOVE & TOTALLY SUPPORT DONALD TRUMP...MY AMERICAN PRESIDENT...I WILL GLADLY VOTE FOR HIM AGAIN IN 2020 WITHOUT HESITATION. \nMAKE AMERICA GREAT AGAIN \nAMERICA 1ST \nAMERICANS 1ST \nGO BIG RED WAVE!!!!!', 'Nena Zamora': 'Trump is not a white nationalist he is an American nationalist', 'Mike Payne': 'Acosta is as worthless as teats on a boar hog.', 'Big White': 'America first is nationalism'}{'Ars 1': 'Cnn they send a bomb at your headquarters stop reporting bs plz I don’t want to see people hurt!', 'MICKS': 'Yeahhh', 'jg b': 'Will Jim Acosta ever stop being a f**ggot?', 'nathanielstephenbaue': 'The 35 people that disliked this video must dislike our country.', 'Bo PITBULL': 'Jim Costas is a coward and a flat out liar unamerican', 'J.R. Cash': 'Jorge Ramos is a racist! Jim Acosta is pointless..💩', 'Donovan Hall': 'Hitler was a nationalist, doesnt sound good.', 'Cee Cee': "The instigating, anti-american, racebaiting, fake poll, frequently wrong, corrupt media is going to act clueless now like they aren't the biggest fuel to this flame.", 'knowspin': 'Trump is all business and numbers. He’s far too busy to be caught up in some racist bs coded language, plus it’s not his nature, he loves America!', 'Broo Klyn': 'You tell them president', 'Elmer MCcracken': 'CNN....😅', 'sugarbear318': 'Thank god for Donald Trump', 'Ralph Voorhees': 'I hate CNN.   FAKE NEWS and the CORRUPT NEWS NETWORK', 'Steve Cousins': 'Trump owns the number one place as the politician that lies and creates stories even if they are blatant lies, half truths and fabrication. CNN does not have to spin bad press about Trump he creates it himself.', 'In The Pit': 'Ghandi was a nationalist, so was Mandela. Wonder what that gross marshmallow Acosta would say about those people.', 'Antanas Cibirka': 'Go Red or Go Dead - Blue Will Screw You!   End the DemonicRat party now and release those trapped on the urban multicultural plantation.', 'Mar Win': 'Any other president or politician given the same question would have withered up like a cold peepee. Love our President and his convictions and commitment to stay true to his values and our country', 'Gwen Mckinney': 'Throw all those left wing reporters out of our white house', 'Brad': 'Jim Acosta says it’s “a dog whistle”....which he apparently heard. If it were true, doesn’t that make him one of the “dogs”...', 'Joe M': 'He should have ended with   So fuck off Jim.', 'Paul Weatherby': 'Gay pride...not a problem. National pride? Oooo, dog whistle...we got a problem, folks.', 'rokmole': 'I dont want to eat amwrican food its dogshit', 'Russ Parks': 'Just about all my adult life I was a registered Democrat.  I voted for b clinton twice, gore, kerry and obama.  In 2016, I voted for President Trump, and I am proud to say that I am also a Nationalist.  I am a veteran.  I served eight years. And I put America first, always.', 'Psychohomosapien': 'The midterm elections will change a lot of things in this country. I predict that if the Conservatives hold the house and Senate,  Democrats will start to fall and  media avenues like CNN and  MSNBC will start changing their formats, including bringing on more conservative hosts. Watch.', 'Fifth Horseman': 'The left is loaded with hate and contempt.', 'eddie vic': 'Another dem pawn trying to defame our President. Cnn reporters are so pothetic its embarrassing. Wait until Nov 7th. You will hear wailing and nashing of teeth from the left....', 'None Yourbiddness': 'The Only " racist" Billionaire in the world paying out Millions in paychecks to Mostly brown folks...ever heard of a racist giving money to those he " is racist against" ? .... Think ppl....', 'whitey 1': 'They make it out like being a Nationalist is a bad thing because they hate this country the Marxist pieces of shit!! Notice how CNN never has a problem with Bernie Sanders  when he calls himself a Socialist!!', 'Propane and propane accessories': 'I liked Trump since I saw him in the movie home alone!', 'Halfstar3': "Jim Acosta just has to take it to a juvenile low level. They're like fuckn babies this soft ass CNN leftists 🙄", 'Jun Gleno': 'Take that you whiny crybaby excuse of a reporter.', 'DANTE BELGIAN MALINOIS': 'Nice try u little Weasel! The face of Fake News: Ocosta', 'G K': 'ACOSTA went low and TRUMP respectfully took his head clean off. MAGA, crush an acosta', 'Barry Jones': 'Boom made him look a knobhead.  God bless trump wwg1wga MBGA come and be our prime minister god bless from the uk wwg1wga MBGA', 'Richie Fish': 'CNN LIES', 'Stephen Mason': 'Does Dim Jim wear the flag in his lapel?', 'Felix Bermudez': 'where is Acosta little package', 'J B': 'Rapin Jim at it again. His family must be ashamed to be associated with such a scumbag', 'Francis Porretto': 'Why Jim Acosta retains access to the White House -- let alone to President Trump! -- I cannot imagine.', 'Chris M': 'Jim Acosta trying to split hairs and sounding like the Spanish Inquisition. Dick!', 'God Bless General Lee': 'Jim Acosta is an America hating piece of shit.', 'thomas white': 'CNN lost all significance, way back when they covered O,J Simpson 24 hours a day 7 days a week for 2 years.', 'gary kennett': "Jim,  you are CNN's biggest IDIOT", 'Daniel Hammer': 'Trump should just ban that dirt bag', 'FBI Loli Division': 'Unfortunately Fox News is turning into CNN LITE', 'Devon MacDonald': 'Love my President 🙋‍♂️🍁', 'TWDxKILL3R': 'CNN trying to be biased and instead of asking good questions, they ask stupid questions about something Trump said to try and trip him up to make him look bad. Nothing new to see here.', 'Red Wolf': 'Greatest President of all time! ❤️✝🇺🇸💃🏿💃🏿💃🏿💃🏿', 'ynotttt': 'CNN has turned this into a racist term over night.  The term has never been a problem until CNN decided to invent trouble against Trump.  Here we are......this is our media in 2018.  Yes the they are the enemy of the people.  They make that clear with every fake newscast.', 'Donnie Bosarge': 'Acosta is such an IDIOT!!', 'Susan Johnson': 'Racist CNN...NBC...ABC...MSNBC...always making chicken salad out of chicken poop!', 'Javi Soprano': 'President trump makes too much scenes for the slow minded jackals', 'James Gao': 'Let Acosta speak ,please !!!! Every time he opens his mouth he makes CNN looks bad and makes Trump look good !', 'Ben Thair': 'Now all of the sudden nationalism is somehow deemed racist. How does anyone reasonable not see how radicalized the left has become? They hold nothing sacred.', 'TheLeadSled': "I am a nationalist as well, I served this nation in the US Army and loved it. The liberals will use every word that comes from Pres. Trump as a racist word, or a racist term or a code word for racism or white nationalist. These people see racism in every single thing in life especially if it doesn't go along with their warped ideology and beliefs. No one and I mean no one will tell me I cannot be proud to be American, this nation isn't perfect but it still is the best nation on earth; if it's so bad then why is everyone and their mother trying to get in???", 'K W': "I'm a nationalist! That dosent mean I'm a racist! America is full of all races!!", 'Tony Ey': 'Acosta has the IQ of a retarded monkey....', 'Goldpenny1': "Acosta is just another 3 dollar bill puppet used to stir up division in our great country that Trump is trying to protect.  Acosta like the others at CNN, MSNBC, and The New York Times have sold us all out, but in their feeble minds - get this - they have a better plan for us and our Constitution.  They've worked with the Deep State along with the Republicans who are Rhinos for decades selling us out. That's their fkd up plan - to keep selling us out and turn us into a 3rd world nation by letting (anyone) illegally in with (no limits) as to coincide with the amount of their madness, which they know will only continue to weaken us!!  They are traitors to all U.S. citizens; plain and simple that's all there is to it.", 'nigel106': "The thing about a dog whistle is, you and I can't HEAR it, Jim! We can't hear it. SMH 🤦🏻‍♂️", 'Jeffrey Miller': 'Jim Cucksta', 'hardrock3092002': 'acosta is a piece of shit . complete and total garbage. he should have been aborted', 'Ding Dong': "Donald Trump just explained very important belief of his on what our policy should be. Will Jim Acosta report that? NO! He'll make a little video clip and a little article that all his little children  on the left with hypersensitive problems and pull the race card!", 'Ronald Goldstein': 'Fuck u Acosta and CNN ban him from the white house', 'Cody Ables': "How someone hasn't beat Jim Acosta's  ass yet is beyond me.", 'Nathan Williams': 'Coded language?  Jim Acosta needs to find another career.', 'Mario L': '"I am proud to be a Mexican" said the Mexican\n\n"I am proud to be Colombian" said the Colombian \n\nI am proud to be Argentinian said the Argentinian\n\nI am proud to be American said the racist?!?! \n\nI am Mexican American and I hear all the time how MEXICANS are proud of Mexico even in the state it is in because they love their country. And same goes for any Latin American country yet anyone that says they are a Nationalist here in the US is seen as a racist, WTF! These Liberals have no shame.', 'Jack Smith': 'Poor Jim gets his peepee slapped again. The communist news network need to get over the fact that is why no one believes you🤣🤣🤣🤣🤣🤣', 'Lag Swag': 'Nationalist aka PATRIOT.', 'Wayne Ellis': 'CNN sucks!!!Acosta is a bone head......why do they even answer this idiots questions.', 'TyrannyTerminator': 'Make it illegal for journalists to only give grains of truth.  They must disclose the whole truth.', 'Roger T': "How do you get white nationalist out of him saying he's a nationalist?", 'DELTA DJ': 'CNN CBS NBC MSNBC ABC Race Baiting Riot starting Pieces of SHiT!! CNN has done\xa0\n\nnothing but stoked fear and Hatred amongst Americans,...for some reason I feel all this bomb crap is set up by the Dems to get people to vote for then , making it look like trump started all this and we need him out NOW, will never happen CNN and the Dems are begging for a civil war, Careful what you wish for..CNN stands for nothing and thrives on chaos and playing people off each other', 'Henry Hawk': 'Jim Acosts needs to be put in his playpen, Trump is way above Acosta', 'Cade LeBlanc': 'Yea....so sit the FUCK down and shut the FUCK up Jim Acosta!!!', 'Bears Fan 34': 'President Trump you RULE!!!!', 'Bk Hodges': 'Well it true dump is a racist.he and is cult.', 'Jerard Wald': 'Jim Acosta so ignorant', 'Ruben Lopez': 'I am a nationalist! Nationalism has no race. One nation under God, indivisible, with liberty and justice for all.', 'Red': 'White = Wise', 'Dave Whalen': 'Nationalism makes sense. I will always pray in a national spirit. God and country first!', 'louis Kwaku': 'CNN never stops. Lol', 'jojoblonix': "we have been treated so wrong for so long when Trump came around and stoppped the whole show and cares about AMERICA FIRST, people freak out.. it's sad, but let's take care of home first.", 'Leo Sheetz': 'Nationalist and proud. Been saying this for years. Hispanic and nationalist', "John O'Murchadha": 'This president guy is just the best!', 'Allergic To Bullshit': 'They should make toilet paper and print CNN on each sheet.', 'R Stefanie': 'ACOSTA SHOULD HAVE HIS WH PRESS CREDENTIALS REVOKED.', 'Bruce Roberts': 'Acosta makes this stuff up. He has not credibility in journalism. He is even a despicable human being. How he even got a job is head scratching..... he definitely slipped through the cracks.', 'undertaker11ism': 'CNN aka Communist News Network', 'Michael Lawrence': 'What a wanker is Acosta.', 'Verebazs': "Ban GMOs, then we talk about lifting trade barriers on agricultural stuff! We don't need your poisonous foods created by the same company the created the Orange Agent!", 'Semper Fi': 'Trump is a fucking Pimp! Trump 2020', 'Charles Taylor': 'Jim Acosta is such a socialist tool!  Kids....if you don’t know what an “intellectual lightweight” is just listen to Acosta.  He should be the poster child for stupidity.', 'Guy Slater': "The media has lost the plot: they're only focused on their own narrative", 'NMK NMK': 'Love President Trump, how could you not ??', 'Tobby Martin': 'BOOM👊😬BITCH TAKE THAT SUCK IT CNN👏😁👏😃👏😄👏😅👏😆!', 'DESCRETE': 'ja is trash', 'Steve Eisenhower Eisenhower': "Acosta is doing a huge disservice, and besides I've identified myself a nationalist long ago. Reagan was a nationalist", 'JAMplusPAW': "I doubt if CNN showed Trump's response.\nTed Turner said CNN was too political and he wishes he still owned it.\nTed Koppel said that without Trump CNN would have gone out."}{'Nick Guadenzi': 'never batted an eye as he continued to hear the asinine question asked.', 'Jon Joyce': 'Basicaly what  hes saying is , all the shady deals made by corrupt liberals at the cost of america have to be stopped', 'Tim G': "I'm a Patriot & I suppose, a Nationalist, too. Law & order. America 1st.", 'Somlg': 'could it be that the Globalist hate the fact that donald trump say he is a nationalist?', 'Sky': 'What does skin color have anything to do with being a nationalist?', 'FF8WasTheBestFF': 'Why is this piece of shit even allowed within 20 miles of Trump?', "John O'brien": 'So true great president keep up the good work', 'American Made': "Acosta is such a moron😂😂\nI can't believe he's still allowed to be in the same vicinity as President Trump.", 'Robin Butler': 'The reason we need a business man in office, he knows his stuff haha', 'Valerie H': 'I’d love to see Acosta swallow a “dog whistle.”.', 'Ismale Cruz': 'Jimmy AssCosta and the rest of cnn always trying 2 twist and turn the words of the president 2 create there own spin on things. However the president fixed his azz with the quickness. Jimmy AssCosta the dirtiest player in the Fake Stream Media Game!!!', 'JoJoIcee': 'How does CNN keep getting away with this shit.. that question was absurd.', 'Patrick Roche': "Europe has trade barriers because the USA is using banned chemical's in its farming. Who wants to eat that chemical shire?", 'My2CommonSense': 'Gee, I wonder why the President calls CNN fake news?', 'Worldraven .Nevar': 'How the fuck can a president NOT be a nationalist? Only a worthless cuck of a leader is not a nationalist.', 'Keith McCarver': 'Once again CNN is race baiting! \nGod bless president trump!', 'James Crane': 'put trumps head In the centre of a donut and he becomes donut trump.', 'Fyodor48': '*OWNED!!* *KO!* Acosta', 'Sean A Wardman': 'Well said', 'The Saltiest Shake': 'Damn straight. Sit down and shut the fuck up Acosta you fucking traitor.', 'Ed Abreu': 'Acosta is an idiot,', 'F. W.': 'I’m Hispanic, and love this country there for I’m a nationalist; showing patriotism loyalty and devotion to a nation;', 'Karl Hungus': 'I’m with ya Donnie', 'Womp Womp': 'Wonder why the media is afraid of nationalism....', 'Slow&Low': "Acosta is trying to conflate the ideas of Nationalism and White Supremacy.  That's the mouthpiece of the liberal left.", 'Vincent Ardizzone': "Watch them JUMP all over Trump for saying he's a nationalist, comparing him to Hitler. FAKE NEWS at its finest.", 'ozzsihing': 'Jim ATosser', 'annreid1965': 'Rip that mofos nad sack off! \nJim Acosta is a pig eyed sack of bat shit, fuck head , arse scrap, jiz rag , dick. \nLove from Australia', 'Brady Berg': "Jim needs to go away. CNN shouldn't allow him to speak", 'jojothacircusmonkey1': 'Jim Acosta is to stupid to understand this.', 'SandLeopard003': 'what a great great president', 'Whyisurheadinurass ?': 'When the fuck are you ignorant liberals going to wake up??????  You’re the fucking racist .....you’re the fucking problem', 'Abstract Happy Place': 'CNN 😅', 'Norman Gregory': "CNN and the democrats are \nWorking for the devil. Satan's bitches....", 'dantedero': 'If you don’t like paying so much into NATO than put less money in it fucking hell, do you think in Europe we’ll get mad because the US slows down his military spending and chills the warmongering a little? Stop complaining and act what a clown', 'Hinatachan360': 'Trump is for ALL Americans.   Get that through your think skull,  Acosta!', 'GigOne': 'Morons like Acosta (and the rest of the "Lame Stream Media") try to spin something (and anything) into extremely derogatory BS.  The idea is to "plant a seed" and hope it grows. It\'s called, "propaganda."', 'Ralph Johns': 'Does Jim Acosta look like Scott Peterson??', 'Garett Smith': 'Acosta is a joke to journalism, he should have his White House credentialing revoked. Who can take him serious??', 'Liam O’Neil': 'So if I’m a white male I can’t be proud of my country without being considered a nazi or white supremacist haha, these people are ridiculous... it’s almost as if they’re trying to make people racist 🤔', 'the91ser': 'How are they upset that the president of a nation is a nationalist?', 'Loathe Democrats': "I love it when Acosta thinks he's attacking Trump and then, it gives Trump a chance to explain how great America is. What a moron!!!!", 'Matt Strathis': 'Acostas corpse should be in a dumpster somewhere.', 'Argentino Conservador': 'God save the Nationalists of the world!', 'erepsekahs': "Acosta is obviously scum. He must be scum because there are only 2 reasons anyone would speak as he does, stupidity or scum....and he's not stupid.", 'Cyber Farmer': 'I just wish illegal immigrants were nationalists.....\n\n\nIn their own country.', 'trf12567': 'Jim got owned. Was hoping Trump got out a dictionary and read what nationalist means. Which is:\n "patriotic feeling, principles, or efforts.\nsynonyms:\tpatriotism, patriotic sentiment, flag-waving,\n\nplural noun: nationalisms\nadvocacy of political independence for a particular country".', 'ms3er': 'Jim Acosta - AMERICA FIRST you turd!!!', 'GoogelUlube UpYoAzz': 'Jim Acockholster sucks dog dicks.', 'SonnyGTA': 'I.  Fucking.  Love.  My.  President!!!', 'easy rider': 'That is pretty low on the part of CNN.', 'Gmonkey': 'Sending coded messages????? What the fuck is Acosta on about. Trump doesnt do double speak. He is the ultimate straight shooter. Like it or not he does what he says. There is no coded messages. lol. ....................................Are you white? ...Yes.....are you a nationalist......yes. Ahhh then you are an evil white nationalist sending a code of hate through the USA. WTF.', 'Spiral Architect': 'White liberals are worse than ISIS. Can we just identify all of them and send them somewhere?', 'Andy Thurlow': 'Acosta, what a total knob end', 'moparmon': 'Trump beastmode', 'kozmosnotgay': 'Damn, is Trump becoming articulate!? What a well said, well thought out argument.', 'Lord Summerisle': 'Donald trump is a "n" word', 'Sinomis': 'Jim..Jim.. go back home to yo mama', 'MsStephenn': 'Best president in history. Saving America from libral shit bags', 'Darryle Waggoner': 'Way to go Mr. President.  Shut the news bureau  (cnn) who hate our country; down.. Great job sir!!', 'Silent Disciple': 'This was Trump “OWNING” someone? Bahahaha', 'Jaime Najera': 'Proud to be an American', 'Gvozden Zmajic': 'lacosta, everyone is nationalist, except of you brainwashed by globalists', 'Edward Sanchez': "I'm a Nationalist too. I love my country and President.  President Trump is the GREATEST President in American history. Obama is the worst President in American history. RED WAVE 2018 MAGA 2020", 'rickybobby1340': "Trump plays Acosta like a mandolin, but he's too stupid to stop falling for it, pure gold....", 'A Sam': 'I’m an immigrant and I think Acosta is a doofus.', 'Rob Happe': 'I am European and Trump is right!', 'clubdrunkify': 'Why is it that the left only hears these dog whistles?', 'Kooler M': 'Acosta Gets ......HIS TOILET FLUSHED AGAIN!', 'MrZinego1': "If I hear CNN say dog whistle again I'll break my TV", 'Chad Rushing': 'Acosta is a globalist propagandist with delusions of being a reporter.', 'Gareth Wigglesworth': "Love trump but I doubt American medical equipment is better than the europeans. People in America walk with limps because they can't afford medical treatment. Or it go's very wrong. Pioneering medical research is done in Europe. Like proton beam therapy for instance.", 'mark baughman': 'Jim Acosta is a sissy ass punk', 'Nati by Nature': 'Coded language...dog wistle...\nFunny how only Jim seems to get the "racist" message', 'Steven Dufort': 'Acosta doing what he does best , Accosting.', 'bruce baker': 'CNN=Hate Speech!', 'An Lopez': 'Take that', 'G': 'Fuck" CNN.', 'SUKØRI INTERPRETATION': "Coded language? Dog whistle? My god they really have gone to the dark side haven't they.", 'Fat Daddy': 'Go trump 2020.', 'AreYouSure AboutThat': 'PSA switch image of mind reading dog whistle', 'Howard Griffen': "Triggered Liberal Lunatics.  We should ALL be Proud of our Nation, unapologetically so.  The *Clown News Network* is at it again, spewing idiotic nonsense as usual, trying to make anything pro-American appear somehow problematic.  Meanwhile, we have 7,000 Leftist Funded Illegal Aliens marching on our Southern Boarder, threatening to further dilute our economy and become additional burdens on our Welfare System.  We can't get that Wall built fast enough.  Trump2020!", 'Peter Boulton': 'Another disgusting example of this hack spinning a simple word into a racist slur . His press pass and access to the white house should be stripped , he is spinning hate speech plain and simple', 'Michael Regdosz': 'LIKE OUR NUMBER 1 ALLY ISRAEL!', 'RB Insurance': 'The Race Card, how sad they are dusting this old accusation again.', 'Jason Khan': 'I ❤our President Trump!  He makes so much sense and he truly loves our country!  God bless you Mr. President!', 'S.T Browne': 'BRAVO, President TRUMP - as always, you RISE UP against the "BAIT."', 'Castello Chong': 'Send this asshole Jim ass, out from Washington DC. CNN fake news closed down soon.', 'Mad Trapper': 'Trump 2020!', 'The Deerfield Diaries': 'Nationalism is rationalism', 'Marcos Lepe': 'Jim Acosta is a joke!', 'Commander Starstrider': 'Jim acosta is a pile of shit.', 'Heidi Kleindienst': 'It is perhaps accidentally smart to say "I am a Nationalist" and dig right into Germany of all places 😂', 'Ian Meadows': 'CNN really needs to read the definition of a nationalist. I am a proud nationalist and I stand with President Trump', 'Jack Carter': 'Jim is a full blown retard', 'Stormy': 'Acosta is a race baiter and a disgrace to journalism', 'CloverPickingHarp': 'Steam rolled by the Trump 🚂 per usual', 'malo man': 'Color me Nationalist \nMost people who had an opportunity to travel the world and see the other side are as well.'}{'Sosene Leau': "true to form, CNN speaks in coded language, It is good to hear someone mean what they say and say what they mean. not coded with other people's meaning, but, now CNN reveal their language, they never mean what they say,, they speak in codes.MAGA", 'Valerie Marie': 'I’m a nationalist as well. 👍🏻', 'Kevin Williams': "Acosta \nYou're a little bitch. Anyone in this country that doesn't want the best for America is a traitor. Oh hell I just gave the definition of you and all fake news networks and deceitful liberal Democrats. If they weren't as corrupt as they are and so deceitful to the American people, all would support his accomplishments. Go put on your big boy panties and quit trying to put words in president trump's  mouth because he's not what you and all liberal idiots portray him to be. You and CNN really suck.", 'Miles C. Anthony': "We don't OWN the World...but we RUN the World. The entire...ungrateful...PLANET.", 'terry bridges': 'Acosta you dick head', 'Lajoy Howard': 'Acosta  your a dog ! Please get in front on my car\n so I can run your low life GUTTER TRASH ass over !', 'Tom Neu': 'Jim Acosta .. is this REALLY the best they can do for professional reporting? CNN SUCKS', 'robert4you': 'Greetings from Sweden. Trump is so right. Economic nationalism is the antidote to the dangerous globalism. What Trump says here is just common sense and 100% true.', 'Pedro Monge': 'Acosta talking about encoded message ? That dude is an asshat !', 'Lees706': 'Acosta is such an A Hole . President Trump really needs to not let CNN into the White House. They are so Bias and hateful towards our President it’s sickening they get away with it.', 'Paul Brendan': 'Jim is one of the most useless human beings on the face of the earth.\nHe really made that one easy for trump  though.', 'Dean Smith': 'U shud pay more for nato its us foreifn policy tool', 'Phi Tech': "I'm a nationalist and I don't watch FAKE NEWS NETWORK CNN", 'crystal pretorius': 'This Jim Acosta guy is a real twat.... Being a nationalist is being proud of your country, wanting the best for its citizens and protecting them from invasions... Jim Acosta is an agent for Soros', 'Pheo Smith': 'Go Trump 2020', 'Robert Shepherd': 'Jim Acosta is a cocksucker.', 'Margad-Erdene Amgalanbaatar': 'Every time Jim Acosta shows his stupidity he helps Trump.', 'Zion Curaçao': 'Well...', 'Larue77': 'Trump voters supported him because of his false smears about immigrants. Mexicans are rapists. Build the wall.  An area’s vote for Trump was accurately predicted by the average score on a measure of “racial resentment.” Nothing else mattered really. It’s obvious Trump is a racist or a bigot if you don’t think Mexican is a race related description.', 'Eddie Berry': 'CNN LITTLE JIMMY IS A FAKE REPORTER,,DICK HEAD LIER ,,THIEF ,,CORRUPTION, ,DECEIVER,,MISLEADER,,TREASON', 'Sarrah Kitty': 'I am a Singaporean Nationalist and I love Trump!', 'jamesbulldogmiller': "Acosta needs a job in the circus. He's a natural clown.", 'ABC ABC': 'Acosta is a piece of work. He’s a pathetic little man.', 'MrGreggles': 'What an awesome reply. Kudos to your Don, from NZ.', 'Stigmata Speaking': "The truth hurts ! Get'm Trump !", 'Mano Osb': 'For the liberal media and other democrats nothing is good about President Trump despite all his achievements for Americans including the liberals.   Tha k God, President Trump is courageous and fighter -truly a leader!', 'J S': 'I am a nationalist!', 'Break The Chains': 'Eat a dick and choke to death on it, leftest pieces of shit. The left spews anti-white racism 24/7 and screams racist at white people.', 'Orange Man Bad': 'na·tion·al·ist\n/ˈnaSH(ə)nələst/\nnoun\na person who advocates political independence for a country.', 'Defender2516': 'Anything good, holy, virtious, CNN hates, because CNN is wicked.', 'gesheed': 'I’m from Dubai, and I honestly see nothing wrong with what President Trump said. Much respect and admiration to a man that’s actually doing something to his country', 'Ant C': 'Tell it!!! Love his care for America!!!', 'Jordan Kahele': 'Hey, at least Trump  is a cool and clever guy, even if he already knows what l mean by saying the word clever.', 'Themba Sapam': 'Hey Jim! Remember twitter message? Fu@k you!', 'Henry Savoy': 'trump is American gangster', 'William Perry': 'Definition of nationalism says nothing about racism, dumb Acosta.', 'Michael P': '"I\'m a nationalist." Oh, so you admit that you\'re a racist! Fuck CNN.', 'kirk morton': 'The only thing missing in that answer was the mic drop@ the end!', 'ahmad al-khateeb': 'What the hell?? Nationalist is from Nationality. At the borders, customs ask you what is your nationality not what is your patriotism. So,  the Nationalist is someone who loves his nationality. Period', 'TontoGoldstein81': 'Trump calls out GERMANY.... and according to Acosta, that makes him a "White Nationalist." ALLLLLRIGHTY then!', 'Lou Of The Everglades': 'A good answer to an unsurprisingly stupid question. Jim Acosta like many of his colleagues has a brain like suds. They take up space but are filled with air.', 'Jay Hache': 'Anyone else notice Pepe peaking in the window disguised as trees in the background?', 'Impeet for tee fy Impeet for tee fy': 'Acosta is a funny bunny. Hahaha 😏', 'Lisa Khodadoost': 'Jim Acosta is a disrespectful liberal ass.', 'Cyrus Asgari': 'You have the worst YouTube name. Are you a disease 😂😂?', 'Tony Orr': "Jim Acoster is a feebil minded turd. I too am a nationalist, I am for ALL the citizens of America.  American is founded on 3 basic tag lines; E pluribus Unum, liberty for all and our inalienable rights to pursue happiness. None of this means that one will be happy or that all will have liberties it only means that you can become what you CAN and if you're lucky it'll also be what you want. Stop thinking you're owed anything and that you're a victim. Be a patriot and have personal responsibility for your community. Take care of the weak, protect innocents and be a (mostly) good person.\n\nJim Acosting is a genital wort", 'Vorax Le Dur': "Why are Americans like Jim Acosta standing in the way of the progress President Trump is making though ? What's wrong with caring about Americans first?🤔", 'Uncle Rich': 'It’s easy to punk Jim Acosta.', 'Jack Chors': "When did being a 'nationalist' equate to being a 'white supremacist' like CNN is trying to portray it?", 'sacred steezz': 'Its no secret obomba was trying to kill nationalism. Thank god for the red wave.', 'Bret Frankman': 'He speaks to the American ppl and the media hates that.  Good thing most of America does not hate America.  They have to resort to translating his words and most people see right through it.', 'Madison One': 'Washington, Lincoln, Churchill, Gandhi, Mandela were all Nationalists. Today’s problem with journalism schools is you have to get C grade & low SAT scores to be admitted. If you do better in school & SATs you are not going to journalism school. Acosta & his ilk at CNN think a multi-racial country’s President fighting for its economic well-being becomes White Nationalism then obviously they reporting twisted garbage. If you are still watching CNN & it’s Idiot posse you are simply outta your mind.', 'Michael Woodruff': 'That was a gross question.', 'Scott Shaffner': 'This is called the Acosta Stomp, not a new dance !', 'Motor Boat': 'Jim is a bitch', 'Mark Swarbrick': 'Jim Acosta is a fuckwit', 'Room 183': 'Hey Acosta, go throw your shit in China.', 'Stanley Curry': 'I’m a Nationalist,  proud American !!!!  WWG1WGA!!!!', 'Kevin Baird': 'Get out and vote Republican next week, give this man the support he needs, a total reset of international norms is needed, this is the man to do it, he could be sitting back taking things easy but instead he took the worlds most difficult job and is making a real difference, fantastic man, fuck CNN.', 'Alwin Alwin': 'One word from my side GOD BLESS AMERICA \nAnd GOD BLESS CHRISTIANITY 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸✝️✝️✝️✝️✝️✝️✝️💕❣️❤️💜💞💝💚💙✝️✝️✝️✝️✝️✝️', 'mikegan73': "Great reply from the POTUS, but I don't think anything he said will sink into the head of Clown Jim Acosta.", 'FavreianVengeance': 'Jim Acosta is corporate un-American stooge. CNN is a disgrace. No dog whistle; just straight talk.', 'polopete10': 'Jim stupid Acosta is a stupidass unappreciative reporter that disturbs our president', 'jom_ aca': 'Acosta is Latino from Cuba\nRivera is Latino from Puerto rico', 'Dominique Hardie': "This is the most amazing country's  on the planet, one , if not the most diversified by land mass. This place is shared by all who put in work, hard work.  Jumping a fence or cutting in line makes you just an asshole. Not cool.", 'william III': 'Jimmy, find another job, you are making a fool of yourself every time.', 'Casey O': 'God bless!', 'MrLinky1111': "Why is Acosta even allowed in the White House? You don't see Jerry Springer asking questions. Why is this fake news clown allowed?", 'Johnny dogg': 'Jim,you sir are a moron,and down right idiot. Is that code,only a pure fool would snag a thing like nationalist and hang "white" on the front of it and scream racist....good God man,really!!!!out of all the really silly stuff President Trump says,and its a lot,you would  hang onto one of the great things he said,spin it,flip it into a racial slur,only CNN could do that. I\'m from the north country, iv seen my share of true racist,and folks that hate other races,and they are a small percent of the hole united States, and they act is tho that\'s Trumps base,if it was he wouldn\'t have even came out of the debates with less than 60 folks voting for him,give me a break...this country has love for its people,right and left,period.... Must be mid term elections, the left drags racist out every time,really sad when that\'s all u can run on......❤🇺🇸', 'Meat Grinder Mike': "I'M FUCKING PROUD TO BE AN AMERICAN BORN HERE!  GOD SENT ARYANS TO THIS COUNTRY TO CLEANSE IT OF THE PAGAN RELIGION FROM THE DISGUSTING REDSKINS WHO WERE DESTROYING AMERICA!  FUCK THE GLOBALISTS AND FUCK OTHER COUNTRIES!  THEY HAVE RAPED AND PILLAGED US FOR TOO LONG!", 'Jackalofdeath': 'president having to explain himself to a person that constantly attacks him on a personal level, just a shame, press like that should be barred from the trade', 'zzzx xzzz': "I'm with President Trump ! \nGod bless America and President Trump !!!!!!!", 'William Pittman': 'clearly this reporter is on the payroll for one reason the poor guy actually believes the stupidity of the media and popular opinion', 'Edward Findlay': 'No one got "Owned" again. Clickbait new wave fake News.', 'Deplorable Mike': 'I blew my dog whistle and Acosta peed on the floor. Bad doggie', "Da'kinebud187": 'Trump 1 Jim 0 ! \nBUT FUCKED again huh, Jim ! \nNO VASELINE ! Ahahahhahah MAGA 🇺🇸🔫👀😲 ! VOTE GOP NOV 6TH ! RED WAVE !', 'Joseph Klassen': 'I’m a nationalist! 🇺🇸', 'scott Vincent': 'I am a Nationalist!! God bless America!!! Down with CNN and Jim Commie Acosta!!!', 'K C': 'Acosta is SUCH a little pussy! Go untwist your panties, jimbo, and chill the fuck out!! Hopefully soon you\'ll realise what a complete dimlow you are and retire from "media" work. You are useless.', 'bigblue': 'If the USA goes down Western Europe is in for a rude shock, Merkel will welcome back her comrades with open arms.', 'karma s': 'I am also a great Nationalist', 'Greg Norman': 'Donald please keep the  pressure on tyranny China, do not let them get away easily. From HK.', 'johnlewisbrooks': 'What do Mark Dice, Sarah Palin and Donald Trump have in common?\n\nThey tell the truth FAR more often and have better RATINGS than CNN!\n\nFUCK CNN!\nXD', 'Yuri Orloff': 'Nationalism is the only rational outlook, given that humans are tribal by nature.', 'Darrel C': 'CNN always pulling the race card.', 'Texanboiii': 'President Trump is not a racist people are so stupid! If anyone can give me an example of a time Trump was racist I’ll change my mind. Good luck!', 'Rob Brumfield': 'The words Jim Acosta hates to hear the most is, "President Trump"! LOL!', 'Glenn Heiselman': "Acosta's got to quit banging his head on the wall when Donnie is riding his ass.", 'The Death of Logic': 'Fuck these left wing animals. They accuse him of talking in code?? Are these liberals really this braindead \n\nCNN deserves to be firebombed', 'World Citizen': 'A good response to a needed question', 'Rob Bennie': 'Jim Acosta is such a slimy/wormy/weasel', 'TheOwlCreek': 'COMMIE NEWS NETWORK HAS TO SPIN EVERY WORD THAT COMES OUT OF TRUMPS MOUTH \n\n*FAKE NEWS SCUMBAGS*'}{'gerry gunn': 'God damn you, Jim Acosta, you racist piece of subhuman filth.  I wish President Trump had said that.', 'Danny Tubiolo': "JIM THE GEM... He's such a puke", 'Gabriel AA': 'JIM ACOSTA = FULLY INTEGRATED DEMONIC POSSESSION.', 'Soupy P': "That's our WONDERFUL PRESIDENT!  I'm a NATIONALIST now!!!    I guess a white one too!!", 'horticasey': 'Hail Trump!', 'Bernard Jones': "Trump turns their own stupidity back on themselves.\nJim won't give up because when the mid terms come in a lot of people are going to jail   👍", 'purestskin': 'He is so smart and understands business like no other. Master negotiator,  but most of all doing everything he can for the unites states of America.', 'zmanstrong41': "Why do they continue to call on CNN reporters. Don't give them air time, or acknowledgement let them face the dusty road of irrelevant alone and ignored.", 'fuckerupper': 'Orange man good. Orange man not     racist', 'Eduardo77': 'Leftists are just plain stupid and can’t see past race because they are racists.', 'CAROLYN REGAN': 'Hes such a punk bitch. I hate CNN. Trump has never been and never will be a racist. Its a weak minded thing to say. Intellectually dishonest', 'cracker woods': 'People who truly LOVE America are all nationalist.  We want this country to do well.  Cuz if we do well the rest of the world does well.  America 1st.', 'Robert Parnock': 'Funny how CNN always tries to CREATE some negative news even when theres none just to shock viewers. Time to revoke his press pass for absurdity.', 'ken wright': 'Ty djt. I love our country always have America loves that you do too. Best pres. Ever', 'DAMASTERDR': 'Im a nationalist!', 'jack flash': 'and in summation, Go fuck yourself jimmy.', 'Derpy Derp': 'I’m a nationalist and proud. \nGod I love trump!', 'Natendo': 'Pull your lip over your head and swallow Jim.', 'Dean Winchester': 'just imagine a globalist world without borders... whole world would flood into the US and destroy its economy in a month... next the whole world would be a giant gang, militia territory', 'Andres Keller': 'That’s our smart president and he’s totally right \nGod keep giving him wisdom \nAmen', 'Bob Finnegan': 'Deport jimmy boy commie Cocksucking News Nitwit', 'D T': 'nationalist, black lives mater - kill the pigs, white nationalist, so what?', 'J St. Angelo': 'Dear President Trump. Please tell Jim Acosta that the EU is Hitler\'s wet dream and that the socialist all over the world are still embracing the pseudo science of eugenics that they invented.  See "Sick Kids" hospital in Toronto Canada and their assisted suicide program for children without the consent of their parents. She Soros funded Hemlock Society. See Planned Parenthood.  The left are NAZIs and they know that. This is why they must constantly project their identity on us conservatives who respect life, God and country.', 'high country': 'Hey little jimmy maybe you should look up Cory booker he might sing the blues with you!', 'X X': 'NATIONALISM!!! MAGA', 'Richard Sully': 'I am a nationalist.....eaahhhllllll', 'PazmanTV': "These morons at CNN seem to be confused by what a nationalist means to Trump. Trump is interested in protecting American citizens over the rest of the world. ALL American citizens. Yes even American citizens that are Black, Hispanic or Asian. Nationalist means you set economic policies that protect American jobs & industry vs a global economic policy. That's what a nationalist means. It has NOTHING to do with racism. Now White Nationalist is a racist lunatic fringe group. That is a different story.", 'Precious Gems': 'YOU TELL THEM PRESIDENT TRUMP !!!!!!!!\nWE LOVE YOU !!!!!!!!', 'Learning to Crash': "I love how he doesn't sink to their level. That POS called him a racist and he just let it go...but they always fall for his trolling, lol.", 'Hermann van Zyl': 'Trump disregard the press and does not play  the game of political correctness. My president!', 'derrick foster': 'CNN= Very very fake news!', 'Joel Marek': "Tuck Frump, He's a traitor", 'Charles Kline': 'CNN Sucks', 'Lance Weyrich': 'CNN liberal asswipes !', 'Rey Alecio': 'CNN is the enemy of America. Putin needs to do Acosta like he does fake news reporters and make the world a better place.', 'beastypie99': 'That nigga fucking dumb as shit. Since when is putting our nation first bad? Dumbass liberals', 'FanofDocumentaries': 'Trump gets more Presidential by the day. Acosta gets more lunatic.', 'HighGearLB C': 'Why let cnn in the damn house', 'Hello Hello': 'Diversity = anti white', 'Paul Is': '"Nationalism not globalism will be our credo!"', 'j c': 'This is iconic Trump!', 'Cool Hand Luke': 'I don\'t want to share my country with other countries the same way I dont want to share my house with my neighbors. Does that make me a "white housist"?', 'UltraKryptonian': 'The President of the United States SHOULD be a nationalist, Dumb Jim!!', 'Bill Murray': 'I am a Nationalist as well. Thank You President TRUMP!', 'simran singh': 'I’m proud of this man - Donald trump. He is an amazing president. I wish India had someone like him who is looking after it’s national interest. Our president is busy flying to different countries and spends no time at home. Jim Acosta this reporter I have seen his interviews before and he does nothing but attack trump. CNN should be banned from reporting and entering the White House', 'Clifford Gill': 'What is so wrong with nationalism? \nCanadian Trump Fan.', 'Danny Stranahan': 'I am an American nationalist. It has nothing to do with my skin color. It has to do with me loving my country and supporting our president. And loving the US Constitution.', 'René Casaña': 'USA should stop funding de United Nations definitely', 'Grizzleback07': 'Just don\'t say "Mob". That would offend the CNN snowflakes.', 'Qque Whatda': 'BOSS!\nBEST PRESIDENT EVER', 'hokeypokeyalso1': 'cnn is absolutely anti President Trump and America', 'Bruno Fernandez': 'Marx = 100,000,000 dead\nHitler = 6,000,000 dead (a big lie)\n94,000,000 more deaths related to communism. There is a reason why Patton said we defeated the wrong enemy.', 'Willam Munny': 'The MSM is nothing more then the propaganda wing of the leftists/ socialists/ democratic party.  Their standard lies are all republicans are racists, misogynist, homophobic,  they have nothing legitimate  to offer so they rely on lying in an attempt to divide and conquer.', 'khatack': "If I ever saw Jim Acosta in the street, I'd punch his teeth in, without a word. He's an insult to the whole western world.", 'Wide Awake': 'Let’s be nationalists and stop fighting wars for Israel.', 'Jason Speth': 'Acosta is an ass clown', 'Gerard Guitarist': "Acosta still has a job? Oh right it's CNN. The TMZ of MSM. Congratulations. Your whole career has wound up as a confrontational , provoking National Enquirer reporter.  Nice legacy.", 'paquiao manuel': 'How come the president allow this scumbag in the white house??', 'Red Faux': "I wish Trump would start calling it an Americanist. I'm voting RED in Nov 2018. I can't wait till CNN is dust. I don't know how Trump can put up with that retard Acosta. His questions are ludicrous and slanted in an evil way. CNN simply sucks.", 'MikeMarkCA': 'Race and dog whistles, liberals are one trick ponies.', 'Tensa Zangetsu': 'And this is why Libshit media and the Dems suck...the man is spitting facts, figures,  plans, processes, amd benchmarks of results for ALL....\n\nAND\n\nThey are spinning one word to CAUSE divide.\n\nNice.', 'Jurgen Ruppel': 'Why the heck is Acosta still allowed into the WH grounds!!\n\nRevoke his press pass now! Get another CNN reporter!!!', 'Steven D': 'CNN sucks!!', 'Lorin Lewis': 'How in the world is jumping Acosta allowed into these press conferences?', 'Shawn Segaar-Bratsch': 'Dear Diary....shut the fuck up Jim!', 'rogue since day one': "I must've not gotten the memo apparently if you put white in front of words it makes that word racist 🤔🤔🤔🤔🤔", 'Fdg gothic': 'He dodges the question and doesn’t explicitly state that he is not doing what he was to some extent accused of. Anyone else agree?', 'Carl 123': "Leftist media causing trouble. They're so low a dog wouldn't lick it.", 'JC C': 'CNN SPREADS HATE!!    FUCK YOU J.A.', 'Gantinx Gantinx': 'Acosta is a douche', 'getplaning': 'Trump is the real victim here.', 'Chris Jorgensen': 'Fuck Jim cry baby Acosta', 'William Stearns': "I understand the leap from Nationalist to racist because they want to equate him with Hitler who was a Nationalist. However being proud of your country and ALL it's citizens is Nationalism, Hitlees version of Nationalism was veiled Fascism.", 'redfoe77': "I have 'coded language' for Jim Acosta: you're not a very good reporter.\n\nUncoded language: you're a jackass!!", 'Kevin Pohlner': "Acosta, if you want to be a grown up, I'll advise you to never ever use the word dog whistle unless you are speaking to a K9 handler. That is an immature argument that lessens any statements that follows and you should know better.", 'silva silva': 'I AM A NATIONALIST', 'me him': 'Trump should pull this little shit by his scrawny sneck and bash his head off the table till dead!...... Bitch...', 'martyborman': 'Jim Accosta is a fucking asshole', 'Anthony 33AD': 'CNN wishes nothing but misery for our country.', 'Daniel _az': 'Don’t waste your knowledge on gay Acosta, he doesn’t care about common sense. Don’t bother, he’s a moron and doesn’t care about the working man', 'Guy Ferrante': 'Jim Acosta is a retard ..  and CNN pays him?', 'ALBO Albo': 'I AM A NATIONALIST AND WILL STAY FOREVER  GOD BLESS  AMERICA .', 'Valhalla': 'Sorry trump we dont want your gmo bullshit food in eu.', 'tom craver': 'jim acousta trying to be the news again by creating news instead of reporting on it.....jim your a dirt ball....hope I meet you face to face some day so I can tell you that to your face. your a dirt ball.', 'Skull Dwellers': 'Jim acosta meto.🖕', 'Justin Giraldez': "Jimmi Acosta is so bad, even Cuba won't take him back.", 'Gao Joosten': 'And yet, none of this was written on acosta paperwork so they can air it on CNN.....', 'Will Jeff': 'I am proud to be an American.', 'Eddy Priest': 'I hope Acosta can grab his balls and become a man some day', 'Dan Rathers': 'I am also a nationalist', 'Men On A Mission with JAMES ADAMS': 'CNN is stupid and sucks.', 'John Bernard': 'If you open a dictionary and find the word Twerp Mr. Acosta’s picture is next to it!', 'Chris Mann': 'You just got Trumped', 'Scott Lowman.': 'U.S.A. love it or leave it!', 'fatpiper88': "I wonder, when Trump explains these things to the reporters, what do they hear? does it just go in one ear and out the other? Trump has to explain every little thing he does or says to the media, and repeat it, every single day, and they still don't get it. He is one patient guy", 'Mustang .308': 'Hey ASScosta..... Go F yourself, you rascist liar...... 🖕'}{'Zyz zyz': 'Boom!  Shut the f%@k up acosta!\nEveryone should start calling themselves a nationalist just to flip this crap back at them.', 'Frank Da Iel': 'Acosta is a frigging brain dead beta cuck moron', 'Dennis': 'The hateUSA fascist leftard CNNs of the world are projecting their racism and anti-semitism.  They’re the ones that vote for their pos traitor fascist politicians who run ghettos and supported that cut-rate Hitler anti-Semite Obummer', 'Cuck Commander': 'I love Trump, but you guys over exaggerate tf you of your titles to the point it’s cringey...', 'Tino Gisondi': 'Look at how irritated the Donald gets when Jim Acosta opens his stinking beak. *WHAT ARE YOU SMOKING DOCTOR JIM. EARTH TO JIM. WHAT... DID... YOU... SMOKE JIM?*', 'Me You': "God, family, country, why? Because I was undeservingly blessed to be born here, therefore I bare responsibility, in gratitude to be blessed, to do my upmost to take care of and stand for my birthplace, and if needs be fight for her, for my family's sake. \nI'm a nationalist.  Figure it out libtards.", 'Liam Francomb': 'Jim Acosta is a wanker\n\nWhy is he allowed to speak to the President', 'van wray': 'Nationalists believe in big centralized government, and that would be Jim Acosta, not Trump. The president is patriotic.', 'Tom Kelly': 'any bets acosta never had one WW2 era history book assigned,or read on his own time?\n leftist ignorance on display', 'Manuel G Chapa Jr': 'I AM A NATIONALIST!!!\n100% AMERICAN!!!\nI AM VOTING RED!!!', 'ricky rhodes': 'Has an President ever just got up and just punched a reporter in the freackin face? If not why? acosta is an used asswipe plain an simple', 'Roman Z Garza': 'Acosta is a puppet for soros and the elite, we Americans that put Trump in office realize at this juncture that CNN and or main stream media are well funded by these ass holes Soros, Rothschids, and the rest of those swamp turds to broadcast their perpetual BS and it is quite irrelevant to them that their ratings are sinking into oblivion, to all democratic swamp rats and snakes on the day of the mid term elections you will know then that it is the American people that run this country once again, MAGA', 'spunkmeyer k': 'Acosta is such a shit head he is 100 percent UN AMERICAN!', 'Brandon Mcquiddy': "He doesn't hear a word he's saying nor does he understand it!! All he hears is I hate Trump I hate Trump!  !!! These liberals have a serious mental disorder called Trump derangement syndrome", 'c s': 'lets break the word down nation alist! pro USA not hard to understand. opposite of a global alist. pro nwo/slavery. Why do you think human trafficking has increased ever since the U.N. took an interest in it.', 'Bumps in the night': 'I’m a Trump nationalist .', 'WSario': 'I am a Nationalist.... Does that make me a Hispanic/ American Nationalist? These guys that have the best president they have ever seen in their life times in front of them and they ask the stupidest stuff. That is as bad as asking Sara why doesn\'t\' she do as many pressers any more- while the president answers questions almost every day for the last three months. I absolutely love his Q&A time getting on and off the planes and his signing meeting. We never saw Obama or Bush. People are missing the mountains for the trees- and it all about the "Hate" too bad.', 'DaVillen': "Jim Acosta is like that cocksucking smuck everyone in 10th grade just hates to deal with, but let's give President Trump credit for an amazing response.", 'MR WHITE': "So it's ok to be a Communist Jim? Seriously Jimmy boy SHUT THE FUCK UP!!", 'Mystery Northwest': 'I am white sooOO what! AND I am a nationalist and very proud to be both.', 'Porsche997TT': 'Acosta is a,race bating Piece of human feces. Why the hell dont the white,hiuse,strip him of his press credentials.', 'Sox Mate': 'Costs is a FW first class.', 'Rising Tide': 'Mr. President you are 100%. One nation  one family one people with Liberty and Justice for all. Great response to a very baited question.', 'Maxwell Smart': 'Doesn’t the weather channel have more viewers then CNN?', 'William Linington': 'Jim Acosta is race baiter.  CNN is disgusting.', 'American Axe & Tool Co': 'Acosta is an asshole who needs his ass kicked!', 'HardRockMiner': 'Anybody that reads anything bad into what was said here is so far into delusion that they are without hope. \nMy name is Ken, AND I AM A NATIONALIST!!', 'Led Zeppelin': 'He shouldn’t even let Clinton news network near.God bless you Mr.President❤️🇺🇸', 'Qrisqornellfan': 'I once witnessed a pinto bean own Jim Acosta..... And then Jim cried and a pudding pop cheered him up. Cnn, news for people who cannot think for themselves.', 'Robert Montoya': 'Coded language?! Acosta is such a bullshit artist', 'Englandsbestlover': 'I would be surprised if it was Jim Acosta who sent the bombs', 'vivid John blaze': 'Earth is flat and stationary', 'steel talon': 'Acosta has a really effective way of putting his foot in his mouth.  He should be an intelligent and well researched journalist that can represent with professionalism for CNN, but he comes off constantly like a freshman english major with an attitude.   It makes you wonder how many viewers CNN has lost by this guy alone.', 'moose55105': 'he just fully fucking put words in his mouth what the fuck', 'PlasmaBurns': 'Most countries dont want our food. Its all GMO tainted garbage. Some nations have even banned GMO foods.', 'Truthhandler 1': 'Israel often puts plaques with the names of Nazi jew hating white supremacists on their embassies. TDS!', 'jinqui zhang': "Didn't this guy already got his White House pass revoked?", "C'Laudel Vlz": '👺Get over here¡!⛓ Finish him¡!\nToooomaaaaa ¡!¡!🤜☠', 'Kamikaze Yamamoto': 'Will somebody PLEASE bitch slap dat bitch Acosta.\nThanks!', 'Bill': 'The fact that Jim Acosta is still in the room proves that Trump isn’t going to let the media get away with the old bag of tricks.  Ask a question, he answers.', 'Gary Tarr': 'Well said Jim . You are a hero and the only one journalist who is not afraid to call out  this vile lying POS POTUS !!!', 'TheAes86': 'Aw, they left out the best part where Jim wanted to and started to ask a follow up question and the President went to another reporter. And I think JIm kept bugging him saying he could go to another reporter but he wanted to have a second question answered first. President let him know there was a room full of reporters , not just him. He actually did it firmly but more politely than I thought he would for Acosta especially.', 'Leonardo Favio': "Acosta, you're a fucking pendejo.", 'Dave Crockett': 'A nationalist: a person who believes that their nation should be the number one consideration in all things international. Hmm......I AM A FUCKING NATIONALIST. It has nothing to do with being a racist.', 'ray konga': 'Acosta is a communist and we are nationalists.', 'Sal Paradise': 'Good Christ! They called him a White Nationalist. Whatever the hell that means... racist? Such a tiresome gripe now.', 'Priceofwar': 'Why protect Europe? They let in muslim savages to live unemployed on welfare!', 'Gw Mcklintock': 'Leave it to those assholes to try to turn it into a racial thing...', 'The Man 316': 'At 0:10 it was like waving a red flag in front of a bull lol. Trump get him!!', 'Burton Matterhorn': 'Trump will be great at reducing our influence in the world', 'Harry Canary': 'Acosta is a punk that should have been tossed out on his ass long ago.', "rollin' stoned": 'anytime Jim...anytime! debate or fight your call junior! you need to be taken to school, one way or another!', 'bigblocks rock396': "If being a Nationalist is wrong, then I don't wanna be right.", 'Iowarail': 'Suck a bag of dicks Jim.', 'Pirate Labs': 'Once again, Jim "Fake News" Acosta gets schooled by President Trump.  When will this guy learn that he just does not have the intelligence or the skills to take Trump down?  The only dog whistle is the one Acosta uses to call his girlfriend.', 'Mike T': "The sad thing about it Jim Acosta didn't learn nothing there", 'jgvtxman': 'Acosta is an embarrassment to normal human beings.', 'miyosu sugihara': 'Acosta is neither a nationalist, communist nor socialist. He is an ass.', 'nothing finer than a dyna': "I'm from Australia and Trump is 100% CORRECT,,,YOU HAVE TO LOOK AFTER YOU COUNTRY FIRST,,,,then if your country is doing well, then and only then it can help struggling countries........", 'MICHAEL APPLE': 'Acosta asks a predictable NPC question with a "dog whistle" commie narrative; "Orange Man is literally Hitler".', 'crayhead': 'I love when Trump shits on these lightweights..', 'Bill Thompson': 'Acosta is a skin color racist.', 'Netchanok Lankford': 'God Bless President Trump!!! ❤️🇱🇷❤️🇱🇷❤️🇱🇷❤️', 'Lucy 3': 'Go figure... US pays for eu. eu hates USA. Its called BEING FAIR! Love it.', 'Sjoerd Wiggemansen': 'Tell this Havana communist to be a journalist instead of spreading his tainted opinions at the stage of the World with his Pres pass as cover to be able that propaganda. So why he still has an accreditation?', 'MREMMETTIII': 'I am stunned that he actually keeps calling on this BOZO!!!', 'Donald Scearce': 'I wish Jim would walk in front of a bus!!!', 'Petter': 'Great!!', '9erfanatic1': 'Samoan nationalist for America right here', 'TJ Graces': '❤️ Trump! Can you understand that Ascota or do you need us to explain it to you!', 'COD Drastic': 'Man wants to defend the country and y’all ridicule him. Smh', 'x x': 'I am a nationalist!', 'zootedsuit': 'Race baiting Acosta was silenced by logic and reason.', 'Burn .D. Day': 'The way that trump talks about his country... I am not even American and I feel proud of him.', 'Doom Slayer': 'Space race is a nationalist thing. Who can’t figure what this word simply means.', 'STOTS': 'This stupid question is typical of annoying leftists. \nExpanding definitions of words in their imagination.', 'mmcg2007': 'acosta represents the lowest in our society', 'A poeng': 'Hey CNN Jimmy boy !\nMr President Trump has higher approval RATING then CNN.', 'Mark Anderson': "Thank you President for being so transparent we understand exactly what you're saying. The fake news just can't get over the fact that you exposed them for the frauds they are and just completely own them everyday. Trump 2020 Maga", 'Scott Somkhit': 'Wow he explains it here but the lame stream media spun this calling him racist lmao', 'Gregory McGonagle': 'Mr. President...Jim Ass-osta didn\'t understand a word you just said, but we did. Thank you and the "Trump Team" for saving America from people like him.', 'Stunnershades _': 'Jim doesn’t know what nationalism is I suppose.', 'machia0705': 'If it were a Democrat using the term , all would be fine . This is getting old . I’m an AMERICAN nationalist ! 🇺🇸And I’m proud of our President standing up to this Leftist screwball and standing up for the United States !', 'Lincoln Hawk': 'Acosta should be kicked out of this country', 'will smith': "People that think that because nationalist is part of the acronym NAZI that it's bad.   Nationalist basically means you're proud of your country.    I saw someone flying a Mexican flag outside their home.   Nothing wrong with that.   They are proud to be from Mexico.  They are nationalist.   It's the socialist part of the National Socialist German Workers Party that you have to worry about.", 'sir robert': 'Cnn fake news spun this crap all day', 'Durga Bhawanee': "People who are pushing their globalist ideals always go on their rantings about racism. It has nothing to do with hating other races, but being proud of one's racial, religious/cultural heritage. Loving your country and doing what is in the best interest of your country cannot be racist. We all have a heritage to preserve. As a Hindu, I want to see my religious and cultural traditions protected, and not destroyed by other religious groups. I want others to respect how I worship and uphold traditions and ceremonies, and not criticize or belittle me. In a similar manner, Americans should be able to celebrate their religious and cultural traditions, and not be condemned for it. They have a right to honor their flag and national anthem, just like I have a right to love and honor my flag and national anthem. As a US citizen, I celebrate American holidays, honor the US flag, pledge of allegiance, and national anthem. No one should feel ashamed of his/her race, religion, or culture. We should love our country (of birth, and adopted country), without being labeled as racist. The President has a right to say he is a nationalist. His love for his country is obvious from all that he has done. Jim Acosta thinks he can trip up the President into saying something that the left can use against him for political gain. From the President's response, I don't think Acosta would be asking his dumb question again.", 'The Fixer': 'Can we kick Abilio Acosta out of the Hispanic race. He’s such a wuss.', 'Pale Pants': 'I think Trump said the nationalist comment to trigger the left.', 'briellespop': 'Jim Acosta is Assholeinist!', 'Rebel Rabble Rouser': 'Trump is a BOSS HOGG OUTLAW!', 'Jim Marcinko': 'I want to change my first name', 'george varughese': 'Acosta is an idiot.', 'Mike Hunt': 'HUGE EMBARRASSMENT ....HUGE !! go shit in your diaper DRUMP BABY 👶', 'hooftrimmerphil': 'You go Mr President. 👍', 'Rumple Foreskin': 'Mr President kick his ass OUT!!!!'}{'Good ol’ Jack Burton': 'SMDH!', 'Mike Hunt': 'DRUMPS the most RACIST creature in this country 😂🤣🤣..old orange depends diaper wearing PSYCHOPATH', 'EclecticFortune2': 'Rather than reporting news, much of the looney-tunes media, fabricate stories by loading statements with ridiculous accusations.', 'Mad Taff': 'Jim Acosta is a race baiting moron', 'Smokey Doke': 'Its OKAY to be white....and a nationalist! MAGA 2018-2020!', 'john chan': 'Douche Acosta is just looking for that one sound byte', 'Dexter': "Acosta is one of CNNs biggest douchebags and they have plenty. So definition of a Nationalist is\xa0loyalty and devotion to a nation; especially : a sense of national consciousness (see consciousness 1c) exalting one nation above all others and placing primary emphasis on promotion of its culture and interests as opposed to those of other nations or supranational groups. So how is that wrong. It is because CNNs Jim Acosta and others like him say it is...too bad we don't care what they say.", 'Mr T': 'Acosta is the sleaziest Dbag', 'wrexx': 'CNN spinning their usual bullshit recipe: a good thing Trump stands for with a dash of fake racism.', 'Mystic Mac': 'Trump explains to these so called reporters how much he loves our country more in 1 day then Obama did in 8.....years!!🇺🇸', 'Ed Brown': 'He’s a reporter and he doesn’t know the standard definition of a nationalist. What a fn douche as well as all the idiots who have accused the president of being a racist.', 'Aaron Tanason': "Who's hands are those in the background? They look like they belong to a werewolf.", 'Patriot Patriot': "You are a spot on Mr. President I'm a nationalist too. I am a anti race baiting Jim Acosta though!!!!!!!!!!!", 'difranchise': "Trump is CNNs, and all liberal media's worst nightmare. He grabs pussy, tells broads to shut up, and still he is untouchable.", 'Public Domain': 'Everything is about race with Jim Crow Acosta', 'liam mt': 'I am amazed That Jim Acosta is allowed into the White House ,He is so disrespectful.', 'Lucy Heartfilia': 'CNN and Acosta suck', 'Mean Green R/T 392': 'I’am a proud Nationalist! 🇺🇸', 'dee76': 'Jim Acosta is a racist!', 'Fakhri Aunurrahim': "CNN, Go back to your master's plantation. That's where you belong.", 'Wood Cutter': 'Damn straight!', 'James L': 'Certified\nNegligence\nNews', 'B. Glynn': 'bring Acosta before the firing squad.', 'Fistful Pennies': 'JIM ACOSTA IS A SACK OF SHIT', 'Eazy B': 'At this point you have to entertain the idea Acosta is a plant paid directly by the Trump party, to make Trump look good. There is no way a human being can be this stupid.', 'CJ -NYC': 'Nationalism 2020. KAG 🇺🇸🇺🇸🇺🇸', 'Ivan Castillo': 'I AM A AMERICAN MEXICAN NATIONALIST', 'Peter Michalski': 'I am a NATIONALIST and have been since I was a kid and have never been ashamed of it.', 'V': "I'm a Hispanic Nationalist USA!!!!!!BUILD THE WALL!!!!!!USA!!!!!BUILD THE WALL!!!!!! LOL", 'johnny trump': 'Acosta can get a manufacturing job now!', 'Timothy Lee': 'Washington, Madison, Lincoln, Teddy R., FDR, Truman(used nukes as a Nationalist), JFK and Reagan. All Nationalists! If you are not all in for America? Then you are a sad excuse for an American. America stands for individual freedom, liberty to travel and pursue happiness without harassment by government. Last, the rule of law and God( big G) given rights. If you believe in those thing you are an American Nationalist. Even if your not an American citizen. If you are a citizen and you don’t believe in these American ways of life? You are either a moron, or you want to rule and control other people. That makes you a Sociopath at best. Pure evil at worst.', 'D.A. Risse': 'I enjoy when the President bitch slaps Leftist fools !', 'Charisma': 'Acosta lost again.  Trump 95, Acosta 0.', 'aggieeagle52': 'I am a nationalist', 'Penroy Moonbeam': 'When he says nationalist,  he means every American.  CNN are the ones that keep bringing race into everything.', 'jlr022159': 'Jim Acosta is an anti-American propaganda spreading criminally complicit piece of shit... somewhere there’s a treason rope with his name on it.', 'Anthony Bryen': 'Leave it to the Leftist media to take his words out of context.', 'RMorr50912': 'Acosta is such I sniveling dolt. 🤦‍♂️ He will ask the most idiotic, loaded questions with a straight face, like we should take him seriously!! What really scares me though are the idiots who buy his batshit premises and can vote.', 'nova siborutorop': "Yes I'm a NATIONALIST!!\n🇺🇸🇺🇸🇺🇸\nImmigrant4trump", 'Monroe Kunz': "Acosta is no news reporter or journalist he is just a puppet Democrat groupie  Trump shouldn't even acknowledge him", 'Ray Lyman': '"Hidden meanings," "dog whistle." This is the left\'s problem of many...they constantly have to find racism where it doesn\'t exist!', 'Western V': 'I hate Jim I hope cnn goes bankrupt can’t see why anyone would watch that network', 'Tim Furlong': 'Go away CNN!  You suck!', 'Robert Hudson': "Trump didn't understand the question. He doesn't know what the word means.", 'Didier Depardieur': 'Trump has to have infinite patience to put up with Acosta.  I would have body slammed him long ago.', 'Gregory D': 'Jim is a vagina', 'mikeysix3': 'Acosta drank the cool aid long ago hes a lost case.', 'Robert Suhrer': 'Great reply!   He is a Nationalist Capitalist.  Hitler was a Nationalist Socialist more like the libs want who want a World Socialist Empire...', 'John Doe': 'Why is this prick still getting in the whitehouse.. That wanker and cnn should be shot on sight within the whitehouse perimeter', 'Tim Henry': "I'm a nationalist capitalist.\n\nAcosta is a maggot", 'Racer X': 'I am a Nationalist!!!!! and Acosta is a weak pansy CUCK!', 'yukonjeffimagery': 'Put Jim in his place ..lol', 'Wisco Kidd': 'Jim Acosta called out Nazi Trump and his nasty racist xenophobic Nazi flag waving support base who are mailing bomz to people, Spanky Bone Spurs called democracy mob rule a constitutional republics authority is derived from voting and the will of the majority, you girly man beotch dudes and your mail bomz are not the majority, get a clue.', 'dunamis': 'Jim Accosted has to play MICKEY THE DOPE cause his viewers have the IQ OF LINT!', 'wolfgang mayer': 'If anyone is not proud of America all you have to do is look at the left they are a Anti American Terrorists Organization and need to be Eliminated.', 'Ben Miller': "I'm also a nationalist.", 'chemiah': "It's almost as if Acosta believes that he is an autonomous person instead of an NPC.", 'edwin T': 'Trump tells it like it is', 'Loving Future': 'I am a Nationalist. Accusation Acusta’s questions are the most ignorant I’ve ever heard, how on earth did he get a journalist position', 'Jeff Franklin': "So am I I'm a nationalist!!!!!!! Lmao", 'Bubba Bubblegut': 'CNN the NPC news network', 'George Marksity': 'I am racist', 'Mark J.': 'Trump has totally destroyed fake news cnn', 'carol paventi': "President Trump should throw out John Acosta. Same with press secretary Sarah Sanders. Why they put up with him and a few of the others in the pressroom I have absolutely no idea. But wouldn't have been nice to see President Trump or Sarah's hands and say get up and get out you will not ask another question of me ever. And their job.", 'yoko yu': 'Malcolm X also called himself a nationalist.', 'JBelle 713': 'Coded language.....😂😂😂😂', 'Stone S': 'How is Jim Acosta even allowed to be there.', 'CY Riceball': 'I am a nationalist also and have been for 40+ years and I am white.\xa0 So\xa0burn in\xa0hell Jim Acosta.\xa0\xa0End Globalism, No NWO.', 'gbwi666': 'Wish some illegal would acusta his ass !', 'gere jigme': 'what  fake media  left supports he is dishonest   very disgusting person  so shameful  man', 'ScentlessApprentice7': 'Where exactly are these "concerns" coming from??? Oh that\'s right, they\'re coming from nowhere other than the Never-Trump Fake News media swamps like CNN. Acosta needs to get smacked.', 'Ant Dawg': 'Jimbo acosta is a fkn pos', 'Shaun T Pearson': 'Donald J Trump is the greatest president the United States of America has ever seen since the founding fathers. WWG1WGA', 'john montoya': "Nationalism=identifacation with one's own nation and support for it's interest especially to the exclusion or detriment of other nations. Hell yeah. I'm a third generation of mexican descent and brown skin and agree with that definition. I support America and the constitution. What now!", 'SouthVA 757': "When is that gay Lib going to step up and tell us about Ocasta's skeletons.", 'Antulio Landeros': 'Man,  I love my Prsident!', 'Al Depantchu': 'After 2 years, Trump has improved dramatically on his ability to articulate his point with less wordiness. So proud of King Trump. Long live the King.', 'Ching Ching': 'JIM ACOSTA SUCKS! JIM ACOSTA SUCKS! JIM ACOSTA SUCKS! JIM ACOSTA SUCKS!', '- Morales': "Jim Acosta is a racist against Chicano's, his loyalty lay with his globalist masters and the white Klu Klux Klan slave owning Democrats.\n\nThere are 55-million legal Chicano's in the U.S. who need good jobs and trump is delivering. What the fuck are you doing Acosta? Nothing but being a little bitch.", 'chris beery': 'Every time Acosta opens his mouth his brains fall out.', 'Scott Rivett': 'OMG as insane as we believe they are they fully believe in the idea that we are trying to start Nazi Germany all over again. Which is insane', 'ihavenoidea371': 'Every day trump sounds more professional in my opinion. I have a feeling more and more Americans are beginning to open their eyes and see trump might not be the monster the media created.', 'Kevin Oglesby': 'Jim Acosta is a pile of 💩!', 'Stu44555': 'Eat a bullet Jim.', 'Julian Cogswell': 'CNN REPORTER: You said you like golf. Golf is traditionally a white sport. With one Token Black Man. That comment could be construed as racist, were you dog whistling?', 'Vincent Roppo': 'That is patriotism! Trump 2020', 'cbnx82703': 'Jim your an ignorant pos political hack and you just your ass handed to you !', 'G Frank Thomas': 'What questions did they ask oboma?  Did you see the game Mr prez?', 'Scott /': 'Jim you truly are an idiot.', 'Sizzle Wrap': 'Send Jim to China to cover Ping Pong 🏓 tournaments. That’s more his speed.', 'The Bridgeburner': "Never forget that CNN is the 'news organization' that printed an article saying that being a cuck is a good idea. Seriously,keep that shit in perspective anytime a CNN soy boy says ANYTHING", 'Child of the Creator God': 'I think JA makes up his own terms or names. I do not believe that he heard anyone say that.', 'M S': 'Nationalist, as in NOT Globalist. (Economically) no reason to bring skin hue into this.', 'opugilist': 'President Trump is white? What?!? Is that okay?', 'Larry Lane': 'CNN sucks', 'nathan koroush': 'Jim, go clean a loaded BB gun.', 'R. A.': 'Acosta is a constant tag line butt bag', 'Henry Wayne': 'Mr. Trump sends coded messages to Jim in his sleep, "Jim you are an ass\'\'..."Jim you are an ass".', 'Mark robinson': 'I love my country too trump!!! nothing wrong with that'}{'NothingToPointOut24': 'Im thankful for YouTube channels like this that post Trump\'s entire response to that whackjob\'s asinine question. Because you know liberal media would\'ve never played that entire 2 plus minutes. They would\'ve edited it down as best they could to make Trump seem "scary" and "evil" to the left.\n\nTRUMP 2020', 'sean roche': 'Fuck Maxine wtrrs5', 'Marisel Mart': 'Acosta is a scumbag and a piece of 💩.', 'B K': 'Thank you President Trump!', '怪我ドル Z O M B O I D': '>"owns" lol', 'Darla Webb': 'Mr President Trump and his cabinet 2020', 'harbar3000': 'I am sick of all of this winning.', 'D Asci': 'How big of a bonus does CNN give Jim to make himself look like an idiot. History will remember Jim as a fool', 'Sarah Dillman': 'And they have nothing left but "fake bombs" because the left has nothing left!!', "Braz Nart'n": 'Acosta = 1 big zero.', 'Jess Connelly': 'Jim open mouth inserts foot once again what a jerk off🐸🐸🐸🐸🤡', 'Francis Ghan': 'TRUMP IS AMERICAN FIRST AND FOREMOST!!!!!!!! YES, A TRUE NATIONALIST!!!!!', '- nobody': "He's a good man. He's a good American man.", 'mark o': 'Jim is a dumbass plain and simple get with American or get the fu,,,,,,, out.', 'Flame': 'Im so proud of our president', 'Enter 1': "We are finished paying for everybody's everything......If we stopped all these foreign aid payments and focused them into each states poor neighborhood's  all of US would live in luxury and our kids would have the best schools.  But that makes too much sense. Where we go 1 we go all", 'Peggy Vick': 'CNN, THE MOST HATED "NEWS"!', 'Lawakua Lawler': 'Call me a Deplorable Dreg of Society Nationalist!', 'Ricardo Martinez': 'Jim we are nationalist. What do you think you are? let me see if you can answer that question?', 'Charles Thomas': 'It does boggle the mind that CNN won’t reassign Acosta to another area. He is simply not effective other than to give the dems a little therapy who are stilling crying over the last Presidential election. If only CNN would have used their place in society to hold the previous administration accountable for at least a few of their more notorious actions, it might not come across as so lopsided, but they didn’t. Now they want us to believe after eight years of Obama that they are real reporters? No one is buying what they are peddling.', 'Dave Bickers': 'Jim your a fucking melvine', 'tntkop': 'Trump should have asked Jim Acosta is HE thinks it’s fair for America to pay more than every other country for NATO and for arming and protecting Europe, and then have those same countries over-tax Americans. \nAnd then when Jim Acosta says: “Well, of course not Mr. President”, Trump should say, “Well why don’t you report THAT Jim?”  \nThen again, Jim Acosta is from CNN, and we all know how much they both hate Trump, America be damned.', 'Tammy Barnes': 'There are no stupid questions?  You sure about that cnn', 'lucy bond': 'Jim Acosta is so low rent. A truth twisting dishonest creep.', 'Mary LG': 'WHAT A TOTAL JERK!!   CAN SOMEONE SERVE HIM A HUMBLE PIE ON THE FACE!!', 'KidDerby': 'If Acosta treated Hillary the same way he treat Trump he would get disappeared and I would have to buy a ticket to stand in line to dig the hole.  THAT is what I think of dumb dumb', 'Charles Greathouse': 'Clinton news network', 'John Allen': 'I wish CNN for only once would be fair and report the news', 'Free Thought': 'Commie News Network, never fail to be anti american', 'osocat': 'Coded language.....what a moron!!!! I cant believe cnn hasn’t pulled their shit together by now. The more they get exposed the worse they act. It’s amazing.', 'tikocal': 'Trump is a racist', 'Kenny Billot': 'Jim is so damn dumb!', '123gwf': "All they have left is name-calling.\xa0 The Left is so insane right now that ANY chance to call names (e.g. racist or sexist) and that's what they do.", 'thelionman2008': 'JIM ACOSTA IS ANOTHER BIG TRAITOR TO OUR UNITED STATES. I AM SO SICK OF HIM BASHING MY PRESIDENT.', 'SouthM1G': 'Acosta should not be allowed any where near President Trump.', 'Bookie': 'I love White Nationalists...', 'Brent Edwards': 'Brilliant answer... Factual, to the point.', 'johnnylogan22': 'Jim Acosta you’re such an asshole with the stupid questions that you ask and you should be thankful to God that Donald Trump has the patience of Job to deal with your ass and you’re lucky he likes you enough to keep you in the press pool you fucking ingrate', '27GTD': 'Acosta a retard.', 'Mike D': 'I’m white , I’m a nationalist, I love my country .. if liberals have a problem with that they can go fuck themselves !', 'Bob Touson': 'Retarded liberals at it again, Deport liberals Please 🇺🇸', 'Donald Powers': "wrong wrong about Jimmy he's just fishing for food for the HATERS don't want to loose the TROLLS", 'Tom Ray': 'Jim "Gotcha" Acosta keeps missing the mark.', 'E J': "Acosta gets schooled again by our President who loves our country far more than previous globalist and capitalists politicians! God Bless President Trump! He isn't perfect, but he puts his country first.", 'Michael Blose': 'Jim ur a fucking moron.', 'A Doozer': "acosta is such a pussy. Hahahaha He'll kill himself because of his depression.", 'Brock Ruane': 'Acosta needs knocked out.', 'Albo Gonzales': 'Why does he paint his face orange he looks like a damn idiot,', 'Bee Kay': 'More CNN garbage. Nationalist = Love of Country', 'Freddy McLand': 'Acosta is there for our amusement. What a joke!', 'Mike Roberts': 'Jim Acosta is a POS and works for a POS channel. Trump owned that little bitch.', 'IrishNoodles': "I don't trust anyone who isn't a nationalist tbh.", 'Luann Richardson': 'The President broke it down so they can’t spin it into a race issue. I hope one day one of these reporters gets it and changes their mind.', 'henning andre huseby': 'Think Acosta must be higly retarded', 'siargaosdn': 'Now Jim boy is listening to whistles sounding in his head!', 'matt Harvey': 'Poor Jim he sat up with his crayons all night to come up with that zinger.', 'Rush Limbaugh Fan': '*VOTE REPUBLICAN*', 'Jim Scofield': 'What a stupid Jackwagon!!! Get the hell out of town!!!!!!!', 'stevenzw1': 'Anyone have a pic of acostas wife I may have to fuck her', 'Black Shark knight': 'He should have just asked? People are accusing you of being American! 😂', 'D Man': '👍🇺🇸👍im a Nationalist!', 'P Wilki': 'Acosta goes down again', 'tim S': 'How did he own him. Get a life loser.', 'Barry Haley': 'Great job fix the problem!!! Make AMERICA GREAT AGAIN!!!!', 'Mark Ramkhelawan': "You asshole acostas. Why didn't you just call him a racist! A racist that has helped all minorities with record low un employment. And improving their actual standard of living .  Is that the kind of racist you mean ! Fuck off jim and cnn ! You suck !", 'Domenico Malara': 'Kick that piece of shit Jim Acosta out my god that guy dont stop', 'chris kay': 'CNN = NPC shithole!', 'Paul Donnelly': 'Cnn workers are low IQ people', 'James California': '``👌 This is a great example of an honest president not succumbed to political correct double-speak . _( Acosta is a trud 👎)_', 'Stian Myrdal Laursen': 'How this incompetent corrupt clown became "president" is a mystery to the world', 'John Reese': 'Jim-boy needs to goto jail. That his true calling!!....to be a bitch-boy!', 'David Miller': 'Why does president Trump even give this ass an opportunity to ask the question?', 'Janice Foundas': 'Acosta should be acosted!', 'K.M. Smith': 'What an idiot.', 'Anthony V.': "His parents left a socialist/Communist country, and now he's a left wing fake news network reporter.", 'Phil Mele': 'Yes Jim why are you acostaing everybody with your idiocy...? See jimmy it works like this, german nazi nationalist bad American Constitutional nationalist good ...you moron. How dumb, exactly, do you think the few listeners that you have left at the mockingbird  clown news network are anyway dimmy?', 'Tracy Adams': "Acosta the asshat asks another stupid question...here's your sign", 'Brian Harvill': 'Admitting what we all knew.. Trump is a white nationalist scum sucking bottom feeder!\xa0 NOT NEWS TO ANYONE PAYING ATTENTION! What else would you expect form a wife beating, child abusing, self admitted rapist? His dad belonged to the KKK, TRUMP has belonged to the KKK for DECADES now. He is racist scum and we have all known that as fact for YEARS!', 'snoot dingo': 'Its almost as if Jim Acosta is a plant and  asks very  dumb questions so that they blow up in his face to make this administration look as great as they are. Keep up the great work dipshit!', 'tom parker': 'Yea once again the "Don" owns the pathetic Cost-co.....lol...', 'Doug Whitney': 'Jim Acosta and CNN the Race Baiters...', 'hello world': 'A dog by name Jim thought he heard a whistle.', 'Disorder Liberalism': 'My god Acosta, give it up! Race baiter CNN', 'Jerry Davis': 'Someday acostashitz head will be bashed in for his complete moronic slobbering mouth! Oh!,to be there and see it happen!', 'Franz Haas': 'BUILD THE WALL AND PUT JIM ON THE OTHER SIDE.', 'Timothy Tribble': 'CNN IS A RACE DIVIDING NETWORK THAT TRULY NEEDS TO BE BOYCOTTING,AND ACOSTA NEEDS HIS TEETH KICKED IN.', 'Jeff Loudenslager': 'Man what a racist, wanting USA to be strong and make money, how dare he do such a thing same on you, rolllllll red,', 'Tyme Keepers': 'Don’t think anyone would mind if trump said “Jim...you’re a dick “', 'Tomy Boyle': 'Acosta is everything that is wrong with CNN and MSM,they think they are tricky but they are nothing more than court jester fools.', 'Victoria Munoz': "So sick of people pretending this guy, Acosta, is a journalist.  He's an asshole.", 'Anubisavi': 'White nationalist???? when did Trump mean that? If I was Trump I would not even answer FAke news Jim acosta', 'OG213LA': 'CNN = Really Fake News', 'Mike Evans': 'Trumps a dumbass piece of shit worse Pres ever cant wait till he is gone sooner the better!!', 'David Johnson': 'Trump should have said to Acosta "So? You\'re a leftist snowflake and a gutless left wing coward who hates our country, and who tries to unfairly affect the outcome of elections in favor of democrats. So go fuck yourself".', 'jayy see': 'Acosta is a dumbass', "Broussard's Trinkets": 'NPCosta!', 'Rob Williamson': 'Whim Acosted is a gimp!'}{'The Master': "Jim THE TERRORIST Acosta. He's a huge reason why the American people believe that the left leaning media is the enemy of the people...", 'Prisoner Zero': "Me too Jimbo!!\nI was just telling one of my old running buddies today, that I love North Carolina and don't see me ever moving back to Michigan. My sister lives outside of Decatur, near Huntsville Alabama and that is a beautiful area too.\nI love this country Jimbo. If you don't love the United States why don't you talk to Hanoi Jane about transferring you to whatever makes you happy. Maybe you could get a job on the Lolita Express as a photographer or maybe a fluffer. Whatever!", 'Gabe Kis': 'Good going Donald J. Trump !', 'Jesse Aaron': "There aren't words to describe my disgust for that race baiting lying liberal trash Acosta.", 'Bruce Boyden': "Costa's hair products are seeping into the remnants of his brain.", 'JB Snyder': "Look at me! I'm little Jim Acosta! Look at me! Look at me!", 'Rich2K1O': 'The ad preceding this video is a load of propaganda bullshit', 'Marilyn Phan': 'I am a Nationalist, I love my country! GOD bless America!', 'tim murphy': 'Trump is an embarrassment...PERIOD! FUCKING TWIT!!!', 'MrPedalgeek': 'That was by far one of the best answers I have ever seen him give...', 'Ronin Tripp Woo': 'Does the word "Nationalist" have a negative connotation? Why?', 'Matt Fink': 'TRUMP 2020!!!', 'Lee Matthews': "I've run out of expletives for this acosta character he epitomizes what CNN is all about..vile little man.", 'Family Phone': "Acosta just doesn't know when to quit! CNN is so FAKE NEWS!", 'New Lion': 'acosta is TRASH 😂🤣😂🤣', 'Nick R': 'Keep up the good work president Trump ✌🙂✌', 'Peter Dragon': 'Could you imagine being as dumb as Jim and not even realize it? Sad', 'Indy Debauchery': "I'm a proud deplorable nationalist.", 'John Brown': 'Only cnn thinks a nationalist is a complete racist. No wonder they have terrible ratings, who is believing this bs? Good job MR. POTUS', 'Loren Martin': 'Shoulda asked jim if he was a conspiracy theorist lol', 'JOEBURNES2006': 'Jim is such an idiot.', 'Paul Daluz': 'These fucking journalists!!!! Where the hell do they get these things? How do they conjure up these assumptions? And you wonder why the media has all but lost its credibility? Pft!!', 'Blue Horseshoe': 'Jim stop fabricating racism and please throw your dog whistle away, you are embarrassing yourself.', 'gregg merritt': 'President Trump is not a racist - Guess that is all the left has -  They say he is a racist because he loves America -  The left is really deranged and a very say bunch out of touch with reality', 'George Jungle': 'I never not liked Mexicans but the more I hear that being proud of America and being American is racist then FUCK YOU!', 'nurv999': 'Nationalist : a person who advocates political independence for a country. \n\n\n\nThese idiots do not know basic definitions', 'az stuff': 'thank God for this man, at this moment in history.', 'Brent Thompson': "Black unemployment at a high= white nationalist; I'll buy that for a dollar!!!!", 'constant awareness': 'I love our President Trump. So glad we have him. Now to dismantle the Democrats and start  punishing those crooks', 'Queen Sindel': 'Hecking CNN. Nationalist =/= white nationalist =/= white supremacist', 'eric debord': 'God bless Donald Trump. \nJim Acosta is a fucking asshole.', 'Ray Volanos': 'trump is a dumbass', 'Blind Squid': 'The Acosta is a foreskin of a lizard and arrogant as such too. Mind your damn manners dangling foreskin bastard.', 'YouDontKnowMe': 'CNN is trash', 'sid viciouss': 'CNNPC', 'K. Mark': 'Leave it to the left to twist what was so plainly stated', 'Brothers Revenge': "Acosta you're nothing more than a racist virtue signaling coward!😠", 'Howard Mcgoldrick': 'Jim is a dick', 'konvict451': "I think that's about as well spoken as I've seen the big ape...", 'Chimes Media': 'Acosta is not a proper journalist. He is a lying toady.', 'Steve C': 'Acosta is a stooge', 'junior third': "I think some women need to falsely accuse Jim of sexual assault from 30 years ago that they can't remember much about.", 'ALBERTO LOERA': 'JIM ACOSTA IS A PIECE OF SH*T!!!!!!!', 'Eric Chesna': 'OMG some one must have beat the crap out of Jim Acosta with the stupid stick, he is totally mentally sick.', 'Allan': 'Trump is for America and Americans....all Americans. Leave it to the left wing idiocy - in this case the media - to try and twist that into him being a racist. How they cannot get behind him on this is beyond me. The western media and many of its politicos have gone completely insane in their thinking and their ideologies, never mind their dislike (hatred in many cases) for a President who actually puts what is best for his country ahead of himself.', 'Richard Dixon': 'Acosta is a cuck and a racist moron', 'cannonball666': 'Jim Acosta the race-baiting asshole. "So, Mr. President you said you wish for a white Christmas this year. Are you a Nazi?"', 'artbydesignofkc Joey': "Dear Jim Acosta, that's why you're the Enemy of the State you freaking faggot. didn't bother you at all when homo Obama put a fagg flag on the front of the White House and pissed all over the Christians did it? Fuck yourself Acosta. and I have a dream like Madonna your house burns down. And I pray like your witches, that bad Health besieges you. I pray this for you", 'Josh Matthews': 'I’m telling you right now: History will be kind to Donald Trump as he CARES about our country and you cannot dispute that', 'Frank Rodriguez': 'Do you imagine Jim Acosta asking those questions in Iran or China, he would be history', 'Peter Grun': "so trump admits he's nazi.....\nwe already knew that.... and it's already been proven he's a racist.... he's a weak, anti american coward.... and now he's involved in a terrorist plot sending bombs.", 'Bryon Hills': 'Suck on that answer Jim', 'Paul Leavitt': "I'm a nationalist American so far from being a white supremest. lol", 'Geo Mondiale': 'CNN is going to spin this somehow to make Trump look bad... they alway do', 'Jeff Mills': 'cnn should be banned from the White House.. fuck em', 'Justice Leaguer': 'Nothing wrong with being a nationalist. Nothing to do with race but that’s all Acosta can ask about. News flash we don’t give a fuck about skin color. Get over it.', 'Vince Hughes': 'Acosta = Douchebag.', 'Shadow Banned': '*TRUST CNN TO TRY AND TURN IT INTO SOMETHING UGLY THAT WHOLE NETWORK NEEDS TO GO*', 'Christ Is God': 'Jimmy boy is still around?!?', 'Joe Koch': 'Jim Acosta is a dog whistle.', 'josie wales': 'CNN ... COLONIC NEWS NETWORK', 'Eli Olum': 'And Putin Owns this deplorable  President.', 'Eric D.': 'POW ! Right in the kisser !', 'Gloria Sheppard': 'Acosta is so rude especially to our president.Shame !', 'NPC 158761': 'Thank you daddy Trump', 'We The People': 'God Bless our President...\nI STAND for this nation above any others.', 'nak clahan': 'Fuck am not even born in this country n love this country more than that stupid fake\nNews reporter..\nCNN LOW IQ in my opinion \nAsian for trump 2020', 'Thor Abraxas': 'AMERICA NEEDS A REVOLUTION TO CLEAN HOUSE OF THE FAKE NEWS AND ALL ENEMIES TO THE CONSTITUTION INCLUDING THE ENEMY JEWS HIJACKING AMERICA THROUGH THE BANKING, FAKE NEWS AND POLITICS.', 'mikeatc33': 'acosta is just a self righteous douch... you can not be a bigger blow job than this fuckin guy...', 'James Tepera': 'Awesome.  Way to take back the English language from the Left. MAGA!', 'Brock Nokli': 'Trump the Orange supremacist.', 'sandyh6776': 'Hell yeah! What Trump said', 'Aaron Henshaw': "You said you were a nationalist, so you're a white nationalist?? That doesn't make any sense. Bernie Sanders says he's a socialist, but no one calls him a nazi.", 'bingohan': 'I’m glad, am not a Cuban American. Jim Acosta is an idiot with a college degree... Send him back to Cuba. Let see if can survive in Castro’s govt.', 'Skidmark75': 'Its always interesting to see a president grow into thg he job. It happens to every one of them and I think he is doing great.', 'Brian Dantonio': 'Thanks Jim Acosta well played sir.', 'Matthew Kohen': 'Its OK it be a Black nationalist, Hispanic nationalist, Japanese nationalist but to be white and proud of your country is bad?', 'Max Factor': 'Jim Acosta and his network are more dangerous to our country than President Trump could ever be.  He fully expanded on that verbal attack with reasoning behind his thoughts and political direction.  Jim Acosta should be ashamed of himself and everything he and his network stand for.  CNN is out to destroy our President because he spoke the truth and called them out on their bias liberal narrative values.  If they want to be respected again they need to have a balanced reporting structure.', 'Bonnie Bemboom': 'Good job president Trump', 'aeroswede': 'The left with their language bending illusionary skills................', 'Dicky Jones': 'Little jimmy acosta only does what his corporate masters tell him to do.  He is a traitor and a scumbag too...', 'Country Boy Ogre': 'Imagine uh uh uh Obama trying to uh uh uh uh talk like this,  uh uh uh without a a a a a a a teleprompter.', 'Tactical Persian': 'Fuck Jim Acosta and his race baiting network.', 'Jason Sechrist': 'Trump 2020!!!', 'Tvoe Voe': 'Acosta is a DOG', 'talleyrand': 'Fucking liberals hate this country so bad.', 'Floridian': 'Mr. President PLEASE DO NOT allow this man in our great WH,  He is not a reporter, he is a joke and we the people are sick of him and his coworkers.', 'Alex Jones Fan Page': 'So to love your nation is to be a racist? Cnn reporters are certified idiots', 'Juan Amaro': 'Burn!', 'Randy': 'So now Lying is owning someone?', 'Stars N’ Stripes Forever': 'Hell yeah! America nationalist extremists here!', 'Edith Ransom': 'Why DOES he bother with Accost! DIY and  Nickolodean have more viewers.', 'Garrett Quigley': 'CNN is more racist than Clayton Bigsby.', 'Twincam Mike83': 'Jim is a huge peace of shit...mangina...', 'Bernard Martinez': 'PRESIDENT TRUMP LOVES AMERICA "BEING VERY PROUD OF AMERICA" USA, USA, USA, USA!!!!', 'The Boy Who Lived': 'Reduce everything to race. Check!', 'Hope Gambles': 'President Trump is toooo smart for that moron Jim Acaca, sorry but he or any other of the idiot democrats will ever get it, unless............. they jump on the Trump TRAIN!!!!!!!! 🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸'}{'Simon John Hinton': 'Jim fuck off, NO SERIOUSLY JIM GO JUMP OFF THE GOLDEN GATE.....', 'Gail Goodwin': '🇺🇸🇺🇸🇺🇸🇺🇸🙏🙏🙏🙏🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸', 'Kent Hutchins': 'Why take questions from fake news.  That guys a JOKE.', 'Auto-Tech-Tronics - Div: Telamax': "President Trump you have to understand that the U.S Nation is the only nation in the world that counterfeits money give them a few Notes for Evil's sake !", 'Jeffrey Pells': 'Will never watch cnn!', 'demogorilla': 'The Democrats sent those pipe bombs', 'slorznovitch': 'President Trump rocks!!!', 'Dwight Charles': "Im a nationalist n im not white fuk jim da Moron/Libreal Demacrat! CNN against the ppl.o da USA FUK'EM!", 'illiam way': 'They keep letting Jim  "doucheface" Acosta into the White House and Presidential events to keep him humiliating himself his bullshit network and the left. It works very well .', 'Anthony Cella': 'Is Acosta a  american?', 'DurdenTyler21': 'Trump 2020', 'ferventheat1': "I like Trump's policies and respect his viewpoint. However on the agricultural trade and blockages, I'm with the EU side due to the very low food quality standards of US meats, grains etc. For example, GMO, pesticide contents, animal husbandry. The EU might as well buy food from China as the USA. \nSome level of protection is needed to stop a flood of low grade, cheap food which would devestate domestic producers and poison their population. It's well known US meat is low grade and disease ridden. Look up Walmart meat videos .. yuck!", 'Graszhoppa': "So being a globalist is ok? Thats racist, bcause our globe is just tiny fragment of the milky way. O shit... im a Mikywayist? No also racist because it's just a tiny fragment of... etc etc So no matter on what perspective you're looking. Your white so racist.", 'Squeek Tate': "You know you've won a debate with a liberal when you get called a racist.", 'Glen Baird': 'OH Jimmy boy ,,,, you must be a very misarable soul ,,,,, i find that very sad ,,,,, we are told , in the last days , men will be blinded to the truth,,,,,you most likely need a seeing eye dog,,,,,prayerfully you will find your way before it is too late......God is real and he is watching , all libbies beware......', 'Lady USA': 'So the President had to explained himself in what sense he meant by a nationalist to a dumb twisted "reporter" & it will still be twisted from fake reporters that just hate him, hence, they are not news reporters anymore.', 'Sumeet S': 'Jim acosta is a retard.', 'Count Jers': 'Trump im not sure but Cnn def racist', 'Bullert Kevin-G.': 'In my opinion USA has no other choice. They must protect europe, if europe pays or not. I think he has not understand it. Because if russia or china occupies europe, USA would have a problem, so they must defend europe in there own interest.', 'Don Incognito': '"... now go get ya fuckin\' shinebox."', 'Russell Littler': "Acosta...you're a prick.", 'KJ BDP': 'Here you go Jim 🎁', 'Jace Volk': 'Why the hell does Jim Acosta even ask bogus ass questions? I mean really..he asks surface level questions and it’s embarrassing to watch.', 'D JH': 'Best President Ever!!', 'Smo Kitty': 'Acosta had become the USes Bagdad Bob. The guy literally has no shame. Sooo sick of these globalist propagandist NPCs.', 'Joel Threatt': 'F em  immediately drop our nato contribution to 1%. Let europe handle themselves. Damn ingrates', 'Lee Harvey Oswald': 'Whats wrong with being a White Nationalist? Im proud of being White and my Country.', 'Serena Nocturna': 'Looks like old Acosta is projecting his own personal racism on everybody else again. The guy is a clown & perfectly exemplifies what CNN is all about.', 'jshockey34': 'I wonder if Jim Acosta realized he was speaking out loud or if he though he was internally mono-logging with that stupid question.', 'Lawrence DeHarde': 'Great job Trump', 'Michael McGrath': 'Acosta needs to get punched in the face.', 'Analog Kid': "How the hell does Acosta's still have a job? Even for a far left nut job, he's a complete embarrassment for his station every time he opens his mouth.", 'JasonVoorhees10100': 'people love nit picking problems in regards to race and sex because its such an easy way to rile stupid people up. cnn and these other idiot stations are to blame for the rioting and so called peaceful protesting plaguing your country. he is not proud of that side of our country and where these idiots energy is going. newage hippies just 100x more ignorant.', 'D. Tunney': 'Acosta is a legitimate embarrassment', 'Andy MacDougal': 'Acostia, you mother fucker', 'beanie boos and shopkins!': 'This guy is an embarrassment to his profession & to the American people. CNN should get rid of him & put a Journalist that at least ask a decent question & not always trying to cause problems. Then they wonder why their called the FAKE NEWS MEDIA', 'Tim Dore': 'Trump is awesome he does love America unlike the liberal press.', 'Helix Snow': 'How dare you love America!  Stupid reporter.', 'CarlosChip Morales': 'Jim Acosta your mother should have aborted you!!!', 'isthis myrealname': 'This is great. Makes sense', 'Louis Pacheco': 'Jim Acosta sits down when he urinates', 'Sarge Forward': 'How does any self-respecting woman, man, other lay down with Acosta?', 'Frank Zen': 'There goes the "dog whistle" theory! LMAO!  Made him look retarded!', 'Skye Lite': 'Ppl someone tweet acosta, Pelosi, karmela, mad max, all MsM Home address so the caravan invades their house (s) they are turds....', 'temesgen Demelash': 'But not please your GMO products', 'Eric R': 'I am very proud of President Trump for protecting our country the way he does', 'Paulie Manafort': 'Yup, very fine people on both sides. Except your side, your side is populated with racist assholes calling themselves nationalists.', 'S. Scirocco': "acosta should have his 'press' credentials removed immediately if not sooner. cnn is nothing but a bull horn for the DemonRats. Always has been, always will be. The very next time he asks the President about something to do with him being racist, misogynist, homophobic or zenophobic, President Trump should just point to the nearest door and have his security people remove any credentials on his person. I'm sick to death of that spineless little twerp and I can only hope that someday soon he gets his just reward.", 'Eagle Legion': 'PATRIOTIC GREAT CITIZENS OF USA AFTER MASSIVE LANDSLIDES VICTORY OF RED WAVE MAGA... THEN HOUSE WILL PASS BILL ON MEDIAS ENEMY OF NATION USA.   GO VOTE ON BRIGHTEST RED TSUNAMI', 'Sparky': 'Democrats are surely hanging on to that "racist" bullshit', '5thcorps': "Coming from a reporter who's network has lower ratings than the copper pan infomercial.............", 'TheToeCutter': 'Greatest President since Washington', 'Joseph Loughrey': 'Jim is attempting to paint his national feeling with race. There is a racist here and his name is Jim.', 'Daniel Castaldo': 'CNN ABC MSNBC CBS please all go out of buisness asap', 'David Jakubuwski': 'Click bait', 'DMS669': 'President Trump does not need to ban Acosta from the WH.  All he needs to do is to continue letting Acosta self destruct with those absolutely retarded questions.', 'ruler of gods': "I'm with Trump", 'S Burgos': 'Why does Jim Acosta even have a job at this point? I mean he asks oddball questions based on rumors instead of asking the important or even relevant questions.He is doing a great disservice to the American people who would like to be informed. If this is how Jim Acosta wants to carry himself then I think he would be better suited working for one of those tabloids that you see while waiting on line at the supermarket. "Mr President, is it true that you are bat boy\'s illegitimate father?" Then again he works for CNN (fake news) so I guess it\'s the same thing.', 'Vaughn Rice': 'Not sure who Jim Acosta is working for the Russians, Chinese or just himself and his ego!', 'FREEDOM IS A NATURAL RIGHT"  Thomas Jefferson.': 'What is wrong with LOVING your country & wanting the best? \nIn the brain of liberals only people from other countries have the right to be proud of their countries.\nRediculous & stupid thought process!!!!! 😂😂😂😂', 'Sherry Adams': "Right! This country has been taken advantage of for way too long it's time to change things", 'Jim Watson': 'I wish another reporter would turn and slap the shit out of Acosta...', 'Phack Em': "Jim acosta's goal in life is to be on tape asking the dumbest questions any pseudo journalist has ever asked", 'ScrewedUp FisherMan': 'If you are white and you watch The View or CNN, you most likely will be brainwashed into hating your own race.', 'Rich Pipia': 'Him is a Idiot and UN AMERICAN, why is he in the white house press.', 'averystorm': 'Hey Jim, Trump is also a male, and not cis gender.  Now go cry about the world not caring about how loony lefties define terms.', 'rex Dalmatiam': 'Trump needs to start using NPC meme', 'About Time': 'I think Jim Acosta need to interview the Saudi ambassador in Turkey.', 'JG': '"If I were to run, I\'d run as a Republican. They\'re the dumbest group of voters in the country. They believe anything on Fox News. I could lie and they\'d still eat it up"', 'Joe Biernacki': 'Promises made, Promises kept.', 'gabrielmezaali': 'Godbless President Trump!!! MAGA DEMONRAT TRAITORS!!!', 'Chris Gunderson': "CNN is fake news and Jim Acosta is a race baiting piece of shit!  Can't wait for the revolution!", 'edison': 'Owns? Fuching rednecks!', 'Mitheledh': 'The great thing about "dog whistles" I\'d that they let you claim that anything, even the most benign statement, is proof that you\'re secretly racist.', 'Francisco Elizalde II': "Jim Acosta is not even American. If he doesn't like Americans being nationalist, he should go back to Mexico.", 'Tezz Tezz': "Jim acosta you are a sucker for punishment. Trump kicks your ass like it's going out of style...please have more respect for yourself...will start calling you as of now...KICK ASS JIM...🤣🤣", 'devilkumarr': 'Asocta is the dumbest reporter', 'carol k': 'Jim Acosta is so obtuse.', 'Paul  Peart': 'This is why he is a true leader and the best president ever', 'Janka Janssen': "I love my country, therefore I'm a nationalist. Acosta is a dope.", 'Marlon Ferez': 'Acosta is the gift the keeps on giving', 'tommobeast2': 'Yea Jim you stupid cunt', 'john walker': 'Jim Acosta is a vile wretch.', '58biggles': 'Why does this orange moron never answer a question but just waffle on with irrelevant statements and lies?', 'ben dover': 'God can this dude Acosta get a brain tumor or something', 'Virginia Hale': 'I swear to god, the man is a idiot. Everytime he opens his mouth his ignorance just spills out of his mouth. Someone please ban this putz, so the rest of us can have a nice day.', 'Christopher Hurkmans': 'Acosta is a slimy piece of excrement working for the (CNN)Communist News Network . No one takes this virtue signalling idiot seriously.', 'Gamja': "Retards, haven't they learned anything President Trump does not speak in code he says it like it is.", 'Swaggercat': "Jim, look up the definition of Nationalist.  It's nothing to be ashamed of. Idiot.", 'Andrew Wimbish': 'Thank God for this man.', 'Mini Cats': 'Jim your a idiot,  our President is fighting for all Americans, even you ,you ignorant, ignorant man!!!', 'Edward Cincibus': "Dude, I love Trump man. He needs to keep doing what he's doing. He's got balls.", 'David Ahokare': "Stupid Jim Accosta! Shame on you and your Criminal News Network. A leader of a nation is supposed to protect his/her country's national interest and being a Nationalist is paramount to achieving that.", 'Boo Who': "Jim Acosta is giving dumb don lemon a run for his money as world's dumbest man on tv title. It's close.", 'NPC420187692018': 'Trump is evil and a racist nazi', 'EVAN R': 'Acosta should be out of a job', 'MrAdrenaline1982': 'By now those idiots in the mainstream media should be aware that Trump doesn\'t use "dog whistles". He always says exactly what he means, of course aside from when he is obviously joking. One of the main failures of the media during this Presidency is the way they always try to twist Trump\'s words all the time to fit the narrative they have about him.'}{'Windy Windy': 'Finally a president who loves his own country and his own people!!', 'Evan Ogren': 'Jim acosta is a joke', 'Jeff Cardinal': 'Whoop jims ass! \nMaga or death', 'Zachary Pike': 'America!', 'Jack Lincoln': 'Acosta should be “Khashoggied” for being such a PIECE OF SHIT!   Look at the Caravan. People marching with their flags of origin. How ironic.  The very nation which oppresses them, and they proudly display their nationalism and want to impose it on the USA.', 'Nessa': 'Acosta is an enemy combatant. Why is this guy allowed in press pool at white house?  Remove is rear end.', 'Josh Kirby': 'Has nothing to do with race. Piss off Jim', 'Mary Lee': 'Acosta, whenever you ask a question you sound like a whiny asshole and by asshole I mean asshole. Can you explain that to me when you stop crying?', 'Dave Jeffers The King Of Music': "As a trump supporter myself I have to say he contradicts himself here a little bit by saying he wants other countries to open their borders but he wants to close he's.", 'Scott Alexander': "Love him. Looks like he's aged already. Keep going Mr. Pres.", 'joe Schlotthauer': "Trump should've just spat in Jim Acucksta's face...", 'Intellectual Trumpster': 'I wish Trump would start this off first by saying \n" who\'s concerned?"\n You mean you\'re concerned? don\'t lie and say people are concerned when you know you are the one sneaking in your ideology in this question. You know what Jim? People are concerned about fake news from CNN.', 'JC 40324': "Such a petty little brat. He gets his orders to pick apart Trump's every word on a daily basis. The press is making this country so miserable.", 'pimpninja1985': 'I hope a grand piano falls from the sky on Jim Ocasta.', 'JDDIZZLEEE': '*CNN = ISIS*', 'Gavin Burrows': 'Jim Acosta is the pricks prick!', 'model nutty': 'how in the F is Accost-Ya even allowed in there?', 'Josiah Taylor': "I'm a western chauvinist. Western Culture is the best. I welcome all ethnic and religious backgrounds to embrace equal opportunity and God given freedoms.", 'Delightful Douschebaggery': 'So far,  7 mentally ill people have voted this video down. \nWhat kind os sick person does that?  Liberals are all sick. This is the sitting President of the  USA talking about s love for his country.  Vote down? Really?  Scum of the earth. ..', "William O'Connell": "It's shameful that CNN actually pays a salary to Jim Acosta with all the other questions that a reporter can ask the president of the United States he's still on the white supremacy issue. Don't you think by now all of that would have been exposed? No focus at all on the other accomplishments of the president. If you're going to go to journalism school for those students who really want to be a journalist you better understand that a real journalist remains objective. The leading questions have become a joke and so has The credibility of that reporter. That's the part he doesn't understand. The media has tried to do anything and everything they possibly can to take down this president. They should do this with every president then from here on in. They sound like a bunch of whining babies. The reality is this President is in fact a nationalist who believes in patriotism. That doesn't mean we all have to like him. I for one would like to see his taxes just like you and I have to show our taxes and transparency.", 'David Klimmek': "Our POTUS is sounding super Presidential . He's vastly knowledgable about the REAL issues. Our media is a joke! What a travesty. Americans are waking up tho. This isn't about political sides & DC rhetoric. This man is getting things done. Period. God bless 🇺🇸.", 'Greg Storey': 'Old dog whistle himself, accosted, just riding the coattails of a legendary and historically important man (President Trump) just so he can get his name in a history book too. Just another bottom feeder people. Nothing to see here.', 'Jeanie Delgado': 'Well said President Trump! These race baiting reporters need to be banished from being allowed in the White House!', 'Berthasfave1': "Leave it to the douche bag Acosta to turn President Trump saying he's a nationalist into a race issue. It must suck to live in this asshole's skin.", 'Richard Blanchard': "That's why we Patriot love our president", 'Smith N. Wesson': 'I picture young Jim Acosta, bravely struggling to break out of the various sized lockers he was undoubtedly shoved in between classes.', 'Sean Cullen': 'Hitler was a nationalist socialist,  socialist hmmmmm', 'eyeOOsee': 'Thank you, Mr. President....AMERICA FIRST!!!  ❤️🇺🇸❤️🇺🇸❤️🇺🇸❤️🇺🇸❤️🇺🇸❤️🇺🇸❤️🇺🇸❤️👏👏👏👏👏👏👏👏👏👏👏👏👏', 'tommy vy': 'Fuck cnn, jim acosta is an idiot!', 'Sarah R': 'God bless president Trump.', 'Mike j': 'Right away with the racist shit....very shameful! All our President wants is what is best for America!', 'Conservative Mexican': 'Nationalism has no color', 'Wet Rain': 'Fuck jim acosta', 'Chuck Longino': "I KNEW C N N WOULD ADD WHITE TO THIS ! OUR GREAT PRESIDENT DONALD J TRUMP 😇HANDLED THIS PERFECTLY!   I ALSO AM A NATIONALIST JIM! 😂🤣🤣 SINCE THAT DIDN'T WORK, NOW WATCH THEM WORK THIS AROUND TO WHITE SUPREMEST! JUST WATCH!", 'Cydonius1': 'Ah so it was AcostaNPC398439 … "dog whistles" .. "far right" .. typical CNN', 'Dan Han': 'I’m a nationalist and I’m proud of it, And?\n\n🖕Acosta and CNN', 'ESIREYEWUN SANNI': 'I am Nigerian and do not care if Trump is a Nationalist or White Nationalist ..... whatever. He is great.\nThe ethnic base of the USA is european. That is what has made the USA great and is what will keep the US great. It doesnt mean others should not be welcome but it means you cannot afford to welcome too much of other groups.\nIf the US wants to remain first world, it needs to reverse this trend of illegal and unfeathered migration from those countries. \nWhen you look round the world, it is obviously to see that the top countries are european and east asian countries. Its not rocket science.\nSo i would not be grudge Trump for wanting to keep too much of certain groups out.', '995sean': '"White nationalist"? CNN is so pathetic', 'MrCurbinator': 'Im white and i love my country. Apparently thats makes me pure evil', 'Ron Onderweg': 'Send Acosta to a consulate in Istanbul for an elaborate manicure.', 'Jeff Jankiewicz': 'Acosta is cannon fodder.', 'E vazkee': 'Awesome!', 'aneesh89': 'how many times jim acosta can take embarrassment like rhat', 'hugemagoo': 'This is why republicans will prevail in the midterms and trump will win 2020.', 'Paul Keith': 'Jim Acosta is such a fucking prick.', 'Al Madani': 'Shut up. Decosta you anti American rat!  All real patriot Americans are nationalist!  Keep using the word as he says make it popular again.', '00Kuja00': 'Amen! Trump can come over to Sweden and help us here.  :P', 'Downright Dutch': 'Like in Europe, 🇱🇺📣 they come from all parts of the world (even take a plane and land in Greece to be a (pure economic!) “refugee) and German (national) socialist DDR Merke🤣🤣🤣🇺🇸🇺🇸🇺🇸 says: “WELCOME DEAR TERRORISTS from Afganistan, Lybia, Nigeria, Bangladesh, Iran...!” CRAZY‼️ All ‘pharmacists, rocket scientists, dentists, ingeneers’!, from shithole muslim countries, they cannot even work in MacDonnalds!', 'C. Toman': 'the only dog whistling comes from the dems and that immigrant ocosta... fuck him and them', 'Andrea Hardwick': 'Anyone else watched the new season of Madam Secretary where the REAL Madeleine Albright, Colin Powell and, yes, HILLARY CLINTON appear on the show? I think it was the first episode where they all get together at the end and denounce Nationalism like it is Nazism. Unbelievable. How many NPCs are watching that getting ready for their next brainwashing chant? Talk about propaganda.', 'Think': 'acosta is a fool, a cartoon, and a moron.  Boycott CNN, MSNBC and their SPONSORS', 'Jerry Vickers': 'Acosta really needs to be Bitch slapped by a woman Straight up in public and wait for him to cry to the other woman Anderson Coooooop', 'Emmanuel JESULOLA': 'What a stupid question', 'AhPhoey': "Trump's right here.", 'rahulbosebose1': 'Left wing always get hung up on some words they want to ban or redefine. Its their favorite method to suppress free speech', 'Darla Austin': 'I absolutely love our president!!!', 'Tom Jakovac': 'Jim Acosta is a total idiot, paid to be an idiot, and he loves being an idiot! Not a reporter, but nothing short of being an instigator for other idiots!', 'Louis Soliz': 'Jim’s a stupid POS!! 😆', 'DMK5506': 'Trump should have said "I\'m a nationalist and you\'re a conspiracy theorist."', 'LILARYAN GIRL': 'SEEMS TO ME THAT THE ONLY TIME FOLKS ARE CALLED RACIST IS WHEN THEY ARE RIGHT, LOVE OUR COUNTRY, STAND BY OUR PRESIDENT , DONT WANT TO BE OVERRUN W ILLEGAL IMIGRANTS,    AND HAVE MORALS...SO WOULDNT THAT MAKE BEING RACIST A GOOD THING!?!? \nI saw a story where Muslims were raping young girls , destroying property, and getting violent with natives...cops stood by and did nothing for fear of being called racist!!! So what!! Let them call u names who gives a f**k! PROTECT YOUR OWN! THEY SHOULD MATTER FIRST! ....YOUNG GIRLS ARE BEING RAPED!!!!', 'Danny Scofield': 'Nationalism is basically the same thing as patriotism. What a douche reporter', 'Joshua Buck': 'Some one please take out Jim', 'Live From The Gutter': 'I can’t do anything but respect this man highly ✊', 'BIGMUFF 1995': 'VOTE BLUE NOVEMBER 6TH ! WE THE PEOPLE WILL REMOVE HITLER MCMUSHROOM COCK', 'Steve schatz': 'I bet acostas diary is soaking wet from his tears every night. The pages are also probably stuck together from "patting himself on the back" (beating it) while he reads his crying diary entries about how brave he thinks he is. Sorry for the 2nd visual.', 'HidnNOS M': 'Well said Mr President', 'His Overlord Upon High': 'President Trump is right again. These rediculous reporters.', 'maxim jones': "President Trump schooled that POS imbecile with a grade 2 education and IQ again. But the A$$ hole just don't get it.", 'Axeman Railing': 'Guess CNN refering to someone as a house negro isnt racist at all. Give it up race baiter.', 'Dennis King': 'Someone please attack jim acosta  on the streets. Beat the fucking life from him.', 'Alpha Charlie': 'MAGA', 'Mike Larkin': 'Jim is a douche.fake news..', 'Wesley King': 'Acosta is a joke', 'Wayne Brogdon': 'Sad all this falls on deaf ears', 'MMAFighter38': 'God forbid if our president puts America’s interest first . The media are a bunch of damn titty babies', 'MyTEEsharp1': 'Preach P.O.T.U.S!!!!!!!!!!!!!!!!!!!', 'MECowgo': 'Isn\'t it telling that only liberals seem to be able to hear "racist dog whistles?" No one else can.', 'James Bowen': 'What an arrogant asshole News Actor, if I was the President I would not call on him ever again!', 'Ronald Goldstein': 'Coded language CNN and Acosta suck cock I wish trump just banns him from the white house briefings  I will spit in Acosta face if I c him at a trump rally', 'Stephen Hitchcock': 'Fucking Jim D3costa is a stupid lib twit!', 'I am Chappy': 'Hes a nationalist, and his white.......... hes s white nationalist!!!! \n:O :O :0 :o 😳😳😳😳😳😳😳 stay wok', '_ L': 'If he meant white nationalist he would have stated white nationalist you disingenuous fucks.', 'What Will Happen': "So he loves America, wants to take care of Americans and he's a racist? That is freaking stupid whoever thinks that is a complete idiot.", 'Sandra Perales': 'I’m a LATINA and I’m a NATIONALIST and I’m not a RACIST and I’m proud of it.', 'المسيح هو الرب': "Trump answered perfectly. I'm proud of him.", 'Evil Bastard': 'When Democrats find zero evidence of racism:  "We couldn\'t prove it, BUT HE WAS THINKING IT!"', 'Big-J': 'Old news: Acosta is an idiot. We are done being the baby daddy of other nations.', 'Mark Scott Staggs': 'First of all Acosta is neither a journalist or a reporter. He is a propagandist of the Marxist movement. His job is to subvert the truth and expound lies and deceits.', 'Gregory Albert': "Jim's lucky he got off easy. Their him in the caravan. Love trump", 'Connor McGuire': 'I love this President. He is our guy.', 'bluesbrothas2 Fonda': 'I just realized Trump kind of looks like Clint Eastwood. Thumbs up if you see it.', 'Edward Petruik': "It's unpatriotic to be nationalist LOL.", 'Jon Van Norman': 'May God protect our president and all those who come against him fail. And anyone who wishes to do him harm be stopped and jailed.  Best president ever', 'Wreklessracr': 'cnn sucks and so does jim acosta scum', 'knickandchester': 'God Bless President Trump. Love the way he schools the "press"', 'Graham W': 'Vote Red November6th we need to win this year and we will go higher'}{'dakotaslim': "It's time that people like Acosta (and everyone at CNN) be referred to as journalist/activists.", 'brandon rink': 'Pretty sad how the left has somehow equated loving your country to white supremacy', 'JASON P.  Roberts': 'Acosta is a liberal leftist Democrat  bitch.', 'Mitchell Lane': "Jim Acosta, You're a dumb shit!", 'Richard El': "Ole jimboe is always propagatin negativity! His intent is create distraction and division. Not today! He got Trumped! Trampled! Put back on the shelf! Ole tired turd! Don't even stink no mas! Ole jimboe is a has been that never was! After he fades the stench will cease. Good riddance. His resistance has been an exercise in futility!", 'lb8825': "White Nationalist = A person who loves their country and is white. \nDoesn't sound racist to me", 'craigmancool': 'Fuck nato.  Fuck the un.  Fuck europe.  Fuck china.  Fuck you domestic traitors. My new rally chant.  "ENOUGH TALK,  LETS FIGHT". " ENOUGH TALK,  LEYS FIGHT". !', 'Hal McAdams': 'Acosta hurts himself by asking puerile questions. President Trump answered very well by ignoring the childish core to the insult.', 'DrDaggerSwagger': 'The term white nationalism is a dog whistle to manipulate far alt-left neo marxist', 'Kurt Cyrier': 'Acosta the pos is so ignorant wish someone would beat the shit out of him', 'Scott Guise': 'Mother Fucking Acosta.  You need your ass kicked up and down the road you disrespectful fucking punk.  Trying to hide what you think our President is, using PC is no different than the dog whistle you accuse him of.  I personally would like to break your jaw you piece of shit.', 'Villy Rivera': 'Acosta needs to man up !\xa0 CNN is the resistance network !!!!', 's tanner': "Being a nationalist is right and proper so long as one can see what is great in other countries and bad in one's own.", 'Melanie Evans Martin': 'Jimmy, Jimmy, jimmy. Haven’t you noticed that president Trump is waaaaaaaaaaaay smarter than you. Your in kindergarten and he’s got 100s of college degrees.  Give it up little Jim.', 'jp cia': 'Spent 6 years in Europe with US Military......Trump is 100% correct!   Europe is not a friend,,,they complain we are there, but take millions!', 'Guillermo Guzman': 'That Acosta embarrasses me every time he opens his pie hole', '4321eyeseeyou': 'I am not White and I am a Nationalist-my love for this country. Since I am not White, why the hell would I back President Trump if he was a racist in any way? I back him because of how much good he has done for all the people of this country who wanted and needed his help, no other President has done what he has accomplished in so short of time, only to be slowed down by the people who do not, who care not except for themselves and their group- the democrat liars(the true racists), the fake Republicans and the elitists in Banking, Universities, Media, Entertainment, etc.', 'Lawrence t. Mcguilicutty': 'Acocklick is such a pussy', 'Satixa XR': 'SNAAAAAAP!!!!! 🔥🔥🔥🔥🔥🔥🔥 no doubt in my mind trump will win re election 🇺🇸💕', 'Dr Longus': "Acosta is so stupid he doesn't seem to realize when he tries to set Trump up all he's doing is giving Trump a platform to show how much greater he is than Acosta... It's just beautiful🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸", 'rdaystrom': 'Acosta is a jerk.', 'Graham’s World TV': 'YES, I AM A NATIONALIST!!! God save The USA', 'Orlando Chavez': 'Acosta is an NPC', 'Mary Hocking': 'Well said Mr President....MAGA!!  Trump 2020!!  😎', 'Occ Doc': "Trump also shouldn't like it that the U.S. pays $3.5 billion a year to Israel.  This is a slap that in the face of nationalism.  Let the Zionists pay for their own damn country.", 'GanjaStarburst74': "I'm White, & I Am An American Truth-Obsessed Nationalist...Make The World Great Again. :)", 'supajc': "The common trick of intellectual charlatans is to expand the definition of a word and then expect that you'll believe the same logical consequences follow as they did for the prior less expansive definition.", 'Maenza Creations': "And we borrow money from China to pay for the world's defense.  We're charging it.", 'Agave 2020': 'You can bet Soros pays Jimmy big bucks for each racist question! Nobody is this stupid!', 'Nazz Boner': 'Why is Jim Acosta even allowed in the Whitehouse?', 'John Walker': 'Too many facts for the liberal democratic mind to hold together.', 'Lawdawg 327': "And the TOOL of the week go's to...... Jim Acosta!!", 'Jim Bateman': 'I heard Jim Acosta was injured in a cave, when a large Stalagmite crashed down on his Thumb...(in his mouth). The stalagmite was his tooth, and his THUMB keeps him quiet.', 'LiAnn Stewart': 'I am a nationalist, I am NOT a racist!!!', 'Mark Lopez': 'Total obliteration from Trump with that answer. Almost like he was prepared for that question..', 'Anonymous 2019': 'how does anything Trump is saying here be taken as bad?', 'Mike C': 'Well said prez! 👍🏻', 'Manuel Perdomo': 'Sooo.. nationalism is bad...? but socialism is good ...? Liberals logic at work.😂😂❤️❤️🇺🇸🇺🇸', 'Guns n’ Buns': 'I fuckin love our President.', 'dave miller': 'Acosta,you are a asshole', 'RudeOfTheTurks': "Jim Acosta is a worthless dope.  He's basically a caricature at this point.", 'Pardon me,': "I'm glad he brought these real issues up. It shows where the liberal media and the left's priorities are. They want to welcome in illegal immigrants and give them unlimited handouts, they want to give women, gays, and minorities even more privilege than they have. They do not care about the economy or national security. They don't care about creating an environment that makes it possible for people to support themselves and have basic needs. People in America still can't meet their basic needs, and the left derails any progress by turning the attention to non issues like the Kavanugh hearing. Goodness gracious. This is the problem when young people with no experience are encouraged to vote. They haven't lived in the real world long enough to understand how anything works. They haven't had time to train their moral compass to distinguish right from wrong. And they're embedded with hatred against the Republicans and Conservatives and all that they stand for, not even thinking for once about what they're actually fighting. The human brain fully develops at 25, but it may take longer for some to reach full maturity, especially if they're bombarded and constantly stirred by social pressure. It can take a long time for someone to learn to think for themselves.", 'Novatsi': 'Dude got smashed!', 'ChiriCuto': 'Jim Acosta Definition of nationalism. 1 : loyalty and devotion to a nation; in other words Devotion to America', 'Dan Kuo': "It would be interesting ask Acosta to regurgitate Trump's answer of what is meant to be a nationalist. Does Acosta returns to his rant of dog whistles?", 'Youtube Nutzer': 'Yeah, get your military out of Germany, stop attacking innocent people from German Ground, give us back all the patents you stolen from the German People, stop taking enormous amounts of money from us for something that happened 70 years ago and give us back our Gold (that you probably misappropriated decades ago). Then you can start talking about fairness, you hipocrite.', 'Phuck Ewe': "Jim Acosta is the world's biggest cuck.", 'Jan Bracewell': 'Why would that dick head journalist say a nationalist ,which is country first, a racist ,projection I think', 'Paul Greening': 'Dim Acosta is such a moron!', 'Patriche Will': "Jimmy boy...can't you just shut your hole? You're getting dumber every time u open ur mouth", '2Words 1Finger': 'Nationalist, the new "N" word', 'James Lloyd': 'Acosta is a mindless chump. I am surprised that he is in possession of credentials that provide access to ANY Press Briefing. He should have lost them, at the time he proved to be an incompetent, biased moron. I want to apologize to any person who thinks I am being harsh, but then you might also be a MORON like little rude jimmy Acosta.', 'John Tsibidis': "Acosta if you haven't got a question of any significance shut the hell up don't go looking for sensationalism every time", 'Meh': 'How is that unreasonable? It’s not.  MAGA!', 'G Mart': 'I wanna see Jim Acosta get blasted in the face!', 'Charlton Kekston': 'Thank God for this man, he was sent to save the USA.', 'Augustus Gloop': 'Damn he’s smart.', 'Joe .J': 'na·tion·al·ist\n/ˈnaSH(ə)nələst/\nnoun   1. a person who advocates political independence for a country.', 'S B': 'should freedom of the press cover blatent lies and misleading information?', 'Sai Tui': 'Next they will be calling trump, a reptilian shape shifter.', 'Dilly Dally': 'Jim Accosta is a moron factory.', 'Tony Notstated': 'Does anyone have Acosta\'s address?  I\'d like to send him an "eat my shit" sandwich.  That was code for eat my shit a-hole', 'terryfriend16': "Vote in the mid-terms. You can vote as early as October 26th. Vote Republican. Well, that is, if you're proud of America under President Trump.", 'Mike McNiel': 'Ask that question to Israel', 'BW': 'Acosta the bitch', 'tippy dog': 'rump is an ass, him and his crime family are going down', 'MrMistrEnigma': 'Dear Diary...why do I sound so stupid?  When I rehearse these questions after Zucker gives them to me, they sound really, really smart.  Now when I get in front of big bad meanie President he makes me look stupid.\nMy head hurts.\n\nJim', 'Lawnchair Larry': 'TRUMP 2020', 'Debbie Martin': "Jim, go sit down and shut up and stop trying to create a problem where there isn't one.", 'DetroitMuscle313': 'JIM ACOSTA  is a blithering idiot ,a brainless liberal turd 💩', 'HomesliceDrummer': '"You\'re a Nationalist"\n\n"Ya because I love our country! I\'m proud of our country."\n\nBoom!! Suck it Jim Acosta, you little bitch.', 'Manuel Martinez': 'You cut out the best part when he yells NO! at Cuck Acosta earlier on for being a loudmouth', 'Bill Dewahl': 'go home jim', 'Joel Cohen': 'Much love and respect to Trump from Tel Aviv, Israel.', 'Stefan, Esq': 'Jim Acosta raped me in a gay bar after he drugged me. Believe me, you racist bigot', 'Luis Gonzales': 'Why not just reply "Fuck you Jim,  piece of shit!".', 'Buddy Newman': 'Acosta needs to go to a mid eastern country and try to talk to the leader like he does to our President; he would be publicly hanged. And that would be a good thing. FU*K Jim Acosta!!!!', 'TonganDeathGrip': 'Good man Trump. Great man!', 'fortylove68': 'God bless our President! ❤️👍🇺🇸', 'Lee Collins': 'Acosta is a terrible reporter. What an unbelievable question. He should be fired. What an idiot.', 'David Goans': 'Good going Trump', 'Stephanos Zunez': 'Lib owned! Acosta inferior, Trump superior.', 'Jack Shap': 'Nationalist does not mean racist. Racial nationalism is bad.', 'tony jones': 'Jim Acosta is the poorest excuse for a journalist that I have ever seen. Any time he opens his mouth, he swollows his foot. What a jerk.', 'Pedro Nunez': "Business man hell yeah baby .one of the best president ever , United States first that's what I'm talking about .this world is run by business people so let's ride on train for ones the trump train .", 'Strick nine': 'I\'m assuming that even Jim would agree that a black person is capable of being a nationalist...\nWould he refer to them as a "black nationalist" ?\nEthnicity has ZERO to do with Nationalism....It is actually our Presidents JOB to be a nationalist and protect the interests of Americans.', 'Madison A': 'Who, wait, what AMERICAN, can not LOVE Our President Trump? We are so lucky God gave us PRESIDENT DONALD TRUMP!', 'Samuel Field': 'Thank god we have this man!! I love you Mr. President', 'Rafy Colon Hernadez': "I'm Nationalist said President Trump and CNN are traitors.", 'Dennis Anderson': 'Little jimmy boy blue needs to grow a set of his own and stop tossing off to pictures of George Soros.', 'Velasca': 'Dear Diary, orange man racist, orange man bad. He made tears come to my eyes in the White House.', 'raindrops': "Does this dim bulb know that those little accusation games don't work in US? We are the melting pot already. He's calling US Blacks, Asians, Native Americans, Caucasians, Latinos,\xa0all\xa0citizens of America racist if they put their country first before illegals?? Just more bs.", 'Hammer H': "Doesn't matter what color nationalist you are as long as you love your country...so STFU ACOSTA", 'James Evenden': "I'm white and proud. Fuck CNN", 'David Hickey': 'Acosta is the ultimate chickenSHIT..What a punk', 'ryan king': 'Acosta is a tard!'}{'Mike Burt': 'From the UK, best president in my lifetime, maybe of all time.', 'ROBERT NARDONE': 'Acosta needs to get slapped around', 'Andy Gadd': 'CNN offices are best if an earthquake swallows them whole, then slams shut.', 'Joel Sanford': 'Jesus will acosta just go into a cave and disappear . Moron !', 'E. M.': 'CNN = FakeNews', 'Tomas Echevarria': "It means he's NOT a globalist.  And I love him for it.", 'Ted Freddy': 'I wish Jim Acosta would put a dog whistle up his ass and let Don "sweet" Lemon and Wolf Blitzer take turns blowing it.', 'Drew Barber': "Looks like Jim Acosta already watched this video because there's only one dislike", 'Kaboom 214': "I'm surprised this douche has not been punched in the face for disrespecting the president", 'Wayne Oneal': 'Man we are so fortunate to be apart of history..we have the greatest President in the history of our Nation..bar none!!!', 'viking saxon': '// President Trump  Has Worked At The Sharp End Of The Building Industry  And Knows How To Handle This   Sleaze  Bag  Marxist  Controled So Called  Reporter. ,Trumps The Best. !!', 'Ben Cook': "Every time that moron Acosta opens his mouth, it's like an awkward cringe for sensible people. I wonder if he's always been an idiot...or just does it to get ratings. Smh", 'MH PAGAN': 'Jim Acosta is a buttboy for the globalist like Soros!Refreshing the President is helping us to be proud of our national heritage and being  Americans 🇺🇸🇺🇸🇺🇸', 'Buddy Guy': "I love Trump.  I didn't vote at all last election, but Trump has me in 2020.", 'James White': 'Rather be a isolationist nationalist like Trump. Than a globalist traitor.', 'Edwin Zakrzewski Jr': 'Acosta should be banned from the White House he is a stupid liberal leftist who only mission is to destroy Trump and our country', '0O00OO0O00OO0O00OO': 'How on earth can an *American* nationalist be a racist ^_^ ? I stole and edited from Joey Pickles sry & ty', 'Wall Sign': 'LIBERALS BELIEVE WHAT THEY WANT TO BELIEVE.  THEY DECEIVE 👌🏻 THEMSELVES AND THEY DECEIVE OTHERS', 'Oscar Gonzalez': 'A president that makes sense and says it like it is.  Suck on that Acosta!', 'Joshua Petry': 'Get owned yet again jim, how do you still have that job??? Keep it up jim, doing a great job haha lol', 'B Pit': 'Acosta was always the dumbest kid in the class, and very thick headed, refused to keep the pie hole shut.', 'John Johnson': 'hitler jr', 'Amanda Martin': 'Jim Acosta is a national disgrace!', 'Rebecca Allsteadt': 'Acosta you are such a douchebag  ur dumb questions make you look really retarded😣🤐🤐🤐🤐', 'dj ortiz': 'I’m with you President Trump. Just like how you’re with us the American people.', 'S S': 'Jim Acosta, libtard extraordinaire...NEVER gets tired of making an ass out of himself.', 'Thomas Fleig': '"I\'m a nationalist Jim, meaning I put African Americans and Hispanic Americans over white Europeans". That would shut him up', 'Jerry Leal': 'Transfer  Acosta  to the CARTOON network!!!!!!!!!!!!', 'AmericanPatriot2011': 'The political left and elite corporate media find it offensive when our President professes his love and allegiance to our country.\n\nUnbelievable!', 'Mark von Steiner': 'Jim Accoster never fails to amaze me with his DUMB questions. Every time he opens his mouth, I smell his rotten guts.', 'Luis M': 'What was that secret service guy holding in his hand?', 'This And That Facts': 'Thank you Jim Acosta for the racist comment  and showing Trump how racist people really exist such as yourself', 'Toby Bielat': 'Jim acosta is a pickle smoocher, cnn fake news.', 'cr35t23': 'Jim Acosta is a fool.', 'Steven Rago': "A person with a functioning brain wouldn't wake up to Mike Tyson and punch him in the face, they wouldn't challange Jordan to a basketball game for their entire life savings, and they surely wouldn't stand back to back with an expert Marksman, take 15 paces, turn around and draw. So why do these idiotic liberals think that they can stand toe to toe with PRESIDENT TRUMP, and play mind games with him. Nevermind, I just answered my own question, they're idiots, moronic braindead idiots. At least in their stupidity, and brainless liberal blah blah blah, the world gets to stop for a moment while we all laugh at these morons. 👍🇱🇷 RED NOVEMBER 2018 TRUMP/PENCE 2020🇱🇷👍 MAGA", 'Brandon Greenleaf': 'Acosta is the biggest racist out there. I do appreciate our President ignored the race bullshit because he knows it’s gotten old.', 'Jeannie': 'Jim Acosta is a paid actor! He makes bank!!! Sickens me. So overrated and overpaid!!!', 'Five Year Waitlist': 'Nationalists care for their country and put the success of their country first before all others. Every countryman should be a nationalist. And fuck Jim Acosta.', 'BassasaurusRex': 'It’s gotta take a ton of restraint to not yell “fuck off” every single time Acosta opens his stupid assed mouth.', 'H.M. Murdock': 'You know all that President Trump just explained went straight through the thin air between Jim Acosta’s ears. Sad.', 'Ed Johnson': 'When is Acosta going to be arrested?  He dickhead Acosta, when I see you I will have law enforcement by my side and I will make a citizens arrest.  You will go to jail for fraud and treason against the American people and you will be punished to the full extent of the law.  You use the 1st Amendment as a tool to destroy all of your democrat mafia opposition.  This constitutes the absolute worst crime against the American people.  You and all of your cohorts at the Criminal News Network outfit are going to pay the price for your fraud and treason.', 'Manuel': 'Hillary downvoted this video.', 'Foxboro Consulting Group, Inc.': 'That\'s my President taking the British Zionist, CIA  backed main stream media to the "wood shed." I totally love Donald James Trump! JIM Acosta, you have to be a traitor, right?', 'Daniel Malice': "Trump should've pulled his credentials long ago.", 'Edgar Garcia': "He's trying to align nationalist to white supremacist. Nothing wrong with loving your country and trying to make it better.", 'TheGazzMan01': 'Acosta is just a rude, impudent, lying, nasty little dickhead.', 'Kim Siewers': "Acosta the dope gave Mr. Trump an opportunity to make a short speech. President Trump has figured out how to respond to idiotic baiting questions; he simply doesn't really answer them at all :)", 'laura woodward': "AMEN!!! I'm a Nationalist too!!!\n🇺🇸USA🇺🇸USA🇺🇸USA🇺🇸\n🇺🇸🇺🇸🇺🇸MAGA🇺🇸🇺🇸🇺🇸", 'funtoolbar1': 'CNN will always be fake news!!!', 'J Middlefinfer': 'I think that the POTUS and Sarah should go for the next month or so and never call on Acosta or any other CNN "reporter". See how the Clinton News Network likes that.', 'Biting Whale': 'Never go full Jim Acosta', 'S. M.': "Piss on Acosta!  I too am a NATIONALIST and he's a COMMUNIST!", 'Donny Boy': 'Obama had the bend over policy.', 'tattydancer': 'He da boss!!!😁😁', 'Ojibwe Native American': 'Acosta. Dude. POTUS has more intelligence in the clippings from the nail of his left toe- fifth digit (little toe Jim) any day....than you have ever possessed as IQ collectively. Plus he isnt on the very worst of his  days intimidated by YOU !', 'nameinuse22': 'President Trump must have a lot of patience to waste his time talking to Acosta!!!! That guy is dumber than a wet box of rocks and at this point nobody takes him seriously. Actually that sentence pretty much sums up all CNN staff, must be a job requirement.', 'Hunter Ray': 'What a dick to ask a question like that', 'Crimson Twins': "I'm a proud Hispanic American Nationalist.", 'family awareness': "There's no organization any more Racist than CNN", 'C Strange': 'Hell yeah!!!!', 'Shawn FitzGerald': 'Jim Acosta is such a fuckin moron!', 'First Name Last Name': "I completely understand where trump is coming from here. Last year I sported the swastika on a jacket symbolizing good fortune as it meant to the Buddhists. Snowflakes flipped out saying it was a symbol of hate but I told them that I didn't know that and meant it as something completely different. Idk if nationalism has ever meant anything different than it does today but if so, same thing.", 'Drej 101': "Completely indifferent towards President Trump but, how could any American not like what he's saying here? Piece of shit reporter to say a nationalist is a racist......fucking pathetic these days", 'Steven Barnes': "acosta only sees himself in the mirror. he only here's what his worshippers tell him. these days, I have been watching CNN and the others because it has become fun to watch them fighting back the tears. we are in good shape now and in November.\nVOTE VOTE VOTE VOTE VOTE", 'Mike Frank': 'Only mongrels like Acosta hear dog whistles.', 'Antonio Hernandez': 'JIM ACOSTA CHILD RAPIST.😈😈😈😈😈😈😈😈', 'Right to Record': 'Why does anybody even let Acosta ask questions?', 'Lynch Stump Co.': 'MAGA', 'Donna Dockal': 'Acosta is full of himself, he is disgusting piece of crap!', 'Lori Gravelin': 'No we can’t continue the way it’s going.. so will you DIE already?', 'Dnister Dnister': "NOW I'M NATIONALIST TOO!!!   TRUMP - 2020!!!", 'Kaizen': 'Jim Acosta is a drama queen.', 'DuraDigi': "Acosta is full of shit he's a joke.", '1985cjjeeper': 'Sometimes I think Acosta actually works for Trump. He is a golden goose of shame for the democrats.', 'HE DP': 'Jim Acosta....a consistent clown!', 'Ray Bechtel': "Questions like that I hope cnn doesn't  wonders why they have no viewer's anymore.", 'Bob Whalen': 'Acosta needs to  take a dirt nap.', 'Joe Morgan': 'Jim Acosta is a moron from plant dumbass.', 'Xman B': 'Acosta is a short bus window licker  over paid Libtard', 'Isaac Newtonium': 'Oh well ... Acosta is a Cuban-American racist.', 'London Falls': 'All Jim and Democrats do is bring us race. They are the racist! Race is always on thier minds.', 'Raven Strange': 'Jim Acosta is a fucking gutter trash pig', 'OldSchool Mike': "When are they gonna kick that moron out of the white house, he's a disgrace and an embarrassment to this country.", 'SKULL CRUSHER': 'Glad jimmy boy gave Trump a chance to shut up these race baiters. Suck it up buttercup and love your country', 'Tracey R': "Acostas   is  an   A'HOLE  he   is   for   everything  unAmerican.  CNN  and   him  ACOSTAS   shoulds  be  banned/barred  froms   the   White House  and   everything to'do   with  GOVERMENT/ CONGRESS.", 'donkique956': "I'm brown and proud of my country. MAGA!", 'Hippokrates': 'Outstanding answer. I hope CNN and his JC get it.', 'Chance Carlton': 'Seriously, get him out of there. Theres a free press and then there is total ridiculous baiting.', 'Tom S': "Here we go again.  Instead of reporting the news....they're trying to maker the news. start another controversy that like all the others will be disproved and or just fade away", 'Todd McCraven': 'Acosta must be on crack.', 'Michael David': 'Jim Acosta has to cry himself to sleep each night from not being able to control his actions which cause daily embarrassments.', 'MoonGlow': 'Trump loves America, Acosta would sell us out to the first bidder.', 'Travis Heinze': 'Jim probably asked these same questions of Obama. Just routine reporting.', 'Kris Ross': "Orange man bad. Orange man Nazi. Virtue. Virtue. I'm best", 'lucila cosme': 'Acosta is the poison that dividing our country! His query is always to put President Trump down, but he never wins even with Sarah Sanders he appears so pathetic. The more reason his CNN continues its low rating.', 'A E': 'Fuck jim acosta. A monkey can do a better than that fucking piece of shit.', 'J G': 'Little Jimmy needs his face caved in..!!', 'Chainsaw Surgeon': 'What an instigator,'}{'bANoMia': 'CNN going back to the race thing. Same as it ever was', 'Kris Wise': '🇺🇸👌🇺🇸', 'Don’tell Gucci': 'Jim Jimmy you can’t go up against this brilliant President', 'RacistDeplorableRussianBot': 'They say nationalism is terrible but then they praise and love Black Panther, the stupidity is unreal', 'Alex Tilley': 'At first I thought this man is a joke and the lesser of two evils and now....the greatest gosh dang president since the sounding fathers......maybe brush up on your public speaking skills but damn...you say everything I’m thinking!!!!', 'Gretel Glacierl': 'GREAT ECONOMY LOCK THEM UP CRIMINALS ARE ON THE LOOSE ALL OVER THE PLACE WE ARE LOOKING AT THE WORST CIVIL WAR IN HUMAN HISTORY GREAT TRADES  A ROUND OF APPLAUSE THE APPLAUSOMETER IST GONE THROUGH THE ROOF NOW FOR THE REAL ART OF THE DEAL ON INAUGURATION DAY PELONIUS SKUMMY CROOKEDUND ALL THE OTHER MAD DEMS UND SOME MAD REPS ESPECIALLY PENCEFILTH OF BRITFILTH NEEDED TO BE DEAD!!!!!! JUSTICE MUSTV\nALWAYS BE SERVED IN THE JUSTICE DEPARTMENT WE ARE LOWER THAN CHINA THAN BRAZIL ETC TIME FOR THE ACCOUNTABILITY FROM THE EVIL YEARS OF 2008 - 2016 PREPOSTEROUS MAD AKA MUELLER IST A COMMON CRIMINAL A TRAITOR INFILTRATOR WHEREVER THESE MORONS ARE FRM ITS LIKE ASKING THE BOSTON STRANGLER TO PROSECUTE HIS VERY OWN CRIMES IST THIS A NOT VERY FUNNY JOKE IST THERE ANYONE ALIVE IN NORTH WHITE AMERICA WHERE IST ROOSEVELT HE WOULD TAKE THE RIGHT ACTIONS ACCOSTED THE BEST DRESSED REPORTER I EVER SAW NEEDS TO BE DEAD ALL CNN FBI CIA FIVE EYES OF RUBBISH UND PAEDOPHILIC INFILTRATOR OF BRITFILTH NEEDS TO BE DEAD WAY BEFORE YESTERDAY!!!!', 'Airmanc5B Flyhigh': 'Acosta needs the crap beat out of him, Its time to take him down', 'Wayne Crabtree': "I'm glad that we have a President that thinks of his own country first and put the interest of his own people first. These other countries have been taking advantage of use for to long. Time to pay the piper. If these other countries want our Products and protection then they need to start paying their far share for it, and not left for the American people pick up the tab. And the same goes for the illegal immigrants that invade our country. We get to choose who comes in to our country .dont come here thinking your entitled to be here....your not. If you want to be here, you go through the port of entry and wait in line like millions of other people that done it before you.", 'proslice56': "So yeah! Sonny Jim, what the president said in your dumb down way of understanding is: I'm tired of other countries sucking the life blood out of our country then shiting on us.", 'James Excell': 'Zero dislikes.  ...this video must be good. Lol', 'ScottD': "President, Trump is a breath of fresh air.  It's again OK to be a nationalist.  Fair and reciprocal trade via nation to nation bi-lateral negotiation.  Works for all Americans.  WWG1WGA", 'chau nguyen': 'Trump needs to ask and pretty much "force" these fake news people to say they understand and agree, or explain', 'dangerfield entertainment': "Keep trying Jim, you're the poster boy for Main Stream Media!", 'general mayhem': "Pretty simple concepts to badd college educated Talking Heads can't seem to grasp them", 'Marilee Stetson': 'Acosta embarrasses himself every time he opens his mouth.', 'Tiggs': 'White nationalism is needed. We are a global minority and our genocide in in swing via the Kalgari plan. Our own people are pushing this with the full support of (((them))). We need to take our countries back. Our generosity towards others has been exploited and abused, and we will destroy ourselves if something is not done.\nPeople like acosta need to be shot', 'Shred Well': 'THIS IS MY PRESIDENT. \nGOD BLESS PRESIDENT DONALD J. TRUMP, AMERICAN.', 'Blackfoot Indian Bigfoot': 'Ghandi was a nationalist.', 'Fefifofum JACOBSON': 'Who could argue with that', 'Earthly Tag': 'Goat', 'Michael Wallace': 'Thanks for TRUMP now for Jim who give a shit about that stupid ass hole .', 'James Madison': 'Acosta...pure punk.', 'David Rhodes': 'Why is he still allowed in ?', 'Benjamin Allan-Clark': "And you're a globalist. So there. Dog whistle boy!", 'Luis Avila': 'Of course acosta would say that shit', 'Josh Christian': 'Acosta may be Satan', 'Absaalookemensch': 'America is a Nationalist as every country is.\nAcosta and Liberals are Globalists.  They want to force socialism on the world and drive the world into poverty.\nTrump is a Nationalist who wants to drive the nation and the world into prosperity.\nTo get ahead, vote RED.', 'Skyclad Observer': "I don't know how Trump doesn't kick this piece of shit Acosta out after hearing garbage like that. Major props for such a respectful answer to such a disrespectful question", 'Marilyn Davis': 'Trump loves the USA - our NATION! Got it Acosta? Our Country! Our Nation! He’s a Nationalist! CNN = Clinton News Network. Needs to be off the air!', 'Interest in old school': 'jim acosta,  White Male, Hispanic origin, what a tool bag that turd is....smh, keep bringing those ratings down, little man!', 'zara marland': 'To right Trump!!!', 'kevin pratt': 'With President Trump the stupidest guy from CNN can ask the stupidest question about dog whistles and he turns it around to a foreign policy statement furthering his negotiations with Europe and China which they will hear loud and clear.  The guy never stops working advancing the American cause!', 'Jasmine Love': 'Doesn’t dummy get tired of getting humiliated!  By our President 😂😂😂He said nationalist and that’s suppose to b a secret code! Y can’t all these libtards rent themselves a caravan and move to another country since he doesn’t appreciate America 🙈Think secretly Acosta wants to close b to Trump 🙈😂😂😂 wtf and he’s a journalist! Ship 🚢 him away already', 'BUILD THE WALL': '*MAKE LIBERALS CRY AGAIN TRUMP 2020*', 'Bobby Deery': "NO MATTER WHAT YOU SAY MR. PRESIDENT...FROM NOW ON THE PRESS IS GOING TO ADD THAT YOU SAID WHITE MAN WHENEVER YOU SOEAK ...LOL...STOP FEKN TAKING QUESTIONS FROM JIM ACOSTA ...HE'S A SCHILL...NOTHING MORE !!!", 'Rosa Franco': 'Poor fool Acosta,he should have known better!', 'Sticky sweets': 'That was a major burnnn !!', 'Dontlie Tome': 'Only Jimmy acucksta....', 'Tom Satterly': 'Everyone knows racism is a crime, and crime is for black people 🖕', 'The Last Call': 'Despicable journalism.', 'Noam Pitlik': 'Leave it to cnn to make every damn comment the man makes about race or Russia.', 'Kman': 'At this time 4.7K views, 598 thumbs up amd NO thumbs down! Amazing! MAGA!', 'Johnpaul Kane': "Donald Trump is a man's man not afraid to lead by example he does not apologize for U S greatness he emphasizes it only mentally Disturbed and man bun Brigade don't understand his greatness", 'Carl Hursh': 'Acosta needs to find a new career!', 'Wendy Hrabowy': "The Democrats don't give a crap about our country because if they did they would want to send the people on the border back they don't care about the regular American having a job vote Republican Trump in Trump in 2018 he cares", 'Burial': 'What an absolutely moronic, disrespectful, sensationalistic question... shameful really, to ask a sitting president a question like that.', 'Jason Chicoine': 'Trump is so calm  id kick that asscosta in his assface pronto', 'Trump2020 MAGA': 'Spartacus Acosta. He is an asshole plain and simple.', 'Sara Dixon': 'Dog whistle?? Who are the dogs Jim??', 'Swee Suri': 'God bless Donald J Trump President of the United States of America', 'Mickey Andres': 'Acosta is a complete moron, he’s not even a little suspicious of it 😂', 'strange times': 'Always the race card. CNN the racebaiters of the world. If you love America, you MUST be a racist. If you like lower taxes, it MUST be because you are a racist. If you prefer peace and prosperity to grinding poverty and enslavement to the central banks, it can ONLY be due to your racism. If you prefer not to trip over human crap and dirty needles in the streets, you are OBVIOUSLY a racist. If you do not want this country invaded by millions of criminals, you are motivated PURELY by hatred for other races.', 'r2blank2': 'Eat shit, Acosta!', 'Super Cat': 'Little Jimmy is learning about  colors in school this week. Atta boy jim.', 'Taaa J': 'Why has someone not beat the ever living piss out of Acosta yet?', 'Kitty Watson': 'JIM ACOSTA....I am a former freedom rider and I am also a Nationalist. My Black Family and Friends ARE PART OF OUR LIVES, NEIGHBORHOOD AND DUH...NATION!  \nACOSTA...YOU ARE THE BIGOT! STOP TRYING TO SEPARATE US!!!!!', 'John Doll': 'We need Jim Acosta around to remind us how hateful and disgusting the MSM is.  Keep up the good work Jim.', 'efc toffee': 'Hahaha you tell em Trump.', 'The Arachnofiles Basement': 'A dog whistle, what a fucking retard', 'Stephen Dmyterko': 'JIM ACOSTA IS AN ASS HOLE.  HE IS THE LEADER OF FAKE NEWS!!!!!', 'Brent Addie': 'Jim Acosta is a soy boy beta cuck', 'Antisocialist': 'John 2:15 Love not the world, neither the things that are in the world. If any man love the world, the love of the Father is not in him. KJV Bible', 'Brian Mahoney': 'Acosta is a tool ......Acosta "there is a concern that you are sending coded language or a dog whistle".......BY WHO????????   ACOSTA???????', 'BlackPhillip': '*Jim Acosta* should be the news correspondent for the *Saudi Consulate* in Turkey.', 'Angry Scotsman': 'Acosta is a fool.  Who watches cnn anyway....death the the msm let them all go under', 'Subtractive Email': 'And they call us the conspiracy theorists!?', 'nameisscorpion': '"there is a concern that you are sending coded language"  hmmm... where did that concern come from?  THE MEDIA YOU FUCKING MORON!', 'R S': 'Well, that makes me one!', 'Kent Maisano': 'The Saxon raises his battle axe', 'Watogo': 'Jim Acosta CNNT', 'Matt Higgins': 'Jim Acosta is NOT a reporter!', 'Suzie Paris': 'WHY..is Acosta allowed in there..why', 'Matthew Long': 'This country is made up of all kinds of people. Being a nationalist here would mean loving all races, yeah?', 'Isabel Martinez': 'Were did he get his degree i will not send my kids there .he is an idiot', 'John Clifton': 'If Acosta’s brains were dynamite he couldn’t blow his ears off', 'Christine Madrazo': "Acosta has the worst breath. I'm totally serious. It's disgusting.", 'Billy Joe': "Man him Acosta you're a fucking idiot.", 'Lil- -Mo': 'Jimmy Accost everyone on the right Acosta- I think Van Jones just called your name, he’s ready for nightly but love sessions! Good luck!', 'sherrcon': 'DT sending out coded language or dog whistle???...Acosta, you are nuts!', 'Mary Poppins': "HOW THE HELL DOES THIS POS ACOSTA GET INTO THE WHITE HOUSE?? DAMN, WHAT'S THAT ABOUT COMMON SENSE? ??", 'Ly Huy': 'Jim still working??', 'gerard henry': 'Acosta is a race baiter', 'Ramon Herrera': "You can't disagree with Ol' Jimmy!  That's RACIST!    LOL", 'JohnConnor333': 'We live in an amazing time where the silent majority are not longer silent.   Thank you President Trump.', 'Wes McGee': 'Suck on that Accoster.', 'NastyAxis0111': 'MOTHER FUCK CNN, JIM ACOSTA, THE STATE OF CALIFORNIA, AND COMMUNISTS.', 'Baldi Locks': 'Owned him? Lol', 'Dreaming Life': 'Jim reading from his NPC script.', 'Thomas Fletcher': "Acosta is jealous that he is not white .  He's more like a taupe  !", 'Robert Warner': 'cry baby acosta, lock it up', 'Russell Troost': 'Crushed It! Fake News trying to twist his words take that CNN.', 'NPC #14086661408': 'acosta man is good', 'VOLT ZORO': "*Mueller, YOU are the next contestant on the Reality Show MAGA.*\nPlease stop this man from starting WW3 or worse, a Civil War!!!\nHis people don't see that Trump is taking the SAME steps Hitler took in becoming an UNQUESTABLE RULER."}{'Big Buck': 'AMERICANS BETTER WAKE UP!!!! DIMMIS WANNA HAVE A ONE WORLD 🌎 ORDER!!!! NOTICE THIS GREAT POTUS HASN’ T MENTION NWO \nNEW WORLD ORDER!!!\n\nPLEASE SAVE AMERICA FOR AS LONG AS YOU CAN MR PRESIDENT!!!!', 'David Linihan': 'The White House can pull his credentials. CNN will just have to assign a new correspondent', 'nuvigroovi': 'Acosta lives for the gotcha question and not the truth.', 'Michael Olson': 'Trump has better ratings than CNN', 'Tadd Mason': 'His press credentials should be pulled immediately', 'Lloyd Christmas': 'Coded words? Wtfw..jim acosta is retarded..cnn hires the worst humans', 'River Willow': 'Ghandi was a nationalist', 'Books and Records': "336 likes and 0 dislikes... That's a good sign", 'Shyhalu': 'Sir....we heard you claim you love your country!  This is a problem.....   /liberal', 'J Adams': 'CNN is garbage.', 'Anton Monteleonus': 'You really think the clown 🤡 understood that?', 'MrSILVERADO53': 'I am a nationalist!', 'kyle brooks': 'And still people would replace Trump with Obama. Some people’s kids. Wow good for us and America with trump', 'William Bowman': 'Little Jimmie is demturd', 'Surfer 10': 'Ji Acosta has to be the biggest Idiot on the WH press core. Why is he still on that core is beyond me. Also, he (Jim Acosta) is fruity.', 'Keller Kniffing': 'No dislikes currently (:', 'El Shanks': 'Showing that he can throw the politics aside, cut through all the bullshit. This is why he won the presidency.', 'Bruce Wilson': 'Jim is like a lot of us.......we can’t stand Donald.', 'Garnett Hamlin': 'J.A. what a schlameel !', 'R Watson': 'this why CNN is hated and considered Fake news ,asking gotcha questions that has no barring on America.', 'Decriminalize Darwinism': 'Jim is a traitor. He should be hung and whipped to death.', 'Dan -Horsenwelles- Williams': "4% for NATO.\n\nwe pay for an outsourced european group that gives our country nothing in return.\n\nwe can establish all the outsourced country investments we want to without the UN or EU or NATO approval as long as it respects onshore treaties and the international trader has the goods/service to complete the transactions.\n\ni'm appalled we have not lowered our federal reserve usages in international spending on dumb policy groups that don't accurately support any of the representing countries' economies or military welfare.", 'jim hydle': "How  does Jim manage to talk with O's dick till in his mouth?", 'charlielondon72': 'THANK YOU PRESIDENT TRUMP THEY HAVE DESTROYED EUROPE I FEEL SO SORRY FOR THE BETRAYED PEOPLES OF EUROPE WHOS GRANDFATERS DIED TO FREE THEM FROM HITLER AND NOW THEIR GRANDCHILDREN ARE BEING PERCECUTED GANG RAPED CALLED RACIST BY MUSLIMS BLACKS WHO ARE 2 3 GENARATIONS WHERE THE NATIVES HAVE BEEN THEIR FOR A THUSAND YEARS THEY ARE CULTRALLY GENOCIDEDING THE WHITE RACE ITS SICK AND THE EU AND UK ARE PUSHING THIS AGENDER SIDING WITH THE MMIGRANTS ITS SO SICK SATANIC BUT IT WOULD BE WOULDNT IT', 'rae1957tn': 'God Bless our President!  And he’s NOT a racist!', 'Martin Balgavui': 'Cant CNN find an assignment for asscosta in Saudi Arabia?', 'JJ Says': 'Hey Jim, only a dog can hear dog whistles...', 'krejdloc': 'TRUMP HAS A BETTER IDEA.\n\nNow that would make a great bumper sticker.', 'Marshall Rosen': 'Jim Acosta was the kind of guy that the bullies in his High School would lift him up and hang him by his underwear on his locker door during gym class, leaving him there with a wedgie while he screamed for help. He is such a douchebag.', 'ihategooglespooks': "haha thanks for the t-ball question for President Trump there, Jim Accoster... you couldn't have made that easier for him if you tried, that was some _weak sauce_ journalism there... and President Trump is absolutely correct, that _is_ the definition of a nationalist", 'Atom-Phyr': 'Accosting Acosta starring President Trump.', 'yea bouy': 'Every time Jim Acosta opens his mouth he sounds like a fucking idiot', 'oginaz': 'Acosta is the absolute worst actor on TV. He has no clue what he is talking about, but is overly willing to put it on display for all to see.', 'miss marple': 'trying to paint trump as a white nationalist incredible! cnn will say anything to tarnish trump ! fake news again ! bravo bunch of clowns ! these so called journalists definitely need at least 3 or 4 years in college to learn english !', 'Troy Ramsier': "Trump should have taken Nancy Pelosi's advice and not be civil.  Great Big Smile !!!", 'Mona Callender': 'Acosta I’m sorry is just plain stupid', 'Yama Kazoo': 'hahah Jim "the joke" Acosta. 100% plonker & tool', 'F1ach': 'Why the fuck does he bother with that prick Acosta, just tell him m to STFU and GTFO !', 'Jason Webster': "Nationalist - a member of a political group advocating or fighting for national independence, a strong national government, etc.\n\nOnly Acosta could find a way to put racism into this. He's such a douchebag. Glad Trump kept his cool", 'Ax Bx': 'Jim Acosta is a flipping RETARD', 'NotOver2012': 'What a jerk!', 'Niccolo Machiavelli': 'Every time Acosta opens his mouth, and then subsequently gets destroyed by our President, the Republican Party gains another vote! Hahaha', 'Kevin jones': 'That Jim Acosta is one big pile of walking dog shit!!!!!  Where was his fucking ass asking questions to that other piece of shit Obama about his ties to Rev. Wright and Louis Farrakhan?!', 'Betsy Ross': 'I think it’s incredibly mean how the left makes up stuff to frame President Trump as being racist, sexist, etc.\nI’m grateful Trump is strong and doesn’t let this crap get him down.', 'Jerry De Leon': 'Acosta, you are a dumbass. Cubano de mierda, eres maricon', 'S J': 'WTF!!! That fkn scumbag jim acosta doesnt even deserve a reply to a racist backhanded question like that!! Wow, just .....Wow what a low-life!! Why is that liar scumbag even allowed to be there!!??', 'David Eide': "Jim Acosta needs to be let go(fired), He always trys to put his own words/twists into a story to make him sound or look like a big reporter. From what I have seen in his reporting, I have yet to see/hear any newsworthy topics or the TRUTH covered honestly! Go back to school and try to be an honest reporter!'....................MAGA", 'Dhionis Tartari': "A national socialist is a leftist who believes the state can control every aspect of society.\n\nA nationalist touts his country's strengths: their people.", 'Young Blood': 'Acosta makes things up as he goes.......he hides his own criminal behavior.', 'MrGenedancingmachine': 'Stick the dog whistle up your ass Jim and see if it blows...', 'NPC #5684813': 'CNN is the enemy of the people.', 'Tina Arko': 'Acosta is an embarrassment.', 'Candi Archibald': 'Jim Jim Jim. You are such a fool!', 'Daniel Garnett': 'And let me guess.  The answer isn’t good enough for CNN.', 'Mary Robinson': 'Jim embarrasses himself every time he opens his mouth. Well said POTUS!!', 'NPC MOD# HAL9000 SER#THX1138': 'Nazi', "Phish N' Chimps": 'And yet, being a Socialist is OK.', 'Wendell': 'Nationalism in it\'s purest form is good. Every country has some form of nationalism. You should be in favor of the best interests of your own country. When did this become a bad thing or a "dog whistle?" We should really begin putting the Dems in their place whenever they push this overused epithet rolodex. It\'s really annoying and is merely an attempt to shut off proper discourse and solutions. I usually either show them the intellectual exit or ignore them completely.', 'Xander Britt': '& were proud of you POTUS🇺🇸🥋', 'N Odak': 'President Trump speaks facts regardless of the baiting, moronic questions.  ❤️ 🇺🇸', 'Tex Willer': 'Jim Acosta gets dumber by the hour!', 'Hhh Hhh': 'Nationalist V traitor', 'Heisenberg': 'I fucking love this man... stamina, charisma, energy, determination, strong will,... Where have you been hiding for all these years, Don⁉', 'PIGGY WIGGY': 'Acosta really really hates trump', 'Titan12': 'CNN is #1 in RACE BAITING', 'TheTallhillbilly': 'Trump was way more respectful than he should have been...lol', 'Mortiky Jones': 'typical of that ass wipe Acosta to bring in the race card with his question..  white nationalist.', 'Teri Badeau': 'Acosta is a despicable idiot!!  In such need of attention!!  Any way he can get it!!  His mommy must have treated him horribly!!  He has such a need to be important!!  He makes people (who know the “real truth”)  want to puke \U0001f92e\n\nDear Jimmy,  sorry you really aren’t as cute or smart as you think,  actually you are quite nauseating!!  Clearly,  you must be going down with the filth from the deep-state!  Nice try,  but we can see why your mommy didn’t like you!!  \nDon’t forget,  our POTUS really does have the evidence!  And we really will see the proof!!  Sleep well!  Tick Tock', 'Greater America': "I'm white, and I'm an American Nationalist.", 'Joey Pickles': 'How on earth can a nationalist be a racist ! , yet more BS from CNN', 'Ajay Rife': 'I told my coworker that trump called himself a nationalist to bait MSM into doing exactly what Acosta did: immediately assume a DOGWHISTLE to white nationalist and again attempt the racist angle. TRUMP will use their own buzzword faux outrage tactics to reveal their childishness.', 'Yootjoob': 'OMG when will jimmy stop with his BS.', 'Misty Loveless': 'I hope he does something about these insurance companies the doctors write you a prescription you cannot afford it so you go back to the Dr and they write you another one and now you’re allergic to that one and then the one after that toSo now you’re stuck with nothing', 'caesarmtnmama': 'Give it up, Acosta.  Huh?  A nationalist?  This is a me-too moment.', 'Matt Miles': 'LMFAO I got an impeach Trump ad for this.', 'Leigh Barry': 'I remember when AMERICA was seen as the leaders in technology😳 then around15+ years ago we fell off the train and China started driving it BuuuUUUuuuT NOT anymore and Jim Acosta and his handlers KNOW THAT!!!!   Yuppers has them ALLL terrified and most NORMAL Americans ecstatic!🇺🇸💚😘', 'the great douchebag douchbag': 'Jim acosta is an idiot and has the brains of crossing the sea to get to the ocean.', 'Jason Shepherd': 'Wow what a tool', 'Jackson Nielsen': 'Could you imagine being Jim Acosta and unironically asking questions like that?'}{'Big Buck': 'AMERICANS BETTER WAKE UP!!!! DIMMIS WANNA HAVE A ONE WORLD 🌎 ORDER!!!! NOTICE THIS GREAT POTUS HASN’ T MENTION NWO \nNEW WORLD ORDER!!!\n\nPLEASE SAVE AMERICA FOR AS LONG AS YOU CAN MR PRESIDENT!!!!', 'David Linihan': 'The White House can pull his credentials. CNN will just have to assign a new correspondent', 'nuvigroovi': 'Acosta lives for the gotcha question and not the truth.', 'Michael Olson': 'Trump has better ratings than CNN', 'Tadd Mason': 'His press credentials should be pulled immediately', 'Lloyd Christmas': 'Coded words? Wtfw..jim acosta is retarded..cnn hires the worst humans', 'River Willow': 'Ghandi was a nationalist', 'Books and Records': "336 likes and 0 dislikes... That's a good sign", 'Shyhalu': 'Sir....we heard you claim you love your country!  This is a problem.....   /liberal', 'J Adams': 'CNN is garbage.', 'Anton Monteleonus': 'You really think the clown 🤡 understood that?', 'MrSILVERADO53': 'I am a nationalist!', 'kyle brooks': 'And still people would replace Trump with Obama. Some people’s kids. Wow good for us and America with trump', 'William Bowman': 'Little Jimmie is demturd', 'Surfer 10': 'Ji Acosta has to be the biggest Idiot on the WH press core. Why is he still on that core is beyond me. Also, he (Jim Acosta) is fruity.', 'Keller Kniffing': 'No dislikes currently (:', 'El Shanks': 'Showing that he can throw the politics aside, cut through all the bullshit. This is why he won the presidency.', 'Bruce Wilson': 'Jim is like a lot of us.......we can’t stand Donald.', 'Garnett Hamlin': 'J.A. what a schlameel !', 'R Watson': 'this why CNN is hated and considered Fake news ,asking gotcha questions that has no barring on America.', 'Decriminalize Darwinism': 'Jim is a traitor. He should be hung and whipped to death.', 'Dan -Horsenwelles- Williams': "4% for NATO.\n\nwe pay for an outsourced european group that gives our country nothing in return.\n\nwe can establish all the outsourced country investments we want to without the UN or EU or NATO approval as long as it respects onshore treaties and the international trader has the goods/service to complete the transactions.\n\ni'm appalled we have not lowered our federal reserve usages in international spending on dumb policy groups that don't accurately support any of the representing countries' economies or military welfare.", 'jim hydle': "How  does Jim manage to talk with O's dick till in his mouth?", 'charlielondon72': 'THANK YOU PRESIDENT TRUMP THEY HAVE DESTROYED EUROPE I FEEL SO SORRY FOR THE BETRAYED PEOPLES OF EUROPE WHOS GRANDFATERS DIED TO FREE THEM FROM HITLER AND NOW THEIR GRANDCHILDREN ARE BEING PERCECUTED GANG RAPED CALLED RACIST BY MUSLIMS BLACKS WHO ARE 2 3 GENARATIONS WHERE THE NATIVES HAVE BEEN THEIR FOR A THUSAND YEARS THEY ARE CULTRALLY GENOCIDEDING THE WHITE RACE ITS SICK AND THE EU AND UK ARE PUSHING THIS AGENDER SIDING WITH THE MMIGRANTS ITS SO SICK SATANIC BUT IT WOULD BE WOULDNT IT', 'rae1957tn': 'God Bless our President!  And he’s NOT a racist!', 'Martin Balgavui': 'Cant CNN find an assignment for asscosta in Saudi Arabia?', 'JJ Says': 'Hey Jim, only a dog can hear dog whistles...', 'krejdloc': 'TRUMP HAS A BETTER IDEA.\n\nNow that would make a great bumper sticker.', 'Marshall Rosen': 'Jim Acosta was the kind of guy that the bullies in his High School would lift him up and hang him by his underwear on his locker door during gym class, leaving him there with a wedgie while he screamed for help. He is such a douchebag.', 'ihategooglespooks': "haha thanks for the t-ball question for President Trump there, Jim Accoster... you couldn't have made that easier for him if you tried, that was some _weak sauce_ journalism there... and President Trump is absolutely correct, that _is_ the definition of a nationalist", 'Atom-Phyr': 'Accosting Acosta starring President Trump.', 'yea bouy': 'Every time Jim Acosta opens his mouth he sounds like a fucking idiot', 'oginaz': 'Acosta is the absolute worst actor on TV. He has no clue what he is talking about, but is overly willing to put it on display for all to see.', 'miss marple': 'trying to paint trump as a white nationalist incredible! cnn will say anything to tarnish trump ! fake news again ! bravo bunch of clowns ! these so called journalists definitely need at least 3 or 4 years in college to learn english !', 'Troy Ramsier': "Trump should have taken Nancy Pelosi's advice and not be civil.  Great Big Smile !!!", 'Mona Callender': 'Acosta I’m sorry is just plain stupid', 'Yama Kazoo': 'hahah Jim "the joke" Acosta. 100% plonker & tool', 'F1ach': 'Why the fuck does he bother with that prick Acosta, just tell him m to STFU and GTFO !', 'Jason Webster': "Nationalist - a member of a political group advocating or fighting for national independence, a strong national government, etc.\n\nOnly Acosta could find a way to put racism into this. He's such a douchebag. Glad Trump kept his cool", 'Ax Bx': 'Jim Acosta is a flipping RETARD', 'NotOver2012': 'What a jerk!', 'Niccolo Machiavelli': 'Every time Acosta opens his mouth, and then subsequently gets destroyed by our President, the Republican Party gains another vote! Hahaha', 'Kevin jones': 'That Jim Acosta is one big pile of walking dog shit!!!!!  Where was his fucking ass asking questions to that other piece of shit Obama about his ties to Rev. Wright and Louis Farrakhan?!', 'Betsy Ross': 'I think it’s incredibly mean how the left makes up stuff to frame President Trump as being racist, sexist, etc.\nI’m grateful Trump is strong and doesn’t let this crap get him down.', 'Jerry De Leon': 'Acosta, you are a dumbass. Cubano de mierda, eres maricon', 'S J': 'WTF!!! That fkn scumbag jim acosta doesnt even deserve a reply to a racist backhanded question like that!! Wow, just .....Wow what a low-life!! Why is that liar scumbag even allowed to be there!!??', 'David Eide': "Jim Acosta needs to be let go(fired), He always trys to put his own words/twists into a story to make him sound or look like a big reporter. From what I have seen in his reporting, I have yet to see/hear any newsworthy topics or the TRUTH covered honestly! Go back to school and try to be an honest reporter!'....................MAGA", 'Dhionis Tartari': "A national socialist is a leftist who believes the state can control every aspect of society.\n\nA nationalist touts his country's strengths: their people.", 'Young Blood': 'Acosta makes things up as he goes.......he hides his own criminal behavior.', 'MrGenedancingmachine': 'Stick the dog whistle up your ass Jim and see if it blows...', 'NPC #5684813': 'CNN is the enemy of the people.', 'Tina Arko': 'Acosta is an embarrassment.', 'Candi Archibald': 'Jim Jim Jim. You are such a fool!', 'Daniel Garnett': 'And let me guess.  The answer isn’t good enough for CNN.', 'Mary Robinson': 'Jim embarrasses himself every time he opens his mouth. Well said POTUS!!', 'NPC MOD# HAL9000 SER#THX1138': 'Nazi', "Phish N' Chimps": 'And yet, being a Socialist is OK.', 'Wendell': 'Nationalism in it\'s purest form is good. Every country has some form of nationalism. You should be in favor of the best interests of your own country. When did this become a bad thing or a "dog whistle?" We should really begin putting the Dems in their place whenever they push this overused epithet rolodex. It\'s really annoying and is merely an attempt to shut off proper discourse and solutions. I usually either show them the intellectual exit or ignore them completely.', 'Xander Britt': '& were proud of you POTUS🇺🇸🥋', 'N Odak': 'President Trump speaks facts regardless of the baiting, moronic questions.  ❤️ 🇺🇸', 'Tex Willer': 'Jim Acosta gets dumber by the hour!', 'Hhh Hhh': 'Nationalist V traitor', 'Heisenberg': 'I fucking love this man... stamina, charisma, energy, determination, strong will,... Where have you been hiding for all these years, Don⁉', 'PIGGY WIGGY': 'Acosta really really hates trump', 'Titan12': 'CNN is #1 in RACE BAITING', 'TheTallhillbilly': 'Trump was way more respectful than he should have been...lol', 'Mortiky Jones': 'typical of that ass wipe Acosta to bring in the race card with his question..  white nationalist.', 'Teri Badeau': 'Acosta is a despicable idiot!!  In such need of attention!!  Any way he can get it!!  His mommy must have treated him horribly!!  He has such a need to be important!!  He makes people (who know the “real truth”)  want to puke \U0001f92e\n\nDear Jimmy,  sorry you really aren’t as cute or smart as you think,  actually you are quite nauseating!!  Clearly,  you must be going down with the filth from the deep-state!  Nice try,  but we can see why your mommy didn’t like you!!  \nDon’t forget,  our POTUS really does have the evidence!  And we really will see the proof!!  Sleep well!  Tick Tock', 'Greater America': "I'm white, and I'm an American Nationalist.", 'Joey Pickles': 'How on earth can a nationalist be a racist ! , yet more BS from CNN', 'Ajay Rife': 'I told my coworker that trump called himself a nationalist to bait MSM into doing exactly what Acosta did: immediately assume a DOGWHISTLE to white nationalist and again attempt the racist angle. TRUMP will use their own buzzword faux outrage tactics to reveal their childishness.', 'Yootjoob': 'OMG when will jimmy stop with his BS.', 'Misty Loveless': 'I hope he does something about these insurance companies the doctors write you a prescription you cannot afford it so you go back to the Dr and they write you another one and now you’re allergic to that one and then the one after that toSo now you’re stuck with nothing', 'caesarmtnmama': 'Give it up, Acosta.  Huh?  A nationalist?  This is a me-too moment.', 'Matt Miles': 'LMFAO I got an impeach Trump ad for this.', 'Leigh Barry': 'I remember when AMERICA was seen as the leaders in technology😳 then around15+ years ago we fell off the train and China started driving it BuuuUUUuuuT NOT anymore and Jim Acosta and his handlers KNOW THAT!!!!   Yuppers has them ALLL terrified and most NORMAL Americans ecstatic!🇺🇸💚😘', 'the great douchebag douchbag': 'Jim acosta is an idiot and has the brains of crossing the sea to get to the ocean.', 'Jason Shepherd': 'Wow what a tool', 'Jackson Nielsen': 'Could you imagine being Jim Acosta and unironically asking questions like that?'}{'Big Buck': 'AMERICANS BETTER WAKE UP!!!! DIMMIS WANNA HAVE A ONE WORLD 🌎 ORDER!!!! NOTICE THIS GREAT POTUS HASN’ T MENTION NWO \nNEW WORLD ORDER!!!\n\nPLEASE SAVE AMERICA FOR AS LONG AS YOU CAN MR PRESIDENT!!!!', 'David Linihan': 'The White House can pull his credentials. CNN will just have to assign a new correspondent', 'nuvigroovi': 'Acosta lives for the gotcha question and not the truth.', 'Michael Olson': 'Trump has better ratings than CNN', 'Tadd Mason': 'His press credentials should be pulled immediately', 'Lloyd Christmas': 'Coded words? Wtfw..jim acosta is retarded..cnn hires the worst humans', 'River Willow': 'Ghandi was a nationalist', 'Books and Records': "336 likes and 0 dislikes... That's a good sign", 'Shyhalu': 'Sir....we heard you claim you love your country!  This is a problem.....   /liberal', 'J Adams': 'CNN is garbage.', 'Anton Monteleonus': 'You really think the clown 🤡 understood that?', 'MrSILVERADO53': 'I am a nationalist!', 'kyle brooks': 'And still people would replace Trump with Obama. Some people’s kids. Wow good for us and America with trump', 'William Bowman': 'Little Jimmie is demturd', 'Surfer 10': 'Ji Acosta has to be the biggest Idiot on the WH press core. Why is he still on that core is beyond me. Also, he (Jim Acosta) is fruity.', 'Keller Kniffing': 'No dislikes currently (:', 'El Shanks': 'Showing that he can throw the politics aside, cut through all the bullshit. This is why he won the presidency.', 'Bruce Wilson': 'Jim is like a lot of us.......we can’t stand Donald.', 'Garnett Hamlin': 'J.A. what a schlameel !', 'R Watson': 'this why CNN is hated and considered Fake news ,asking gotcha questions that has no barring on America.', 'Decriminalize Darwinism': 'Jim is a traitor. He should be hung and whipped to death.', 'Dan -Horsenwelles- Williams': "4% for NATO.\n\nwe pay for an outsourced european group that gives our country nothing in return.\n\nwe can establish all the outsourced country investments we want to without the UN or EU or NATO approval as long as it respects onshore treaties and the international trader has the goods/service to complete the transactions.\n\ni'm appalled we have not lowered our federal reserve usages in international spending on dumb policy groups that don't accurately support any of the representing countries' economies or military welfare.", 'jim hydle': "How  does Jim manage to talk with O's dick till in his mouth?", 'charlielondon72': 'THANK YOU PRESIDENT TRUMP THEY HAVE DESTROYED EUROPE I FEEL SO SORRY FOR THE BETRAYED PEOPLES OF EUROPE WHOS GRANDFATERS DIED TO FREE THEM FROM HITLER AND NOW THEIR GRANDCHILDREN ARE BEING PERCECUTED GANG RAPED CALLED RACIST BY MUSLIMS BLACKS WHO ARE 2 3 GENARATIONS WHERE THE NATIVES HAVE BEEN THEIR FOR A THUSAND YEARS THEY ARE CULTRALLY GENOCIDEDING THE WHITE RACE ITS SICK AND THE EU AND UK ARE PUSHING THIS AGENDER SIDING WITH THE MMIGRANTS ITS SO SICK SATANIC BUT IT WOULD BE WOULDNT IT', 'rae1957tn': 'God Bless our President!  And he’s NOT a racist!', 'Martin Balgavui': 'Cant CNN find an assignment for asscosta in Saudi Arabia?', 'JJ Says': 'Hey Jim, only a dog can hear dog whistles...', 'krejdloc': 'TRUMP HAS A BETTER IDEA.\n\nNow that would make a great bumper sticker.', 'Marshall Rosen': 'Jim Acosta was the kind of guy that the bullies in his High School would lift him up and hang him by his underwear on his locker door during gym class, leaving him there with a wedgie while he screamed for help. He is such a douchebag.', 'ihategooglespooks': "haha thanks for the t-ball question for President Trump there, Jim Accoster... you couldn't have made that easier for him if you tried, that was some _weak sauce_ journalism there... and President Trump is absolutely correct, that _is_ the definition of a nationalist", 'Atom-Phyr': 'Accosting Acosta starring President Trump.', 'yea bouy': 'Every time Jim Acosta opens his mouth he sounds like a fucking idiot', 'oginaz': 'Acosta is the absolute worst actor on TV. He has no clue what he is talking about, but is overly willing to put it on display for all to see.', 'miss marple': 'trying to paint trump as a white nationalist incredible! cnn will say anything to tarnish trump ! fake news again ! bravo bunch of clowns ! these so called journalists definitely need at least 3 or 4 years in college to learn english !', 'Troy Ramsier': "Trump should have taken Nancy Pelosi's advice and not be civil.  Great Big Smile !!!", 'Mona Callender': 'Acosta I’m sorry is just plain stupid', 'Yama Kazoo': 'hahah Jim "the joke" Acosta. 100% plonker & tool', 'F1ach': 'Why the fuck does he bother with that prick Acosta, just tell him m to STFU and GTFO !', 'Jason Webster': "Nationalist - a member of a political group advocating or fighting for national independence, a strong national government, etc.\n\nOnly Acosta could find a way to put racism into this. He's such a douchebag. Glad Trump kept his cool", 'Ax Bx': 'Jim Acosta is a flipping RETARD', 'NotOver2012': 'What a jerk!', 'Niccolo Machiavelli': 'Every time Acosta opens his mouth, and then subsequently gets destroyed by our President, the Republican Party gains another vote! Hahaha', 'Kevin jones': 'That Jim Acosta is one big pile of walking dog shit!!!!!  Where was his fucking ass asking questions to that other piece of shit Obama about his ties to Rev. Wright and Louis Farrakhan?!', 'Betsy Ross': 'I think it’s incredibly mean how the left makes up stuff to frame President Trump as being racist, sexist, etc.\nI’m grateful Trump is strong and doesn’t let this crap get him down.', 'Jerry De Leon': 'Acosta, you are a dumbass. Cubano de mierda, eres maricon', 'S J': 'WTF!!! That fkn scumbag jim acosta doesnt even deserve a reply to a racist backhanded question like that!! Wow, just .....Wow what a low-life!! Why is that liar scumbag even allowed to be there!!??', 'David Eide': "Jim Acosta needs to be let go(fired), He always trys to put his own words/twists into a story to make him sound or look like a big reporter. From what I have seen in his reporting, I have yet to see/hear any newsworthy topics or the TRUTH covered honestly! Go back to school and try to be an honest reporter!'....................MAGA", 'Dhionis Tartari': "A national socialist is a leftist who believes the state can control every aspect of society.\n\nA nationalist touts his country's strengths: their people.", 'Young Blood': 'Acosta makes things up as he goes.......he hides his own criminal behavior.', 'MrGenedancingmachine': 'Stick the dog whistle up your ass Jim and see if it blows...', 'NPC #5684813': 'CNN is the enemy of the people.', 'Tina Arko': 'Acosta is an embarrassment.', 'Candi Archibald': 'Jim Jim Jim. You are such a fool!', 'Daniel Garnett': 'And let me guess.  The answer isn’t good enough for CNN.', 'Mary Robinson': 'Jim embarrasses himself every time he opens his mouth. Well said POTUS!!', 'NPC MOD# HAL9000 SER#THX1138': 'Nazi', "Phish N' Chimps": 'And yet, being a Socialist is OK.', 'Wendell': 'Nationalism in it\'s purest form is good. Every country has some form of nationalism. You should be in favor of the best interests of your own country. When did this become a bad thing or a "dog whistle?" We should really begin putting the Dems in their place whenever they push this overused epithet rolodex. It\'s really annoying and is merely an attempt to shut off proper discourse and solutions. I usually either show them the intellectual exit or ignore them completely.', 'Xander Britt': '& were proud of you POTUS🇺🇸🥋', 'N Odak': 'President Trump speaks facts regardless of the baiting, moronic questions.  ❤️ 🇺🇸', 'Tex Willer': 'Jim Acosta gets dumber by the hour!', 'Hhh Hhh': 'Nationalist V traitor', 'Heisenberg': 'I fucking love this man... stamina, charisma, energy, determination, strong will,... Where have you been hiding for all these years, Don⁉', 'PIGGY WIGGY': 'Acosta really really hates trump', 'Titan12': 'CNN is #1 in RACE BAITING', 'TheTallhillbilly': 'Trump was way more respectful than he should have been...lol', 'Mortiky Jones': 'typical of that ass wipe Acosta to bring in the race card with his question..  white nationalist.', 'Teri Badeau': 'Acosta is a despicable idiot!!  In such need of attention!!  Any way he can get it!!  His mommy must have treated him horribly!!  He has such a need to be important!!  He makes people (who know the “real truth”)  want to puke \U0001f92e\n\nDear Jimmy,  sorry you really aren’t as cute or smart as you think,  actually you are quite nauseating!!  Clearly,  you must be going down with the filth from the deep-state!  Nice try,  but we can see why your mommy didn’t like you!!  \nDon’t forget,  our POTUS really does have the evidence!  And we really will see the proof!!  Sleep well!  Tick Tock', 'Greater America': "I'm white, and I'm an American Nationalist.", 'Joey Pickles': 'How on earth can a nationalist be a racist ! , yet more BS from CNN', 'Ajay Rife': 'I told my coworker that trump called himself a nationalist to bait MSM into doing exactly what Acosta did: immediately assume a DOGWHISTLE to white nationalist and again attempt the racist angle. TRUMP will use their own buzzword faux outrage tactics to reveal their childishness.', 'Yootjoob': 'OMG when will jimmy stop with his BS.', 'Misty Loveless': 'I hope he does something about these insurance companies the doctors write you a prescription you cannot afford it so you go back to the Dr and they write you another one and now you’re allergic to that one and then the one after that toSo now you’re stuck with nothing', 'caesarmtnmama': 'Give it up, Acosta.  Huh?  A nationalist?  This is a me-too moment.', 'Matt Miles': 'LMFAO I got an impeach Trump ad for this.', 'Leigh Barry': 'I remember when AMERICA was seen as the leaders in technology😳 then around15+ years ago we fell off the train and China started driving it BuuuUUUuuuT NOT anymore and Jim Acosta and his handlers KNOW THAT!!!!   Yuppers has them ALLL terrified and most NORMAL Americans ecstatic!🇺🇸💚😘', 'the great douchebag douchbag': 'Jim acosta is an idiot and has the brains of crossing the sea to get to the ocean.', 'Jason Shepherd': 'Wow what a tool', 'Jackson Nielsen': 'Could you imagine being Jim Acosta and unironically asking questions like that?'}{'Big Buck': 'AMERICANS BETTER WAKE UP!!!! DIMMIS WANNA HAVE A ONE WORLD 🌎 ORDER!!!! NOTICE THIS GREAT POTUS HASN’ T MENTION NWO \nNEW WORLD ORDER!!!\n\nPLEASE SAVE AMERICA FOR AS LONG AS YOU CAN MR PRESIDENT!!!!', 'David Linihan': 'The White House can pull his credentials. CNN will just have to assign a new correspondent', 'nuvigroovi': 'Acosta lives for the gotcha question and not the truth.', 'Michael Olson': 'Trump has better ratings than CNN', 'Tadd Mason': 'His press credentials should be pulled immediately', 'Lloyd Christmas': 'Coded words? Wtfw..jim acosta is retarded..cnn hires the worst humans', 'River Willow': 'Ghandi was a nationalist', 'Books and Records': "336 likes and 0 dislikes... That's a good sign", 'Shyhalu': 'Sir....we heard you claim you love your country!  This is a problem.....   /liberal', 'J Adams': 'CNN is garbage.', 'Anton Monteleonus': 'You really think the clown 🤡 understood that?', 'MrSILVERADO53': 'I am a nationalist!', 'kyle brooks': 'And still people would replace Trump with Obama. Some people’s kids. Wow good for us and America with trump', 'William Bowman': 'Little Jimmie is demturd', 'Surfer 10': 'Ji Acosta has to be the biggest Idiot on the WH press core. Why is he still on that core is beyond me. Also, he (Jim Acosta) is fruity.', 'Keller Kniffing': 'No dislikes currently (:', 'El Shanks': 'Showing that he can throw the politics aside, cut through all the bullshit. This is why he won the presidency.', 'Bruce Wilson': 'Jim is like a lot of us.......we can’t stand Donald.', 'Garnett Hamlin': 'J.A. what a schlameel !', 'R Watson': 'this why CNN is hated and considered Fake news ,asking gotcha questions that has no barring on America.', 'Decriminalize Darwinism': 'Jim is a traitor. He should be hung and whipped to death.', 'Dan -Horsenwelles- Williams': "4% for NATO.\n\nwe pay for an outsourced european group that gives our country nothing in return.\n\nwe can establish all the outsourced country investments we want to without the UN or EU or NATO approval as long as it respects onshore treaties and the international trader has the goods/service to complete the transactions.\n\ni'm appalled we have not lowered our federal reserve usages in international spending on dumb policy groups that don't accurately support any of the representing countries' economies or military welfare.", 'jim hydle': "How  does Jim manage to talk with O's dick till in his mouth?", 'charlielondon72': 'THANK YOU PRESIDENT TRUMP THEY HAVE DESTROYED EUROPE I FEEL SO SORRY FOR THE BETRAYED PEOPLES OF EUROPE WHOS GRANDFATERS DIED TO FREE THEM FROM HITLER AND NOW THEIR GRANDCHILDREN ARE BEING PERCECUTED GANG RAPED CALLED RACIST BY MUSLIMS BLACKS WHO ARE 2 3 GENARATIONS WHERE THE NATIVES HAVE BEEN THEIR FOR A THUSAND YEARS THEY ARE CULTRALLY GENOCIDEDING THE WHITE RACE ITS SICK AND THE EU AND UK ARE PUSHING THIS AGENDER SIDING WITH THE MMIGRANTS ITS SO SICK SATANIC BUT IT WOULD BE WOULDNT IT', 'rae1957tn': 'God Bless our President!  And he’s NOT a racist!', 'Martin Balgavui': 'Cant CNN find an assignment for asscosta in Saudi Arabia?', 'JJ Says': 'Hey Jim, only a dog can hear dog whistles...', 'krejdloc': 'TRUMP HAS A BETTER IDEA.\n\nNow that would make a great bumper sticker.', 'Marshall Rosen': 'Jim Acosta was the kind of guy that the bullies in his High School would lift him up and hang him by his underwear on his locker door during gym class, leaving him there with a wedgie while he screamed for help. He is such a douchebag.', 'ihategooglespooks': "haha thanks for the t-ball question for President Trump there, Jim Accoster... you couldn't have made that easier for him if you tried, that was some _weak sauce_ journalism there... and President Trump is absolutely correct, that _is_ the definition of a nationalist", 'Atom-Phyr': 'Accosting Acosta starring President Trump.', 'yea bouy': 'Every time Jim Acosta opens his mouth he sounds like a fucking idiot', 'oginaz': 'Acosta is the absolute worst actor on TV. He has no clue what he is talking about, but is overly willing to put it on display for all to see.', 'miss marple': 'trying to paint trump as a white nationalist incredible! cnn will say anything to tarnish trump ! fake news again ! bravo bunch of clowns ! these so called journalists definitely need at least 3 or 4 years in college to learn english !', 'Troy Ramsier': "Trump should have taken Nancy Pelosi's advice and not be civil.  Great Big Smile !!!", 'Mona Callender': 'Acosta I’m sorry is just plain stupid', 'Yama Kazoo': 'hahah Jim "the joke" Acosta. 100% plonker & tool', 'F1ach': 'Why the fuck does he bother with that prick Acosta, just tell him m to STFU and GTFO !', 'Jason Webster': "Nationalist - a member of a political group advocating or fighting for national independence, a strong national government, etc.\n\nOnly Acosta could find a way to put racism into this. He's such a douchebag. Glad Trump kept his cool", 'Ax Bx': 'Jim Acosta is a flipping RETARD', 'NotOver2012': 'What a jerk!', 'Niccolo Machiavelli': 'Every time Acosta opens his mouth, and then subsequently gets destroyed by our President, the Republican Party gains another vote! Hahaha', 'Kevin jones': 'That Jim Acosta is one big pile of walking dog shit!!!!!  Where was his fucking ass asking questions to that other piece of shit Obama about his ties to Rev. Wright and Louis Farrakhan?!', 'Betsy Ross': 'I think it’s incredibly mean how the left makes up stuff to frame President Trump as being racist, sexist, etc.\nI’m grateful Trump is strong and doesn’t let this crap get him down.', 'Jerry De Leon': 'Acosta, you are a dumbass. Cubano de mierda, eres maricon', 'S J': 'WTF!!! That fkn scumbag jim acosta doesnt even deserve a reply to a racist backhanded question like that!! Wow, just .....Wow what a low-life!! Why is that liar scumbag even allowed to be there!!??', 'David Eide': "Jim Acosta needs to be let go(fired), He always trys to put his own words/twists into a story to make him sound or look like a big reporter. From what I have seen in his reporting, I have yet to see/hear any newsworthy topics or the TRUTH covered honestly! Go back to school and try to be an honest reporter!'....................MAGA", 'Dhionis Tartari': "A national socialist is a leftist who believes the state can control every aspect of society.\n\nA nationalist touts his country's strengths: their people.", 'Young Blood': 'Acosta makes things up as he goes.......he hides his own criminal behavior.', 'MrGenedancingmachine': 'Stick the dog whistle up your ass Jim and see if it blows...', 'NPC #5684813': 'CNN is the enemy of the people.', 'Tina Arko': 'Acosta is an embarrassment.', 'Candi Archibald': 'Jim Jim Jim. You are such a fool!', 'Daniel Garnett': 'And let me guess.  The answer isn’t good enough for CNN.', 'Mary Robinson': 'Jim embarrasses himself every time he opens his mouth. Well said POTUS!!', 'NPC MOD# HAL9000 SER#THX1138': 'Nazi', "Phish N' Chimps": 'And yet, being a Socialist is OK.', 'Wendell': 'Nationalism in it\'s purest form is good. Every country has some form of nationalism. You should be in favor of the best interests of your own country. When did this become a bad thing or a "dog whistle?" We should really begin putting the Dems in their place whenever they push this overused epithet rolodex. It\'s really annoying and is merely an attempt to shut off proper discourse and solutions. I usually either show them the intellectual exit or ignore them completely.', 'Xander Britt': '& were proud of you POTUS🇺🇸🥋', 'N Odak': 'President Trump speaks facts regardless of the baiting, moronic questions.  ❤️ 🇺🇸', 'Tex Willer': 'Jim Acosta gets dumber by the hour!', 'Hhh Hhh': 'Nationalist V traitor', 'Heisenberg': 'I fucking love this man... stamina, charisma, energy, determination, strong will,... Where have you been hiding for all these years, Don⁉', 'PIGGY WIGGY': 'Acosta really really hates trump', 'Titan12': 'CNN is #1 in RACE BAITING', 'TheTallhillbilly': 'Trump was way more respectful than he should have been...lol', 'Mortiky Jones': 'typical of that ass wipe Acosta to bring in the race card with his question..  white nationalist.', 'Teri Badeau': 'Acosta is a despicable idiot!!  In such need of attention!!  Any way he can get it!!  His mommy must have treated him horribly!!  He has such a need to be important!!  He makes people (who know the “real truth”)  want to puke \U0001f92e\n\nDear Jimmy,  sorry you really aren’t as cute or smart as you think,  actually you are quite nauseating!!  Clearly,  you must be going down with the filth from the deep-state!  Nice try,  but we can see why your mommy didn’t like you!!  \nDon’t forget,  our POTUS really does have the evidence!  And we really will see the proof!!  Sleep well!  Tick Tock', 'Greater America': "I'm white, and I'm an American Nationalist.", 'Joey Pickles': 'How on earth can a nationalist be a racist ! , yet more BS from CNN', 'Ajay Rife': 'I told my coworker that trump called himself a nationalist to bait MSM into doing exactly what Acosta did: immediately assume a DOGWHISTLE to white nationalist and again attempt the racist angle. TRUMP will use their own buzzword faux outrage tactics to reveal their childishness.', 'Yootjoob': 'OMG when will jimmy stop with his BS.', 'Misty Loveless': 'I hope he does something about these insurance companies the doctors write you a prescription you cannot afford it so you go back to the Dr and they write you another one and now you’re allergic to that one and then the one after that toSo now you’re stuck with nothing', 'caesarmtnmama': 'Give it up, Acosta.  Huh?  A nationalist?  This is a me-too moment.', 'Matt Miles': 'LMFAO I got an impeach Trump ad for this.', 'Leigh Barry': 'I remember when AMERICA was seen as the leaders in technology😳 then around15+ years ago we fell off the train and China started driving it BuuuUUUuuuT NOT anymore and Jim Acosta and his handlers KNOW THAT!!!!   Yuppers has them ALLL terrified and most NORMAL Americans ecstatic!🇺🇸💚😘', 'the great douchebag douchbag': 'Jim acosta is an idiot and has the brains of crossing the sea to get to the ocean.', 'Jason Shepherd': 'Wow what a tool', 'Jackson Nielsen': 'Could you imagine being Jim Acosta and unironically asking questions like that?'}{'Big Buck': 'AMERICANS BETTER WAKE UP!!!! DIMMIS WANNA HAVE A ONE WORLD 🌎 ORDER!!!! NOTICE THIS GREAT POTUS HASN’ T MENTION NWO \nNEW WORLD ORDER!!!\n\nPLEASE SAVE AMERICA FOR AS LONG AS YOU CAN MR PRESIDENT!!!!', 'David Linihan': 'The White House can pull his credentials. CNN will just have to assign a new correspondent', 'nuvigroovi': 'Acosta lives for the gotcha question and not the truth.', 'Michael Olson': 'Trump has better ratings than CNN', 'Tadd Mason': 'His press credentials should be pulled immediately', 'Lloyd Christmas': 'Coded words? Wtfw..jim acosta is retarded..cnn hires the worst humans', 'River Willow': 'Ghandi was a nationalist', 'Books and Records': "336 likes and 0 dislikes... That's a good sign", 'Shyhalu': 'Sir....we heard you claim you love your country!  This is a problem.....   /liberal', 'J Adams': 'CNN is garbage.', 'Anton Monteleonus': 'You really think the clown 🤡 understood that?', 'MrSILVERADO53': 'I am a nationalist!', 'kyle brooks': 'And still people would replace Trump with Obama. Some people’s kids. Wow good for us and America with trump', 'William Bowman': 'Little Jimmie is demturd', 'Surfer 10': 'Ji Acosta has to be the biggest Idiot on the WH press core. Why is he still on that core is beyond me. Also, he (Jim Acosta) is fruity.', 'Keller Kniffing': 'No dislikes currently (:', 'El Shanks': 'Showing that he can throw the politics aside, cut through all the bullshit. This is why he won the presidency.', 'Bruce Wilson': 'Jim is like a lot of us.......we can’t stand Donald.', 'Garnett Hamlin': 'J.A. what a schlameel !', 'R Watson': 'this why CNN is hated and considered Fake news ,asking gotcha questions that has no barring on America.', 'Decriminalize Darwinism': 'Jim is a traitor. He should be hung and whipped to death.', 'Dan -Horsenwelles- Williams': "4% for NATO.\n\nwe pay for an outsourced european group that gives our country nothing in return.\n\nwe can establish all the outsourced country investments we want to without the UN or EU or NATO approval as long as it respects onshore treaties and the international trader has the goods/service to complete the transactions.\n\ni'm appalled we have not lowered our federal reserve usages in international spending on dumb policy groups that don't accurately support any of the representing countries' economies or military welfare.", 'jim hydle': "How  does Jim manage to talk with O's dick till in his mouth?", 'charlielondon72': 'THANK YOU PRESIDENT TRUMP THEY HAVE DESTROYED EUROPE I FEEL SO SORRY FOR THE BETRAYED PEOPLES OF EUROPE WHOS GRANDFATERS DIED TO FREE THEM FROM HITLER AND NOW THEIR GRANDCHILDREN ARE BEING PERCECUTED GANG RAPED CALLED RACIST BY MUSLIMS BLACKS WHO ARE 2 3 GENARATIONS WHERE THE NATIVES HAVE BEEN THEIR FOR A THUSAND YEARS THEY ARE CULTRALLY GENOCIDEDING THE WHITE RACE ITS SICK AND THE EU AND UK ARE PUSHING THIS AGENDER SIDING WITH THE MMIGRANTS ITS SO SICK SATANIC BUT IT WOULD BE WOULDNT IT', 'rae1957tn': 'God Bless our President!  And he’s NOT a racist!', 'Martin Balgavui': 'Cant CNN find an assignment for asscosta in Saudi Arabia?', 'JJ Says': 'Hey Jim, only a dog can hear dog whistles...', 'krejdloc': 'TRUMP HAS A BETTER IDEA.\n\nNow that would make a great bumper sticker.', 'Marshall Rosen': 'Jim Acosta was the kind of guy that the bullies in his High School would lift him up and hang him by his underwear on his locker door during gym class, leaving him there with a wedgie while he screamed for help. He is such a douchebag.', 'ihategooglespooks': "haha thanks for the t-ball question for President Trump there, Jim Accoster... you couldn't have made that easier for him if you tried, that was some _weak sauce_ journalism there... and President Trump is absolutely correct, that _is_ the definition of a nationalist", 'Atom-Phyr': 'Accosting Acosta starring President Trump.', 'yea bouy': 'Every time Jim Acosta opens his mouth he sounds like a fucking idiot', 'oginaz': 'Acosta is the absolute worst actor on TV. He has no clue what he is talking about, but is overly willing to put it on display for all to see.', 'miss marple': 'trying to paint trump as a white nationalist incredible! cnn will say anything to tarnish trump ! fake news again ! bravo bunch of clowns ! these so called journalists definitely need at least 3 or 4 years in college to learn english !', 'Troy Ramsier': "Trump should have taken Nancy Pelosi's advice and not be civil.  Great Big Smile !!!", 'Mona Callender': 'Acosta I’m sorry is just plain stupid', 'Yama Kazoo': 'hahah Jim "the joke" Acosta. 100% plonker & tool', 'F1ach': 'Why the fuck does he bother with that prick Acosta, just tell him m to STFU and GTFO !', 'Jason Webster': "Nationalist - a member of a political group advocating or fighting for national independence, a strong national government, etc.\n\nOnly Acosta could find a way to put racism into this. He's such a douchebag. Glad Trump kept his cool", 'Ax Bx': 'Jim Acosta is a flipping RETARD', 'NotOver2012': 'What a jerk!', 'Niccolo Machiavelli': 'Every time Acosta opens his mouth, and then subsequently gets destroyed by our President, the Republican Party gains another vote! Hahaha', 'Kevin jones': 'That Jim Acosta is one big pile of walking dog shit!!!!!  Where was his fucking ass asking questions to that other piece of shit Obama about his ties to Rev. Wright and Louis Farrakhan?!', 'Betsy Ross': 'I think it’s incredibly mean how the left makes up stuff to frame President Trump as being racist, sexist, etc.\nI’m grateful Trump is strong and doesn’t let this crap get him down.', 'Jerry De Leon': 'Acosta, you are a dumbass. Cubano de mierda, eres maricon', 'S J': 'WTF!!! That fkn scumbag jim acosta doesnt even deserve a reply to a racist backhanded question like that!! Wow, just .....Wow what a low-life!! Why is that liar scumbag even allowed to be there!!??', 'David Eide': "Jim Acosta needs to be let go(fired), He always trys to put his own words/twists into a story to make him sound or look like a big reporter. From what I have seen in his reporting, I have yet to see/hear any newsworthy topics or the TRUTH covered honestly! Go back to school and try to be an honest reporter!'....................MAGA", 'Dhionis Tartari': "A national socialist is a leftist who believes the state can control every aspect of society.\n\nA nationalist touts his country's strengths: their people.", 'Young Blood': 'Acosta makes things up as he goes.......he hides his own criminal behavior.', 'MrGenedancingmachine': 'Stick the dog whistle up your ass Jim and see if it blows...', 'NPC #5684813': 'CNN is the enemy of the people.', 'Tina Arko': 'Acosta is an embarrassment.', 'Candi Archibald': 'Jim Jim Jim. You are such a fool!', 'Daniel Garnett': 'And let me guess.  The answer isn’t good enough for CNN.', 'Mary Robinson': 'Jim embarrasses himself every time he opens his mouth. Well said POTUS!!', 'NPC MOD# HAL9000 SER#THX1138': 'Nazi', "Phish N' Chimps": 'And yet, being a Socialist is OK.', 'Wendell': 'Nationalism in it\'s purest form is good. Every country has some form of nationalism. You should be in favor of the best interests of your own country. When did this become a bad thing or a "dog whistle?" We should really begin putting the Dems in their place whenever they push this overused epithet rolodex. It\'s really annoying and is merely an attempt to shut off proper discourse and solutions. I usually either show them the intellectual exit or ignore them completely.', 'Xander Britt': '& were proud of you POTUS🇺🇸🥋', 'N Odak': 'President Trump speaks facts regardless of the baiting, moronic questions.  ❤️ 🇺🇸', 'Tex Willer': 'Jim Acosta gets dumber by the hour!', 'Hhh Hhh': 'Nationalist V traitor', 'Heisenberg': 'I fucking love this man... stamina, charisma, energy, determination, strong will,... Where have you been hiding for all these years, Don⁉', 'PIGGY WIGGY': 'Acosta really really hates trump', 'Titan12': 'CNN is #1 in RACE BAITING', 'TheTallhillbilly': 'Trump was way more respectful than he should have been...lol', 'Mortiky Jones': 'typical of that ass wipe Acosta to bring in the race card with his question..  white nationalist.', 'Teri Badeau': 'Acosta is a despicable idiot!!  In such need of attention!!  Any way he can get it!!  His mommy must have treated him horribly!!  He has such a need to be important!!  He makes people (who know the “real truth”)  want to puke \U0001f92e\n\nDear Jimmy,  sorry you really aren’t as cute or smart as you think,  actually you are quite nauseating!!  Clearly,  you must be going down with the filth from the deep-state!  Nice try,  but we can see why your mommy didn’t like you!!  \nDon’t forget,  our POTUS really does have the evidence!  And we really will see the proof!!  Sleep well!  Tick Tock', 'Greater America': "I'm white, and I'm an American Nationalist.", 'Joey Pickles': 'How on earth can a nationalist be a racist ! , yet more BS from CNN', 'Ajay Rife': 'I told my coworker that trump called himself a nationalist to bait MSM into doing exactly what Acosta did: immediately assume a DOGWHISTLE to white nationalist and again attempt the racist angle. TRUMP will use their own buzzword faux outrage tactics to reveal their childishness.', 'Yootjoob': 'OMG when will jimmy stop with his BS.', 'Misty Loveless': 'I hope he does something about these insurance companies the doctors write you a prescription you cannot afford it so you go back to the Dr and they write you another one and now you’re allergic to that one and then the one after that toSo now you’re stuck with nothing', 'caesarmtnmama': 'Give it up, Acosta.  Huh?  A nationalist?  This is a me-too moment.', 'Matt Miles': 'LMFAO I got an impeach Trump ad for this.', 'Leigh Barry': 'I remember when AMERICA was seen as the leaders in technology😳 then around15+ years ago we fell off the train and China started driving it BuuuUUUuuuT NOT anymore and Jim Acosta and his handlers KNOW THAT!!!!   Yuppers has them ALLL terrified and most NORMAL Americans ecstatic!🇺🇸💚😘', 'the great douchebag douchbag': 'Jim acosta is an idiot and has the brains of crossing the sea to get to the ocean.', 'Jason Shepherd': 'Wow what a tool', 'Jackson Nielsen': 'Could you imagine being Jim Acosta and unironically asking questions like that?'}{'Big Buck': 'AMERICANS BETTER WAKE UP!!!! DIMMIS WANNA HAVE A ONE WORLD 🌎 ORDER!!!! NOTICE THIS GREAT POTUS HASN’ T MENTION NWO \nNEW WORLD ORDER!!!\n\nPLEASE SAVE AMERICA FOR AS LONG AS YOU CAN MR PRESIDENT!!!!', 'David Linihan': 'The White House can pull his credentials. CNN will just have to assign a new correspondent', 'nuvigroovi': 'Acosta lives for the gotcha question and not the truth.', 'Michael Olson': 'Trump has better ratings than CNN', 'Tadd Mason': 'His press credentials should be pulled immediately', 'Lloyd Christmas': 'Coded words? Wtfw..jim acosta is retarded..cnn hires the worst humans', 'River Willow': 'Ghandi was a nationalist', 'Books and Records': "336 likes and 0 dislikes... That's a good sign", 'Shyhalu': 'Sir....we heard you claim you love your country!  This is a problem.....   /liberal', 'J Adams': 'CNN is garbage.', 'Anton Monteleonus': 'You really think the clown 🤡 understood that?', 'MrSILVERADO53': 'I am a nationalist!', 'kyle brooks': 'And still people would replace Trump with Obama. Some people’s kids. Wow good for us and America with trump', 'William Bowman': 'Little Jimmie is demturd', 'Surfer 10': 'Ji Acosta has to be the biggest Idiot on the WH press core. Why is he still on that core is beyond me. Also, he (Jim Acosta) is fruity.', 'Keller Kniffing': 'No dislikes currently (:', 'El Shanks': 'Showing that he can throw the politics aside, cut through all the bullshit. This is why he won the presidency.', 'Bruce Wilson': 'Jim is like a lot of us.......we can’t stand Donald.', 'Garnett Hamlin': 'J.A. what a schlameel !', 'R Watson': 'this why CNN is hated and considered Fake news ,asking gotcha questions that has no barring on America.', 'Decriminalize Darwinism': 'Jim is a traitor. He should be hung and whipped to death.', 'Dan -Horsenwelles- Williams': "4% for NATO.\n\nwe pay for an outsourced european group that gives our country nothing in return.\n\nwe can establish all the outsourced country investments we want to without the UN or EU or NATO approval as long as it respects onshore treaties and the international trader has the goods/service to complete the transactions.\n\ni'm appalled we have not lowered our federal reserve usages in international spending on dumb policy groups that don't accurately support any of the representing countries' economies or military welfare.", 'jim hydle': "How  does Jim manage to talk with O's dick till in his mouth?", 'charlielondon72': 'THANK YOU PRESIDENT TRUMP THEY HAVE DESTROYED EUROPE I FEEL SO SORRY FOR THE BETRAYED PEOPLES OF EUROPE WHOS GRANDFATERS DIED TO FREE THEM FROM HITLER AND NOW THEIR GRANDCHILDREN ARE BEING PERCECUTED GANG RAPED CALLED RACIST BY MUSLIMS BLACKS WHO ARE 2 3 GENARATIONS WHERE THE NATIVES HAVE BEEN THEIR FOR A THUSAND YEARS THEY ARE CULTRALLY GENOCIDEDING THE WHITE RACE ITS SICK AND THE EU AND UK ARE PUSHING THIS AGENDER SIDING WITH THE MMIGRANTS ITS SO SICK SATANIC BUT IT WOULD BE WOULDNT IT', 'rae1957tn': 'God Bless our President!  And he’s NOT a racist!', 'Martin Balgavui': 'Cant CNN find an assignment for asscosta in Saudi Arabia?', 'JJ Says': 'Hey Jim, only a dog can hear dog whistles...', 'krejdloc': 'TRUMP HAS A BETTER IDEA.\n\nNow that would make a great bumper sticker.', 'Marshall Rosen': 'Jim Acosta was the kind of guy that the bullies in his High School would lift him up and hang him by his underwear on his locker door during gym class, leaving him there with a wedgie while he screamed for help. He is such a douchebag.', 'ihategooglespooks': "haha thanks for the t-ball question for President Trump there, Jim Accoster... you couldn't have made that easier for him if you tried, that was some _weak sauce_ journalism there... and President Trump is absolutely correct, that _is_ the definition of a nationalist", 'Atom-Phyr': 'Accosting Acosta starring President Trump.', 'yea bouy': 'Every time Jim Acosta opens his mouth he sounds like a fucking idiot', 'oginaz': 'Acosta is the absolute worst actor on TV. He has no clue what he is talking about, but is overly willing to put it on display for all to see.', 'miss marple': 'trying to paint trump as a white nationalist incredible! cnn will say anything to tarnish trump ! fake news again ! bravo bunch of clowns ! these so called journalists definitely need at least 3 or 4 years in college to learn english !', 'Troy Ramsier': "Trump should have taken Nancy Pelosi's advice and not be civil.  Great Big Smile !!!", 'Mona Callender': 'Acosta I’m sorry is just plain stupid', 'Yama Kazoo': 'hahah Jim "the joke" Acosta. 100% plonker & tool', 'F1ach': 'Why the fuck does he bother with that prick Acosta, just tell him m to STFU and GTFO !', 'Jason Webster': "Nationalist - a member of a political group advocating or fighting for national independence, a strong national government, etc.\n\nOnly Acosta could find a way to put racism into this. He's such a douchebag. Glad Trump kept his cool", 'Ax Bx': 'Jim Acosta is a flipping RETARD', 'NotOver2012': 'What a jerk!', 'Niccolo Machiavelli': 'Every time Acosta opens his mouth, and then subsequently gets destroyed by our President, the Republican Party gains another vote! Hahaha', 'Kevin jones': 'That Jim Acosta is one big pile of walking dog shit!!!!!  Where was his fucking ass asking questions to that other piece of shit Obama about his ties to Rev. Wright and Louis Farrakhan?!', 'Betsy Ross': 'I think it’s incredibly mean how the left makes up stuff to frame President Trump as being racist, sexist, etc.\nI’m grateful Trump is strong and doesn’t let this crap get him down.', 'Jerry De Leon': 'Acosta, you are a dumbass. Cubano de mierda, eres maricon', 'S J': 'WTF!!! That fkn scumbag jim acosta doesnt even deserve a reply to a racist backhanded question like that!! Wow, just .....Wow what a low-life!! Why is that liar scumbag even allowed to be there!!??', 'David Eide': "Jim Acosta needs to be let go(fired), He always trys to put his own words/twists into a story to make him sound or look like a big reporter. From what I have seen in his reporting, I have yet to see/hear any newsworthy topics or the TRUTH covered honestly! Go back to school and try to be an honest reporter!'....................MAGA", 'Dhionis Tartari': "A national socialist is a leftist who believes the state can control every aspect of society.\n\nA nationalist touts his country's strengths: their people.", 'Young Blood': 'Acosta makes things up as he goes.......he hides his own criminal behavior.', 'MrGenedancingmachine': 'Stick the dog whistle up your ass Jim and see if it blows...', 'NPC #5684813': 'CNN is the enemy of the people.', 'Tina Arko': 'Acosta is an embarrassment.', 'Candi Archibald': 'Jim Jim Jim. You are such a fool!', 'Daniel Garnett': 'And let me guess.  The answer isn’t good enough for CNN.', 'Mary Robinson': 'Jim embarrasses himself every time he opens his mouth. Well said POTUS!!', 'NPC MOD# HAL9000 SER#THX1138': 'Nazi', "Phish N' Chimps": 'And yet, being a Socialist is OK.', 'Wendell': 'Nationalism in it\'s purest form is good. Every country has some form of nationalism. You should be in favor of the best interests of your own country. When did this become a bad thing or a "dog whistle?" We should really begin putting the Dems in their place whenever they push this overused epithet rolodex. It\'s really annoying and is merely an attempt to shut off proper discourse and solutions. I usually either show them the intellectual exit or ignore them completely.', 'Xander Britt': '& were proud of you POTUS🇺🇸🥋', 'N Odak': 'President Trump speaks facts regardless of the baiting, moronic questions.  ❤️ 🇺🇸', 'Tex Willer': 'Jim Acosta gets dumber by the hour!', 'Hhh Hhh': 'Nationalist V traitor', 'Heisenberg': 'I fucking love this man... stamina, charisma, energy, determination, strong will,... Where have you been hiding for all these years, Don⁉', 'PIGGY WIGGY': 'Acosta really really hates trump', 'Titan12': 'CNN is #1 in RACE BAITING', 'TheTallhillbilly': 'Trump was way more respectful than he should have been...lol', 'Mortiky Jones': 'typical of that ass wipe Acosta to bring in the race card with his question..  white nationalist.', 'Teri Badeau': 'Acosta is a despicable idiot!!  In such need of attention!!  Any way he can get it!!  His mommy must have treated him horribly!!  He has such a need to be important!!  He makes people (who know the “real truth”)  want to puke \U0001f92e\n\nDear Jimmy,  sorry you really aren’t as cute or smart as you think,  actually you are quite nauseating!!  Clearly,  you must be going down with the filth from the deep-state!  Nice try,  but we can see why your mommy didn’t like you!!  \nDon’t forget,  our POTUS really does have the evidence!  And we really will see the proof!!  Sleep well!  Tick Tock', 'Greater America': "I'm white, and I'm an American Nationalist.", 'Joey Pickles': 'How on earth can a nationalist be a racist ! , yet more BS from CNN', 'Ajay Rife': 'I told my coworker that trump called himself a nationalist to bait MSM into doing exactly what Acosta did: immediately assume a DOGWHISTLE to white nationalist and again attempt the racist angle. TRUMP will use their own buzzword faux outrage tactics to reveal their childishness.', 'Yootjoob': 'OMG when will jimmy stop with his BS.', 'Misty Loveless': 'I hope he does something about these insurance companies the doctors write you a prescription you cannot afford it so you go back to the Dr and they write you another one and now you’re allergic to that one and then the one after that toSo now you’re stuck with nothing', 'caesarmtnmama': 'Give it up, Acosta.  Huh?  A nationalist?  This is a me-too moment.', 'Matt Miles': 'LMFAO I got an impeach Trump ad for this.', 'Leigh Barry': 'I remember when AMERICA was seen as the leaders in technology😳 then around15+ years ago we fell off the train and China started driving it BuuuUUUuuuT NOT anymore and Jim Acosta and his handlers KNOW THAT!!!!   Yuppers has them ALLL terrified and most NORMAL Americans ecstatic!🇺🇸💚😘', 'the great douchebag douchbag': 'Jim acosta is an idiot and has the brains of crossing the sea to get to the ocean.', 'Jason Shepherd': 'Wow what a tool', 'Jackson Nielsen': 'Could you imagine being Jim Acosta and unironically asking questions like that?'}{'Big Buck': 'AMERICANS BETTER WAKE UP!!!! DIMMIS WANNA HAVE A ONE WORLD 🌎 ORDER!!!! NOTICE THIS GREAT POTUS HASN’ T MENTION NWO \nNEW WORLD ORDER!!!\n\nPLEASE SAVE AMERICA FOR AS LONG AS YOU CAN MR PRESIDENT!!!!', 'David Linihan': 'The White House can pull his credentials. CNN will just have to assign a new correspondent', 'nuvigroovi': 'Acosta lives for the gotcha question and not the truth.', 'Michael Olson': 'Trump has better ratings than CNN', 'Tadd Mason': 'His press credentials should be pulled immediately', 'Lloyd Christmas': 'Coded words? Wtfw..jim acosta is retarded..cnn hires the worst humans', 'River Willow': 'Ghandi was a nationalist', 'Books and Records': "336 likes and 0 dislikes... That's a good sign", 'Shyhalu': 'Sir....we heard you claim you love your country!  This is a problem.....   /liberal', 'J Adams': 'CNN is garbage.', 'Anton Monteleonus': 'You really think the clown 🤡 understood that?', 'MrSILVERADO53': 'I am a nationalist!', 'kyle brooks': 'And still people would replace Trump with Obama. Some people’s kids. Wow good for us and America with trump', 'William Bowman': 'Little Jimmie is demturd', 'Surfer 10': 'Ji Acosta has to be the biggest Idiot on the WH press core. Why is he still on that core is beyond me. Also, he (Jim Acosta) is fruity.', 'Keller Kniffing': 'No dislikes currently (:', 'El Shanks': 'Showing that he can throw the politics aside, cut through all the bullshit. This is why he won the presidency.', 'Bruce Wilson': 'Jim is like a lot of us.......we can’t stand Donald.', 'Garnett Hamlin': 'J.A. what a schlameel !', 'R Watson': 'this why CNN is hated and considered Fake news ,asking gotcha questions that has no barring on America.', 'Decriminalize Darwinism': 'Jim is a traitor. He should be hung and whipped to death.', 'Dan -Horsenwelles- Williams': "4% for NATO.\n\nwe pay for an outsourced european group that gives our country nothing in return.\n\nwe can establish all the outsourced country investments we want to without the UN or EU or NATO approval as long as it respects onshore treaties and the international trader has the goods/service to complete the transactions.\n\ni'm appalled we have not lowered our federal reserve usages in international spending on dumb policy groups that don't accurately support any of the representing countries' economies or military welfare.", 'jim hydle': "How  does Jim manage to talk with O's dick till in his mouth?", 'charlielondon72': 'THANK YOU PRESIDENT TRUMP THEY HAVE DESTROYED EUROPE I FEEL SO SORRY FOR THE BETRAYED PEOPLES OF EUROPE WHOS GRANDFATERS DIED TO FREE THEM FROM HITLER AND NOW THEIR GRANDCHILDREN ARE BEING PERCECUTED GANG RAPED CALLED RACIST BY MUSLIMS BLACKS WHO ARE 2 3 GENARATIONS WHERE THE NATIVES HAVE BEEN THEIR FOR A THUSAND YEARS THEY ARE CULTRALLY GENOCIDEDING THE WHITE RACE ITS SICK AND THE EU AND UK ARE PUSHING THIS AGENDER SIDING WITH THE MMIGRANTS ITS SO SICK SATANIC BUT IT WOULD BE WOULDNT IT', 'rae1957tn': 'God Bless our President!  And he’s NOT a racist!', 'Martin Balgavui': 'Cant CNN find an assignment for asscosta in Saudi Arabia?', 'JJ Says': 'Hey Jim, only a dog can hear dog whistles...', 'krejdloc': 'TRUMP HAS A BETTER IDEA.\n\nNow that would make a great bumper sticker.', 'Marshall Rosen': 'Jim Acosta was the kind of guy that the bullies in his High School would lift him up and hang him by his underwear on his locker door during gym class, leaving him there with a wedgie while he screamed for help. He is such a douchebag.', 'ihategooglespooks': "haha thanks for the t-ball question for President Trump there, Jim Accoster... you couldn't have made that easier for him if you tried, that was some _weak sauce_ journalism there... and President Trump is absolutely correct, that _is_ the definition of a nationalist", 'Atom-Phyr': 'Accosting Acosta starring President Trump.', 'yea bouy': 'Every time Jim Acosta opens his mouth he sounds like a fucking idiot', 'oginaz': 'Acosta is the absolute worst actor on TV. He has no clue what he is talking about, but is overly willing to put it on display for all to see.', 'miss marple': 'trying to paint trump as a white nationalist incredible! cnn will say anything to tarnish trump ! fake news again ! bravo bunch of clowns ! these so called journalists definitely need at least 3 or 4 years in college to learn english !', 'Troy Ramsier': "Trump should have taken Nancy Pelosi's advice and not be civil.  Great Big Smile !!!", 'Mona Callender': 'Acosta I’m sorry is just plain stupid', 'Yama Kazoo': 'hahah Jim "the joke" Acosta. 100% plonker & tool', 'F1ach': 'Why the fuck does he bother with that prick Acosta, just tell him m to STFU and GTFO !', 'Jason Webster': "Nationalist - a member of a political group advocating or fighting for national independence, a strong national government, etc.\n\nOnly Acosta could find a way to put racism into this. He's such a douchebag. Glad Trump kept his cool", 'Ax Bx': 'Jim Acosta is a flipping RETARD', 'NotOver2012': 'What a jerk!', 'Niccolo Machiavelli': 'Every time Acosta opens his mouth, and then subsequently gets destroyed by our President, the Republican Party gains another vote! Hahaha', 'Kevin jones': 'That Jim Acosta is one big pile of walking dog shit!!!!!  Where was his fucking ass asking questions to that other piece of shit Obama about his ties to Rev. Wright and Louis Farrakhan?!', 'Betsy Ross': 'I think it’s incredibly mean how the left makes up stuff to frame President Trump as being racist, sexist, etc.\nI’m grateful Trump is strong and doesn’t let this crap get him down.', 'Jerry De Leon': 'Acosta, you are a dumbass. Cubano de mierda, eres maricon', 'S J': 'WTF!!! That fkn scumbag jim acosta doesnt even deserve a reply to a racist backhanded question like that!! Wow, just .....Wow what a low-life!! Why is that liar scumbag even allowed to be there!!??', 'David Eide': "Jim Acosta needs to be let go(fired), He always trys to put his own words/twists into a story to make him sound or look like a big reporter. From what I have seen in his reporting, I have yet to see/hear any newsworthy topics or the TRUTH covered honestly! Go back to school and try to be an honest reporter!'....................MAGA", 'Dhionis Tartari': "A national socialist is a leftist who believes the state can control every aspect of society.\n\nA nationalist touts his country's strengths: their people.", 'Young Blood': 'Acosta makes things up as he goes.......he hides his own criminal behavior.', 'MrGenedancingmachine': 'Stick the dog whistle up your ass Jim and see if it blows...', 'NPC #5684813': 'CNN is the enemy of the people.', 'Tina Arko': 'Acosta is an embarrassment.', 'Candi Archibald': 'Jim Jim Jim. You are such a fool!', 'Daniel Garnett': 'And let me guess.  The answer isn’t good enough for CNN.', 'Mary Robinson': 'Jim embarrasses himself every time he opens his mouth. Well said POTUS!!', 'NPC MOD# HAL9000 SER#THX1138': 'Nazi', "Phish N' Chimps": 'And yet, being a Socialist is OK.', 'Wendell': 'Nationalism in it\'s purest form is good. Every country has some form of nationalism. You should be in favor of the best interests of your own country. When did this become a bad thing or a "dog whistle?" We should really begin putting the Dems in their place whenever they push this overused epithet rolodex. It\'s really annoying and is merely an attempt to shut off proper discourse and solutions. I usually either show them the intellectual exit or ignore them completely.', 'Xander Britt': '& were proud of you POTUS🇺🇸🥋', 'N Odak': 'President Trump speaks facts regardless of the baiting, moronic questions.  ❤️ 🇺🇸', 'Tex Willer': 'Jim Acosta gets dumber by the hour!', 'Hhh Hhh': 'Nationalist V traitor', 'Heisenberg': 'I fucking love this man... stamina, charisma, energy, determination, strong will,... Where have you been hiding for all these years, Don⁉', 'PIGGY WIGGY': 'Acosta really really hates trump', 'Titan12': 'CNN is #1 in RACE BAITING', 'TheTallhillbilly': 'Trump was way more respectful than he should have been...lol', 'Mortiky Jones': 'typical of that ass wipe Acosta to bring in the race card with his question..  white nationalist.', 'Teri Badeau': 'Acosta is a despicable idiot!!  In such need of attention!!  Any way he can get it!!  His mommy must have treated him horribly!!  He has such a need to be important!!  He makes people (who know the “real truth”)  want to puke \U0001f92e\n\nDear Jimmy,  sorry you really aren’t as cute or smart as you think,  actually you are quite nauseating!!  Clearly,  you must be going down with the filth from the deep-state!  Nice try,  but we can see why your mommy didn’t like you!!  \nDon’t forget,  our POTUS really does have the evidence!  And we really will see the proof!!  Sleep well!  Tick Tock', 'Greater America': "I'm white, and I'm an American Nationalist.", 'Joey Pickles': 'How on earth can a nationalist be a racist ! , yet more BS from CNN', 'Ajay Rife': 'I told my coworker that trump called himself a nationalist to bait MSM into doing exactly what Acosta did: immediately assume a DOGWHISTLE to white nationalist and again attempt the racist angle. TRUMP will use their own buzzword faux outrage tactics to reveal their childishness.', 'Yootjoob': 'OMG when will jimmy stop with his BS.', 'Misty Loveless': 'I hope he does something about these insurance companies the doctors write you a prescription you cannot afford it so you go back to the Dr and they write you another one and now you’re allergic to that one and then the one after that toSo now you’re stuck with nothing', 'caesarmtnmama': 'Give it up, Acosta.  Huh?  A nationalist?  This is a me-too moment.', 'Matt Miles': 'LMFAO I got an impeach Trump ad for this.', 'Leigh Barry': 'I remember when AMERICA was seen as the leaders in technology😳 then around15+ years ago we fell off the train and China started driving it BuuuUUUuuuT NOT anymore and Jim Acosta and his handlers KNOW THAT!!!!   Yuppers has them ALLL terrified and most NORMAL Americans ecstatic!🇺🇸💚😘', 'the great douchebag douchbag': 'Jim acosta is an idiot and has the brains of crossing the sea to get to the ocean.', 'Jason Shepherd': 'Wow what a tool', 'Jackson Nielsen': 'Could you imagine being Jim Acosta and unironically asking questions like that?'}{'Big Buck': 'AMERICANS BETTER WAKE UP!!!! DIMMIS WANNA HAVE A ONE WORLD 🌎 ORDER!!!! NOTICE THIS GREAT POTUS HASN’ T MENTION NWO \nNEW WORLD ORDER!!!\n\nPLEASE SAVE AMERICA FOR AS LONG AS YOU CAN MR PRESIDENT!!!!', 'David Linihan': 'The White House can pull his credentials. CNN will just have to assign a new correspondent', 'nuvigroovi': 'Acosta lives for the gotcha question and not the truth.', 'Michael Olson': 'Trump has better ratings than CNN', 'Tadd Mason': 'His press credentials should be pulled immediately', 'Lloyd Christmas': 'Coded words? Wtfw..jim acosta is retarded..cnn hires the worst humans', 'River Willow': 'Ghandi was a nationalist', 'Books and Records': "336 likes and 0 dislikes... That's a good sign", 'Shyhalu': 'Sir....we heard you claim you love your country!  This is a problem.....   /liberal', 'J Adams': 'CNN is garbage.', 'Anton Monteleonus': 'You really think the clown 🤡 understood that?', 'MrSILVERADO53': 'I am a nationalist!', 'kyle brooks': 'And still people would replace Trump with Obama. Some people’s kids. Wow good for us and America with trump', 'William Bowman': 'Little Jimmie is demturd', 'Surfer 10': 'Ji Acosta has to be the biggest Idiot on the WH press core. Why is he still on that core is beyond me. Also, he (Jim Acosta) is fruity.', 'Keller Kniffing': 'No dislikes currently (:', 'El Shanks': 'Showing that he can throw the politics aside, cut through all the bullshit. This is why he won the presidency.', 'Bruce Wilson': 'Jim is like a lot of us.......we can’t stand Donald.', 'Garnett Hamlin': 'J.A. what a schlameel !', 'R Watson': 'this why CNN is hated and considered Fake news ,asking gotcha questions that has no barring on America.', 'Decriminalize Darwinism': 'Jim is a traitor. He should be hung and whipped to death.', 'Dan -Horsenwelles- Williams': "4% for NATO.\n\nwe pay for an outsourced european group that gives our country nothing in return.\n\nwe can establish all the outsourced country investments we want to without the UN or EU or NATO approval as long as it respects onshore treaties and the international trader has the goods/service to complete the transactions.\n\ni'm appalled we have not lowered our federal reserve usages in international spending on dumb policy groups that don't accurately support any of the representing countries' economies or military welfare.", 'jim hydle': "How  does Jim manage to talk with O's dick till in his mouth?", 'charlielondon72': 'THANK YOU PRESIDENT TRUMP THEY HAVE DESTROYED EUROPE I FEEL SO SORRY FOR THE BETRAYED PEOPLES OF EUROPE WHOS GRANDFATERS DIED TO FREE THEM FROM HITLER AND NOW THEIR GRANDCHILDREN ARE BEING PERCECUTED GANG RAPED CALLED RACIST BY MUSLIMS BLACKS WHO ARE 2 3 GENARATIONS WHERE THE NATIVES HAVE BEEN THEIR FOR A THUSAND YEARS THEY ARE CULTRALLY GENOCIDEDING THE WHITE RACE ITS SICK AND THE EU AND UK ARE PUSHING THIS AGENDER SIDING WITH THE MMIGRANTS ITS SO SICK SATANIC BUT IT WOULD BE WOULDNT IT', 'rae1957tn': 'God Bless our President!  And he’s NOT a racist!'}