{'SepticFalcon': 'FYI here is an image from Reddit with a lot of detail and clarity all in one place for beta/1.0 features/content : https://i.redd.it/p861o79k3ft11.png', 'jack black': 'So what I got out of this is the DayZ Mod for ARMA is still better than this.', 'qBMOp': 'its beta not beeta .... pronounced baeta', 'SharpWelder651': '"Making decisions like this is painful for every developer - nobody likes to see "their" feature being cut, or postponed to some future update - but having a balanced and polished core of basic game play is more important than having dozens of flavor, supporting and exotic features."  SERIOUSLY ?   After 5  long years of patience and 5 000h. on the game, i was hoping for more content not less?  We are not your beta tester ,we are gamers remember? My point of view is , valve should force failed early access titles developers to refund their customers their money. Early access on steam should be like "you have 1-2 years to complete the game and make all features you promised or you have to return all the money" and that would make devs think about what theyre promising...', 'winner winner': 'How many years has it been? Wow.. fucking terrible progress', 'Geeky Alex': 'Just fund scum and abandon this mess', 'mashguy2': 'bows... how hard is it to make that work..', 'gilbert andy': 'and....2020?', 'soniferous': 'years not decades.... I meant, weeks not months', 'Aaron Power': 'Before all of this stuff is brought to the game please fix the water and food stats', 'The Alchemist': "7:00 specifically * you're welcome.", 'Frog381': 'Maybe the dev should release all the game files to the community that way its will actually be finished..', 'lucker5432': 'people who support this game... you have no idea how many people laugh about you histerically\nthe fact that this joke youtuber is reading that shit to you since 1874 shows what the community has become over the past years', 'Mr Pirate': "So basically they've dropped a pile of promised features to bring out cars and base building... Maybe then they wo t lose to scum lol", 'Jammet Leopard': "Thanks so much for the Status Report! All the Love to you, Septic Falcon! :D I'm feeling a bit down about some details, like Paul does, but hey, I've been playing this for 5 years, so ... I can play more. :) They did write that all weapon types are represented, but that isn't the case. :( Neither the Blaze, the CRC nor the Winchester are in. It was typically my overwatch position to have one of these. I cannot even find binoculars now to do something similar. And the scopes that are currently in the game now, aren't close to what that used to be like. I also love fishing. And my friends and I  --we need farming vegetables, because we enjoy giving away to other players.", 'nonickname100': 'Basically, what I said 3 years ago is happening. That the 1.0 will eventually be something like fckin 0.65 or such.\n\nAlso talking that the BETA is mainly for adding content not mechanics... climbing obstacles it is not a mechanic? Helicopters? No bikes or bicycles? Bows/throwable items are not new mechanics??? Huh?????? Damn you really. "Devs"', 'Local Yz': 'I want to see cars, an being able to make a base on xbox version an pc , with making it more stable an add more spots on the map if possible non of that beta junk', 'P R I E S T': 'Just let this game die already.', 'CarlJC MJK': 'They jst took too long to develop dayz sa lots of players moved on based on pure lies from the devs am glad I stopped yrs ago playing .', 'DankTube Pooper': 'Is there literally just one person making this game? because it bloody feels that way.', 'Galifré': 'That pronunciation of beta is horrific', 'Diamond': 'So is the map like a button you press in Arma and everyone has one off spawn or do you have to find one?', 'Idle Navigator': 'What a painful development process. 1.0 with so much missing. It’s going to feel empty. Why not just take a little longer to get that extra content in, after all we’ve all been waiting years now anyway...', 'Evan Cassell': 'Seems like good news to me, maybe because I wasn\'t fooling myself in the first place. They\'re focusing on getting some things done first, then go to the other stuff, seems like it will get done at the same overall pace, just in a different order that honestly makes more sense. Well, that and their definition of what constitutes "beta" and "1.0" being redefined but really, it seems like something to quell the haters by getting the new tech and improvements to stable faster, then adding all of the other stuff. Doing it in a different order shouldn\'t really impact the overall timeline. Idk, maybe I missed something, the reason it almost seems good is because.. if everything from experimental and the latest stress tests were optimized and put into stable, i have like 6-7 people waiting for my word on when the game will be worth their time, because they don\'t have the patience to put up with glitches, crashes, odd controls, and all the other things that come along with it being in Alpha. If those things were stable, I\'d finally feel comfortable telling them that its time, that its far enough along that they will have the dayz experience they\'ve been craving.', 'chance linford': 'Beeta', 'Gaijin Senpai': "I actually have a CZ 527, and that is a great little light rifle. Quick, accurate, and light. I think it's neat that it is coming to a game.", 'Rick Bailey': '7 years later', 'LastNickLeft': "We've invested all time and resources in vehicles! But you get no helicopters... Bohemia, I'm very disappointed. BI made Arma 3, my favourite game and one of the most complex games I've ever played.. BI also ... can't even say made.. BI is making the most disappointing game I will not get to play for a while.", 'George Shaw': 'Granted it’s taken a long time but it feels like it’s taking shape. If they manage to release it in the year then that would give me a good confidence boost which I plan on playing around Christmas (if it’s out). At one point about a year and a half ago I was so pissed off about where dayz was and how it offered fuck all to what it did previously, it felt like a downgrade so I still feel a bit annoyed like most of the community who had left the game over the years. I feel modding will add a significant amount to the game and I feel their decision to postpone some content is justified by the adding of base building and re-adding certain vehicles which I feel will add so much to the game in the time being.', 'Bob Star': 'Bollocks.', 'David Poulton': 'I’d rather just play ARMA3 Exile with Ryan’s Zombies Mod on a number of different maps. \nWorking vehicles.\nPlenty of weapons.\nBase building.\nAI Missions.\nThey even have RP servers.', 'QAQ QAQ': 'i have 1035 hours in dayz, and sadly, dayz is dead.', 'Bob': 'I wonder septic do you still play Dayz?', 'TicTac': 'Is there beds to spawn in for thr bases', 'Kamijou Touma': 'thanks for the info, nice video, i hope they put back ragdoll on the game, cuz i love that feature, its made it more realistic and natural.', 'Ashton Horton': 'Sooooo, with vehicles being available are gas stations going to have the ability to refuel cars or am I gonna have to scrounge and syphon fuel?', 'Jimmy Turner': "Damn I remember all xbox players acting like I was a dick when I said it's never going to get finished.", 'Michael Allen': 'They’re could still be the groza, m249, and scout rifle. They didn’t rule them out', 'nnekitt98': 'so this year, huh?)', 'Clay Nitram': 'This is like polishing a turd.... you wind up with a shiny turd.', 'GingerBreadMan': "You have what is called a Beta stage for a game and then you have what the Dayz development team calls Beta stage for a game. (Screws up his face)\n\nI have to say at the beginning of the year 2018 I was very optimistic for the future of this game and hearing comments like “beta sooner than you think” and “2018 the year of dayz” I was looking forward at what was coming. So I waited... and waited.... and then I waited some more but nothing seemed to be forthcoming.\n\nMy brother predicted this very scenario at the beginning of this year. I however was a little slow, I only caught on to it around May. I don't know if the dev team is at fault, or whether it just might be the engine they are using. I mean how hard can it be to put a weapon in the game? Everything they need to add  just seems to take an absolute age to implement. Can the engine really be that bad?\n\nThe comments for this game have always been fairly positive and just this year that position has been shifting to a more negative stance. Most of the comments here are negative but we are still here to comment because we want this game. I am just not sure we will get it.", 'MrDirtyDeedz': "It's funny, people sat there and complained the entire time the game was being worked on about how long it's taking. Now they tell you the beta is coming but you're all still complaining. What a toxic community man, I tell ya. I applaud the people who actually contributed useful information to the feedback tracker. Everyone else who did NOTHING useful and just bitched about everything, go fuck yourselves. Rome wasn't built in a day, it takes time to create a masterpiece.", 'Pędząca Sałata': 'Is beta out yet?', 'S C A V B O I': 'I wonder what the song name he uses is...\n\nGreat video, as always. I always get excited when I see a new video from ya :)', 'Łukasz pokoju': 'To give the illusion they fulfilled their promises to the community about 1.0 deadline, devs drastically cut the 1.0 content, to be able to release it" _on time_ " . Again workarounds and shenanigans... \n\nThe way they strung the community along multiple times is appalling !', 'Mav"Doc"666': 'This game is dead', 'Smail Galijašević': 'gotta love it :D', 'Cesar4000 PT': 'Little bit sad but U know it took a lot off time next year will be DAYZ \n#Dayz\n#wemustbelieve', 'Sparhawk': "Tiz for sure disappointing but I've grown a custom to it ;) magnum ftw, great content as usual Mr Falcon, keep up the great work, looking forward to seeing moooah!  TTFN <3", 'Jacktorious': 'Weeks not months.', 'Jordan Elliott': 'They literally don\'t remember the guns so they just put \n"all other weapons in .62 " LOL  idiots. At least look up the guns you implemented into the legacy versions. AT LEAST', 'Markillie Manxman/Vorta': 'have they mentioned farming? when can we start growing stuff again?', 'Radek Soci': 'lol best things moved to POST 1.0 WHAT A FCK.IN SURPRISE RIGHT? HAHAHAHAHA we think basebuilding will be enough END GAME... WTF? Oh I forgot this game is in alpha only 5 years.... release your broken featureless beta this year, everybody knew that it will be thisway anyways... useless devs!!!!!!!!!!!!! oh and I forgot THIS IS THE YEAR OF DAYZ :D:D:D:D:D:D:D:D:D:D:D::D::D:D:D:D::D:D::D:D::D:D:D::D:', 'Eric Burke': '>bows\n>completely new\nwhat?? who remembers when they added bows like over two years ago?!!! Honestly this game is a fucking train wreck. I really hope it is playable within. is 0.63 even on stable yet? and dont get me started on the fact they released this game (FOR MONEY) on console before its even ready. I love the game but goddamn i hate the people in charge of it', 'lawAMVs': 'beetah', 'Northy Park': 'As other people say, I am not mad, but just really dissapointed. MODDING really have to save this game for me.', 'Fattest White Guy ever': 'The only thing I care about is the refund option at 1.0.', 'El Cid': 'basebuilding when?', 'Andrew Darbey': 'Sounds like the status report from last year!', 'Erick S': 'Whatever! All the magic will be in Mods.', 'Abdel Malik': 'Liked the video before i saw it 💪🏽', '007alvareichon': 'https://steamcharts.com/app/221100', 'Juggernaut9631': 'bullllllshiiiiiittt 1.0 isnt happening this year theres no way. youre telling me they will release beta, fix the bugs AND add all the missing stuff from .62? yeah keep dreaming they have 2 months left to do all of that which includes december and guess what is in december? christmas so you can pretty much take away half of december because people will be on holidays 1.5 months to do all of that? doesnt sound realistic to me but lets keep on waiting better expect worse so you dont get disappointed', 'ElektroBandit': 'Just like the TRMZ said, old players will come back and see that it’s still not where it should be and that might be the last time they try.  I’ve already seen a terrible comments section on PC gamers article.', 'Kai Palfreman': "They're bloody rushing it. All they need to do is wait until the game is fully compatible with all its proper intended and important features. Instead of rushing this pre-2018 deadline just hold on. If they release the game like this its going to flop. If they release it how 1.0 was intended to be released and then put it on a free to play weekend and on a sale on release. It would not only bring back old players but also bring new ones.\n\nThen they can start tweaking and adding minor things and have the modding community help out.", 'Garr3tt': "It has became clear to me that Bohemia Management/PR has ruined this games future, slapping '1.0' on anything with less features than .62 honestly doesn't seem moral. I still have faith, they are going to at least release the modding tools and then the community will put everything in quicker than the devs ever did,", 'Amperu': 'Well i guess ill play dayz after 1.0 content update..', 'J.': '"we\'ll just have to wait and see..." how many years have we been waiting and seeing now? >.< it\'s getting really old that sentence. Great review as always SepticFalcon.', 'Curtis.E Flush': "that's a shame. another over promised under delivered target missed. i've tried to remain hopeful. alas, i'm done. i've gone from 12 subs to streamers to 1 remaining. the boys that cried wolf springs to mind..", 'bobnab': 'why did you sound like a retarded robot today wtf? love what you do and more peeps need to click the like button its not hard. is it the tash fucking with the voice? lol sort it out before you choke on it .', 'Toxic_Dragon': "I'd rather have climbing / mantling than base building.  I'd rather have vehicles that don't ice skate on dry roads than base building.  I'd rather have helicopters than base building.  SCUM is passing you by DayZ team.", 'Mark Brown': "Septic falcon you are one of the only people whose opinion i respect regarding dayz and i would like to see if you agree with me on this point.The single biggest mistake the dayZ development team ever made was not adding a rideable bicycle as a very common item, within the first year or 2 of development.The reason i say this is because the vast majority of the 40K players that played dayz only played around the coast because it was simply too time consuming to go to the northern parts of the map, and if they did they ONLY went to an airfield or high military loot zone,effectively making roughly 40% of the map PURE DEAD CONTENT.Dead content that makes the game harder to run.I feel as though the devs were so prideful about their vision for dayz and what it would be in the future, that they never bothered to atleast make the CURRENT BUILD OF THE GAME more enjoyable to play, there was very rarely a quality of life change, and yes i do understand how game developing works regarding alpha and beta stages, but the fact that dayZ's player base wnt from FORTY THOUSAND to eighteen hundred, maybe its time to throw the playbook out the window.I am 100% CERTAIN that if that simple change was implemented, dayz would have a significant more amount players on daily.Sadly enough though its a case of too little too late.Not to say Dayz is dead but its certainly will never be the sensation that it was, a damn near social experiment of a game with 40 thousand players.They had the chance to be something more, and their vision for the future blinded them to the problems of the present.\n\nI know that's allot of text but if you could give me you honest thought i would really appreciate it, i am very passionate about dayz as i've been playing since the mod was in its infancy in 2011,its been a big part of my life and i am saddened at the current state of it to say the very least.It is nothing like it once was,its as if the game devs are seeking a different audience than the one that gave DAYZ its name.", 'David Herron': 'I am sorry but i can not empathise with some of these feature trimmings. \nwhat kind of game devs can not change something as simple as doors opening both ways ? weird.\n just make modding tool kits and let the fans sort it out.', 'Mr. Valentine': 'What are you all talking about this is the best update coming out to dayz you all sad ):', 'DotaSkilleR': "i'm not that angry… i just hope we will have a polished dayz standalone 1.0 one day… i dont care if thats sooner or later. they are still creating the best survival game out there imo.", 'Joshua Freezen': 'will definitely miss the helicopter, was always the thing i strived for in dayz mod', 'MrCabbuge': 'I want my guns :(\nI loved finding all differebt kinds of guns, ammo and then going to a specific spot and shooting the hell out of them. Loved those sounds', 'Barry G': 'I’m going to wait till the asshats get this done.', 'HZ Mike': "Well... That's the worst status report of all, but at least it's honest. This time Dev team stopped lying about how they'll finish the game in no time. Only good news is they will add some modding tools for us to finish the game ourselves :) I can't help, but feel they will abandon DayZ for good and leave it unfinished and dead just like that.", 'GumGum': 'LMAO this is a meme now. They really started good and now they fucked it up again.', 'Rory Wood': 'might as well put it back in alpha', 'mjkulikow': 'I love DayZ, but at this point their results are just laughable.  I will continue to play, as will thousands of others...But you can\'t tell us not to be mad or that this is not a failure.  "Weeks not months" - 8 months ago?  FFS doors still opening the wrong way?', 'Henry Billing': 'When the beta is there the game will come for ps4... I watch dayz since 3 Sears in YouTube but i dont habe the money for a gold PC but now it will come for ps4 dream come true😫😫😋✌ PS: sorry for my english i am a german guy 😋✊', 'Ragnarok85': 'Going into 1.0 with far less content they had years ago. Incredible.', 'BlackNeverLeft': 'Red Dead is out in 2 days...🙂', 'ZiMRA': 'lol standalone came out 2013... its 5 years later and nothing to do.. game is dead..', 'Wunn Sen': 'Wait so just to clear up, they arent adding the Red 9 and the Magnum and such? or they are just not yet?', 'Harleyy': 'they just executed their game lol', 'Max Pol': "I own this game since the very beginning and haven't play it for years but I would be ready to buy it again for the version of our dreams.", 'Deadly_M': 'I hope we eventually get a fix for the magic indoor lights that are always turned on in DayZ,\nfor example, if I go into a shed or bunker and shut the the door I want it to be dark.', 'Aleksa Kovacevic': 'Geez, their status reports are so boring and they always dissapoint people', 'Simon Kraemer': 'What\'s the opposite of: "I am very content with the game, its current state and future as well as with the work of the development team and i definitely do not regret having paid actual money for alpha in (... thinking pause) 2012?"', 'Andrew Escocia': 'Septic at this point you are making status reports for the dev team not the fans. you are the radio DJ in Hitler\'s bunker, "one more counter attack and we will push the Russians all the way back to Moscow"  Games fucked, the devs pissed away about 2 years making meat tenderizers and farming and tinkering the map to death but can\'t find time to get ragdolls (i remember being blown away by ragdoll in unreal tournament 2004)  and talk about doors opening away from you (Scum has this allrdy) like it\'s a "Jesus feature" that will bring people back to the game.', 'Bud Man': 'Wow they are so bad'}{'PhishyBongwaters': "I don't think anyone wanted a minimalist dayz and that's what 1.0 will be.\n\n 2 vehicles (if they get them working proper, stress test seems to indicate we're on step 2 of 18), a literally pitiful assortment of guns, absolutely no reason or gameplay loop outside of run to closet mil base, get obligatory m4 + akm maybe SVD, equip obligitory outfight as some of the weights for clothing are clearly made by aliens that have never experienced gravity.  I'm sorry, but look at lean and jump and tell me that shit is ready.  Look at the 4x4 nose down into the ground rolling around like a spastic kid on a sugar high.  Look at the... THREE civilian weapons.  Look at the absolute lack of broken legs.  Climbing?  they've literally already done the mo-cap and bone animations for climbing with the zombies like a year ago.  \n\nI love you Septic but I can't find anything positive in this SR other than it doesn't say they've all quit.  And I hold zero hopes for post release content outside of modding.  I don't want the basebuilding, that's the part of the mod that I hated.  I could care less about the heli.  But there are some huge feature gaps that take 1.0 back to god, I can't even find a build that devoid of features.  I actually can't", '- DIKKII -': 'So the only thing making it into beta 1.0 is the Title (beta 1.0) lol. And not a single mention of what is planned for zombies.', 'Uwanda Roberts': 'This status report is just depressing. The full release will be shit with stuff missing. Maybe they should not of been pissing about going to meets and stuff when they have such work to be done. Starting to think there all lazy stoners.', 'HeadBob GunPants': "I can't believe the negativity here... I've been on the verge of walking away from dayz. The new stress test stuff looks absolutely awesome.", 'KCT-Ibi': 'Lol "we look forward to any feedback"  y\'all dont do shit with our last 5 years of feedback. Even this patch isnt What we asked for. What a joke, and What a shame', 'Dan Dănuț': 'i lose faith in this game a long time ago...', 'bws': 'the reddit page is absolutely blowing up over this', 'JL Chamberlain': 'Will there be modding for the Xbox?', 'SpookyPal': 'I know what would be cool. If when a player dies (not shot in the head) the player becomes a zombie.', 'Haris': '5 years to get from alpha to beta 0 years from beta to full release while the game is still broken and content was postponed', 'Pascal We': 'Average players is under 2k... this is very very bad', 'Jiří Dušek': 'So the whole idea was that contnent adding will be done before beta and beta will be just bugfixes and now thay posponed content past 1.0 Well correct me if Im wrong but then by definition it is not 1.0 I mean did they just claim they will turn alpha into 1.0 only by naming it 1.0? \n\nI guess I should not be suprised Arma 3 also added singleplayer campaign after its release.', 'Mantas Išganaitis': "Like if the content = gameplay. I'd say content doesn't have that much gameplay impact comparing to other things.", 'OSH': "Well I predicted this like I predicted that 0.63 experimental will not come out before Q2, that they will release xBox game preview during GamesCom, etc..\n\nThey're just behind minimum 2-3 months on their own internal developement plan.\n\nDisappointed. I want my bow.", 'Grumpy_Palpatine': 'I just want my SKS with PU scope :(', 'InfiniteWars': 'Wait to see they will throw all this shit together and go into beta no matter how good it works ;] or else its next xmas when beta will get released lol', 'Anej Lasič': 'Its funny how this devs just dont give a fuck.. But the hilarious thing is how players stil believe and protect them. I have 1200h in dayz, was playing since the mod days. I was here from the release, whaiting, hoping.. and everytime they anounced something new to come up, i was hiped, but they disapointed me everytime for the last 5 years. It was stil good fun, but enuf is enuf.. Lets just all admit that the Dayz devs are simply unprofesional, incompetent, careles individuals that probably play ping pong all day living off of our money.. If i  became the project manager today, this fucks wouldnt be leaving the offices till what was promised had been fixed and released... or else they would be fired.. Simple as that.. I cant believe a company lets their employers be such unprofesional cunts.. They are shading a bad light on the entire company... I wonder why they are not yet fired...', 'Ling Long': 'I fink it is going to be the best update dayz have ever seen', 'Sam Fagence': 'The meta game of Dayz is whether it will actually ever be finished or just abandoned at launch', 'Zanlam': "Looks like we won't be getting bicycles or motorcycles either though", 'vibrationNC': '"Further Development" ?? 59 months!! OMFG! I know other games dont meet the genre.. BUT OTHER GAMES are fucking further along! MORE FREQUENT UPDATES and PATCHES!! MORE CONTENT!!.. WHAT in the actual fuck are the devs doing?? ITS NO SECRET.. I HATE that Hicks loser!! I personally think he ruined the direction and progress of dayz!  BUT now he is gone.. and its like.. a fucking empty promise every week, every update.. next time next time next time.. LOOK IT DOESNT MATTER what type of game it is.. SHooter, survival, candy crush.. ITS A FUCKING GAME.. AND these DEVS HAVE COMPLETELY DROPPED THE BALL! YEAH, I AM PISSED... I have 6300 hours in the game!! I have spent hours and hours an hours..  dealing with glitched, bugs and hackers.. the lack of loot to too much loot... lag, privileged streamers only invited to servers.. Hicks himself on the BANHAMMER BUTTON.... I have every right to be pissed and criticize the game.. Im not some 200 hour fortnight Johnny little fucker screaming "Get Gud!!"  Its a JOKE! Dayz has turned into the laughing stock of development!  ANYWAY..  I hope they give us a game that is equal and or better than current games.. But little over 2 months to do so.. hahahahah NEVER WILL HAPPEN! I will say one thing... Ive meet a ton of friends, awesome people some of the likes, Mr.B, Jam, Tope and TRMZ.. plus alot more... I will never forget that... but IMO Dayz..is done.. its a sinking ship... LYLT DAYZ.. but.. but but.. but..but...but(Kinda like the status reports..... never ending!) but, but but but but... GG', 'Brent': 'if they would stop worrying about adding fucking muchrooms and other shit that noone cares about maybe we would have a finished game by now like seriously how can you not have cars yet but you have rework all the major cites and airfields and added like 40 plus tree types in the game', 'Naiden': '" we talk about weeks, not months ! "', 'Dallas Van Winkle': 'omg! Are you saying DayZ will not be complete in 2 months?! Truly shocking!! No idea how people are surprised or upset about this "news".', 'caddi1991': 'no variety in firearms ? wow so still boring playing this game and looting... WHAT is an AKM now ? Nothing special you get it....', 'PublicVoodoo': 'So its now announced that 0.63 is a polished 0.62 but without alot of features. Well im not surprised, weve all asked for more items and mechanics over the years and it would be stupid to think the devs would actually deliver. I miss my bow..', 'Freddy Löbig': "I don't really care for some of the features that were promised yet won't make it into the 1.0 release. But, what really really disappoints me, is that features got stripped out that were in before. What about horticulture? What about dyeing stuff? What abut the V3S? Those things were in before. I fully understand that those things need to be re-done but wouldn't it do less harm to the game to simply postpone the 1.0 release and get all the features done instead of simply re-defining the content-goals? I already feel sad for the hard-working devs who are definitely going to get a lot of sh*t for management decisions they aren't responsible for. DayZ has alwas been promised to be an extraordinary survival game. That's what kept it alive. Releasing the game without core survival features such as fishing, hunting with a bow, horticulture etc. is a big let down to the loyal community. Unfortunately: Damage is done, there is no going back now I guess :(", 'Neck Twister': 'DayZ is the only game I know that would actually go from .63 to 1.0 with less features and content. I think at this point they just need to let the modding community do what they clearly don\'t want to do. I can\'t imagine how hard it is to work on a game but I really think this community deserves a hell of a lot more than what we\'re getting. I understand that working on a game is hard but they\'re pretty much saying "fuck it we\'ll fix it later" I really love this game but I really hate that not one damn patch in 4 years has done anything but make the game look prettier. They\'re making all these map design changes that nobody asked for instead of devoting the time and resources to fixing glitches and implementing ALL features and content from previous patches into the 1.0. It\'s a shame that one of the best survival games is in charge of such a careless company, I expected a lot better from them after what they\'ve been promising but then again it\'s the same song and dance for the 5th year in a row.', 'Dajukeboxguy': '"beta is regarded as a product that\'s feature complete it\'s true in a sense that the beta will have all the features for it\'s core gameplay to work"  OMEGALUL fancy way of saying it\'s good enough and we can\'t do more lul', 'Sappy-Seaman': 'There is no guarantee that any of the content they promise will be delivered after 1.0. It has been too long.', 'White Folk': 'So when will the “Full” game be released for consoles...', 'Toves Plays': 'No bows, and no fishing... Disappointing shift away from "survival"', 'Oscar Muffin': "I started playing Dayz after it was released about 200 hours and a few weeks later I dropped it because there wasn't really much to do. A few years later after seeing everyone raving about how 0.63 is going to revive the game I decided to give it another go yesterday. To be quite honest, apart from looking a bit better and not having massive lag spikes, desync, terrible fps, not a whole lot has changed. You're still running around, starving to death and finding a pathetic amount of loot. But now there is nothing to use your gun on because in two days I have not seen another player at all.", 'Stanco187er': 'JUST GIVE ME ALL THE GUNS FROM .62 FOR FUCK SAKE DEVS...', 'Aussie Cleetus': "If they're not broken, they need to just release the tools asap. The community will make the content they failed to provide and save them months of work.", 'Tom Cripple': "Postponed content... Isn't that like the entire DayZ Experience? :)", 'MitchieBTW': 'I hope we will be able to steer the vehicle with the mouse like we could in every arma game', 'Yolo Mach ich auch immer': 'This vid sounds like x-files', 'Joey': "I really miss 4 years ago. I was a high school freshman only playing with online friends bc like no one I knew had a PC. \nI would wait every 2 weeks to see the status report review you would do, and I'd walk home so fucking fast just to play dayz.", 'Alex Ander': 'Its amazing how they will deliver the game finished by 2020. I solidly believe that. They needed 5 months only to implement cars. Now 6 months for helis and 6 more for climbing and meanwhile general polishing of the server-client comm. This is a huge dissapointment for us all. And we all wait to play it once when its done. The most delayed game of the century', 'Caiden Green': "What about Xbox.anyway I just subscribed I saw this video and thought that this is going to be a good way to stay up to date so I can't wait  till the next  video keep doing a good job😁", 'eccoJAM': 'Are you paid to promote this game? Serious question.', 'LORD Lordy': 'PS4 when?', 'Roy Moreland': 'After 6 years, this game will finish with less than it started with. I don\'t expect to ever see those "postponed" features. They\'ll drop what they\'ll call 1.0 and that will be it. I can\'t see them suddenly turning out quick and efficient updates AFTER 1.0 when they were never able to do so BEFORE. With H1Z1 shutting down tomorrow, I can\'t help but pick up a similar odor here. I\'m not saying that they\'re driving nails in the coffin yet, but it sounds like they\'re lookin\' for a hammer.', 'Johnny369': 'We just need stable 1.0 and modding tools. Mods will make this game great like they used to do with arma 2.', 'TheVibeMagician': 'even a 1080 ti will lag with this game, i find this game unplayable. did the devs ever play the mod looks like this game has been made for 5 year olds', 'Björn Dahlberg': 'Is it just me that yells TRAITOR when killing zombie Dean?  xD', 'DuhOneZ': "Whoa that was a lot to take in. No helis :( that's alright will make more meme mods while we wait :P.", 'Jacob Lahaie': 'What about farming?', 'Austin Youngerman': 'SAY IT! DAYZ IS DEAD', 'KRJ _Drama': 'Electricity system on base building whaat? Bro..This is so interesting', 'Nathanielk 04': 'Can’t wait for helicopters :]', 'Dillywang Onions': 'Beta is cancer', 'BigDawg Cleveland': 'Will we be able to use the new Cherno map in Arma 3? Thanks for the updates brother Falcon!!!', 'Chyle Vance': 'Rag doll.', 'xCLARKxKENTx': 'dayz probably will not be as popular as it was when it originally released i think peaking at around 45 thousand unique players online at any given time, but i have hope that it can be a game that i can be happy to put another 2000+hours into i miss dayz and have recently started playing again and even tho its only in experimental .63 it has brought life back into this game for me. hope to see all from 500+meters through my sniper scope happy looting all!:P', 'Jack Severity': 'What has the gaming world come to! how can they release it as 1.0 and think its ok with so much stuff out of the game. This was the ONE last chance Dayz has at bringing people back. Im sure there will be many people come back and try the game again and im sure we are going to see youtube full of "Dayz 1.0 LOLZ" there was so much more in the game in .62. LEAVE 1.0 until everything "most things" are back in the game. It feels so rushed or forced. and who says after 1.0 hits how much more content we are going to get?? We can all sit back and say "Modders are going to save the game" which they probably will but we didn\'t pay modders for the game. Its the Devs job to get this game back to the glory it once was, not modders. Please Dayz don\'t release 1.0 until 99% of the features are back in the game. Its your last chance to bring back people when 1.0 launches.', 'tee mu': 'So when all of this is coming?', 'Furoki': "I feel like time spent developing doesn't necessarily translate to better quality with dayz devs. They just slow in general.", 'HORSEDICKoMPEG': 'the new engine was "Going" to make new content and things faster and more streamline.. its like the engine is built to work literally against them. release the modding tools so the game can become the game it could be for free at the hands of people who will work on it as a hobby and surpass the actual dev team, whos JOB it is to Dev a game ... but cant..', 'Oxford Trenter': 'The Vehicles needs more weight.', 'satan spawn': 'So when will an actual update release?', 'mathskzha': "they can't do genades or bows? Also fishing better be something more substantial than a text minigame if they can't do that", 'Dwayne P': 'In the future we will be saying,”And it was at this point,Scum took over survival genre”!', 'DreamZL1': "Let's keep in mind they said all of this will be in the 1.0 release that will be out THIS YEAR. Getting to that milestone is huge, and after 5+ years...I can wait a few more months for the things they left out to be perfected. The current physics of vehicles are so bad I'd hate to try flying a helicopter anyway. 2019 looks quite promising for everyone in the Dayz community both vanilla and moded flavors.", 'Mykeyboy': "Can't climb over obstacles ...ok but remove The Infected climbing over walls...Right?? Love your vid's Septic, been away for work and cant wait to see more streams !!", 'BudVision': '"postponed content". What else is new?... sigh... was really looking forward to using the heli to deliver christmas presents to all the good little Chernarus boys and girls... look\'s like Santa\'s takin\' the V3S this year!', 'System Of A FoX': 'So we are still getting the missing features and content later in the future after 1.0?', 'Romanes Eunt Domus': 'I think they covered the most important features to make it a fresh experience and spend some hours in DayZ again. I dont care what they call this update and all I hear is that Im going to get cars and base building THIS YEAR. The best days I ever had in DayZ were back in Origins mod on a private Server with about 20 to 30 people playing regularly divided in probably about 5 teams across the map. And i think the SA is now way better than Origins mod ever was and is only missing something to do besides gearing up and getting shot. I get why u guys are making those long faces... but im still thrilled about this next big update. Im a glass-half-full-guy and I spend about 900 hours in a 25 bucks game. I saw some bases on reddit and I really want to build something like that with a couple of friends!', 'Пенсионер': '*Нихуя не понял, но очень интересно*', 'HaloMC1171': 'The little devs that couldn’t', 'Squimp': 'This cookie has fallen apart in some expired milk', 'DrJosh': 'Bows are more important then helicopters', 'Zero': "Wow, who would have thought that they wouldn't deliver like they promised. Again.", 'SuperTyrannical1': 'They should add roaming ai who kos like some of the mods. And missions like downed helis with a lot of loot guarded by the military clean up crews.', 'IsleofMAN': 'Bita Op', 'Joseph Edwards': 'Problem with a polished turd, is it is still a turd. Yes they will make it into 1.0 finally.... Well lets just say it this way they keep taking stuff out, now they want the modders to finish the product they failed to fulfill their promises. End of the game, a polished turd still a stinky turd.\n\nThey really dropped the ball, hard to say you have proper working features of a game, when you are not releasing the "game" you promised.', 'OMEGAthinker': 'JUST LET MODDERS DO ALL THIS FOR YOU', 'Heruzu': 'Namalsk anyone?(@￣ρ￣@)', 'Official NoWorries': 'Luckily modders will have the game finished within 6 months of 1.0 dropping', 'Sunny_Rayz': 'I just want more pve stuff to do, gathering and hunting can only take me so far', 'Marcus Elgart': "Probably the most depressing status report in a long time. They really let this games hype die so many times. It'll still be a good game ...by next November...with gamebreaking bugs still...and the hype will be completely gone to other games. Why cant devs admit they didn't do it? They failed to deliver actual beta in 6 years of alpha. I know im a negative cunt. Dont expect my gripe to be the last or the ugliest at all. I'll be back when its actually beta. Long from now", 'Side Quest NPC': 'Dayz postponed? Well now I’ve heard it all.', 'MinersLoveGames': 'Modding will pick up the slack.', 'Jack T': "They're excluding all of the fun and personally cooler guns and bow on the launch, they need to be quick cause fuck everything not making it is the shit that makes the game enjoyable.", 'BBk': 'Omg dayzzz fokiiin good', 'DISWAYonDISPLAY': 'love your breakdown of the reports pal keep um up!!', 'Connor Thompson': 'Are they joking about all the guns?', 'CartoonrBOY': 'I must be tough as the developer, maintaining momentum amongst so much negativity. Keep at it guys. It will be great when it is finished.', 'Mike de bakker': "let's just hope that as soon as the beta hits stable, there will immediately be rapid fire content updates to get all the stuff back from 0.62", 'Philip Jensen': 'oh boy didnt see that one coming. classic dayz', 'Joe Morales': 'Am I the only one that thinks the devs need to just give us more mod tools and finish all the shit in the stress test and just leave!! Let us finish the game because we’re the only ones that care!!', 'Kevin Staley': 'I actually feel sorry for the dev team. Its embarrassing', 'Antykain': "Even with some of the high wanted content and features being postponed, I personally will think that the wait will be worth it.. Soon enough the DayZ community will have the game we have all been waiting for.  One of the big things I am really looking forward to is seeing what the modding community will bring to the table for us in DayZ.  The current 'mods' that are available are just the beginning.. a lil taste of what's to come later down the road.  A road that I am going to continue traveling down..  \n\n@SepticFalcon Hope you get to feeling better bud!  Awesome job on the Status Report, as usual!", 'DerekSniper30': "Beta... I'm sure if it's a EU thing to say B-ee-ta but for the rest of the world it's pronounced B-ay-ta", 'wonderland78': '"we\'ve arrived at a decision, that you\'ll have enough fun without helicopters. Fools. Now go and play your end-goal-less game."', 'Biddaman85': "Oh well, I'm still having so much fun with what we have now. So, I'm at least thankful we have what we do and not getting this news while still on 0.62.  But still, I miss my SKS.  I think I want helicopters, but that is just a machine that let's everyone know where you are. I would rather run and be unseen than fly and be out on display.", 'Top Secret': 'dayz is still dead'}{'Basil 2.0': 'beeeta update', 'james bryant': 'Literally nothing happening for console release this patch.\n\nI guess this is a big drop for pc so they want to make sure it works but we could really do with a day night cycle sometime soon.', 'JoeyShitHead': "So in short, we're continuing on working on the core game play functions like we have been for the last 5 years.", 'declan long': "TBH Falcon I'm just happy we are getting close to release. I am one of those people that played the game back in DAYZ Mod when it first came out and seen the potential. \nI am a Core Arma player @ heart and that's my background and If I am honest I stopped playing DAYZ about a year and a half ago to let it develop, however I have always keep up to date with Videos from you and other guys.\nOnce the Beta goes to stable I'll be back........\n\nEnjoying your content keep it up dude,\n\ndeclan long/ Wolfhound", 'Captain_Bigzy': "Dont care too much for helicopters right away as they are very much an end game thing but I was hoping by beta we would see more than just an offroad and a V3S,  wheres bikes and atv's ?  As for the rest they need to get fishing and bows in fast IMO... None the less looking forward to Beta and to see how  the future of DayZ pans out!  :)", 'Hobo': 'Same shit different year good job septic keep up the good work as always', 'Dustin Blane': 'So is it updated or not?', 'Perović': 'Yes they will relese beta in 2018 but with half broken stuff not working or not in game it will be full of bugs.  Year 2018 is year of dayzi. 😅', 'Brotato Gaming': 'Is there map expansions?', 'den danske ulv': 'Are u fucking kidding me. They keep promising things but always let us down', 'Zipp085': 'Just read the comments for the "gaame iis deaad" children :D', 'RagdollRalph': 'WHAT!? Dayz dev team has posponed game content. Well that’s a first! xD', 'major break 2': "If there's a trader server I'm redownloading", 'XxBo0m H3adSHot': 'Can’t wait for beta 👌🏼🔥', 'Jacob Prinkey': 'I’m hearing a still unfinished game that’s still gonna leave a lot of people with a bad taste in there mouth', 'BoostedZ6': 'BEEETAHHH', 'Elliot Stenberg': 'Just me that wants the DMR or M24? Would be cool if they would be found in weapon cases as they do', 'extraplain': 'Delays? Setbacks? No one expected this.', 'LastMan': "I love DayZ and love these Status Report Highlights but the feeling of disappointment is clear for all. I'll wait, just like all the veterans and lets hope the light at the end has been worth the wait.", 'Ironside32': "I'm not angry... I'm just disappointed.  ;)", 'ShamSharks': 'At the very least I believe it is reasonable to implement the items that were in 0.62 for the 1.0 patch. This includes all the weapons we previously had and all the vehicles we previous had. Its a bit of a let down but as long as we EVENTUALLY get all of the features it will be fine...', 'h0llow': 'In short "We don\'t know how to do: Ragdoll, Helicopters, Throwing, Guns(Srsly?) and etc, but we will try". Very optimistic report for a game that lost 90% of it\'s audience. They didn\'t even teased us with new stuff, didn\'t even showed gifs/videos from internal testing, they didn\'t even tried to make this report at least somewhat positive.', 'Flex': 'I dot usually comment on videos but you give me hope for DayZ with constant content on the new updates for me without having to do my own research so thank you!!!', 'ThePope OfAwesomeness': 'But but but I want to crash and kill my friends with my horrible flying skills', 'Cas': 'Its not what you pc players had or us xbox players would be happy with...PC will suffer the most.', 'gama103': 'What a letdown', 'SepticFalcon': 'Of course, I would be lying if I said I was not disappointed :(  - I want that content booiiiiiiis', 'JamesHetfieldIsGod': 'FIRST!', 'TopeREC': 'I love You man but even You cant make a bad status report look nice :( God bless DayZ', 'Buddy The Borador': 'Beeta 🐝', 'n3r0wolfe': 'what is this.. why is there a new video in my recommended feed?  if youtoobes finally getting their act together?\n\nprolly not', 'Wilmson': "Yeet Jason. I'm in bed right now, that was a really good bed time story. Can hardly believe it's finally where it needs to be to be awesome again. NEAT-O!", 'Mattydc1808': 'Last'}{'Basil 2.0': 'beeeta update', 'james bryant': 'Literally nothing happening for console release this patch.\n\nI guess this is a big drop for pc so they want to make sure it works but we could really do with a day night cycle sometime soon.', 'JoeyShitHead': "So in short, we're continuing on working on the core game play functions like we have been for the last 5 years.", 'declan long': "TBH Falcon I'm just happy we are getting close to release. I am one of those people that played the game back in DAYZ Mod when it first came out and seen the potential. \nI am a Core Arma player @ heart and that's my background and If I am honest I stopped playing DAYZ about a year and a half ago to let it develop, however I have always keep up to date with Videos from you and other guys.\nOnce the Beta goes to stable I'll be back........\n\nEnjoying your content keep it up dude,\n\ndeclan long/ Wolfhound", 'Captain_Bigzy': "Dont care too much for helicopters right away as they are very much an end game thing but I was hoping by beta we would see more than just an offroad and a V3S,  wheres bikes and atv's ?  As for the rest they need to get fishing and bows in fast IMO... None the less looking forward to Beta and to see how  the future of DayZ pans out!  :)", 'Hobo': 'Same shit different year good job septic keep up the good work as always', 'Dustin Blane': 'So is it updated or not?', 'Perović': 'Yes they will relese beta in 2018 but with half broken stuff not working or not in game it will be full of bugs.  Year 2018 is year of dayzi. 😅', 'Brotato Gaming': 'Is there map expansions?', 'den danske ulv': 'Are u fucking kidding me. They keep promising things but always let us down', 'Zipp085': 'Just read the comments for the "gaame iis deaad" children :D', 'RagdollRalph': 'WHAT!? Dayz dev team has posponed game content. Well that’s a first! xD', 'major break 2': "If there's a trader server I'm redownloading", 'XxBo0m H3adSHot': 'Can’t wait for beta 👌🏼🔥', 'Jacob Prinkey': 'I’m hearing a still unfinished game that’s still gonna leave a lot of people with a bad taste in there mouth', 'BoostedZ6': 'BEEETAHHH', 'Elliot Stenberg': 'Just me that wants the DMR or M24? Would be cool if they would be found in weapon cases as they do', 'extraplain': 'Delays? Setbacks? No one expected this.', 'LastMan': "I love DayZ and love these Status Report Highlights but the feeling of disappointment is clear for all. I'll wait, just like all the veterans and lets hope the light at the end has been worth the wait.", 'Ironside32': "I'm not angry... I'm just disappointed.  ;)", 'ShamSharks': 'At the very least I believe it is reasonable to implement the items that were in 0.62 for the 1.0 patch. This includes all the weapons we previously had and all the vehicles we previous had. Its a bit of a let down but as long as we EVENTUALLY get all of the features it will be fine...', 'h0llow': 'In short "We don\'t know how to do: Ragdoll, Helicopters, Throwing, Guns(Srsly?) and etc, but we will try". Very optimistic report for a game that lost 90% of it\'s audience. They didn\'t even teased us with new stuff, didn\'t even showed gifs/videos from internal testing, they didn\'t even tried to make this report at least somewhat positive.', 'Flex': 'I dot usually comment on videos but you give me hope for DayZ with constant content on the new updates for me without having to do my own research so thank you!!!', 'ThePope OfAwesomeness': 'But but but I want to crash and kill my friends with my horrible flying skills', 'Cas': 'Its not what you pc players had or us xbox players would be happy with...PC will suffer the most.', 'gama103': 'What a letdown', 'SepticFalcon': 'Of course, I would be lying if I said I was not disappointed :(  - I want that content booiiiiiiis', 'JamesHetfieldIsGod': 'FIRST!', 'TopeREC': 'I love You man but even You cant make a bad status report look nice :( God bless DayZ', 'Buddy The Borador': 'Beeta 🐝', 'n3r0wolfe': 'what is this.. why is there a new video in my recommended feed?  if youtoobes finally getting their act together?\n\nprolly not', 'Wilmson': "Yeet Jason. I'm in bed right now, that was a really good bed time story. Can hardly believe it's finally where it needs to be to be awesome again. NEAT-O!", 'Mattydc1808': 'Last'}