{'ZombieCorp.': 'Diversity is NOT are strength.', 'The Dave': "So facebook is now openly admitting that they are interfering with foreign elections. I wonder who in Brasil had paid them for their help.\nStill at least it isn't the Ruskies you wouldn't want to have any interference from them they could influence the democratic results.", 'Mel Ba': '"Refute with evidence, not censorship"\nThat needs to become the battlecry of true intellectuals.\nIt\'s more important than ever.', 'MountainDew7': "Unfortunately science in today's age is anything but a search for truth. Funded by organizations and governments with agendas it's search is to confirm and validate certain narratives.", 'bluegreenash': "Don't they mean Social Justice Media Workers", 'spk1121': 'All Other Religions: Must feature the sacred texts & songs in order to be more *inclusive*\nChristianity: Must _censor_ the sacred texts & songs in order to *-exclude-*- them- be more *inclusive.*\n\nAt 5:03, notice they don\'t include the Saudis in this list. They have poured hundreds of millions of dollars into various "foundations" in the U.S. and contributed a great deal to Hillary\'s campaign. Do they want Trump or another status quo candidate who won\'t even consider going against them & just quietly take their money instead?', 'Dralor D': 'Please Please let Facebook fuck up in some way that can be proven. And hopefully the gov will use that to change FB etc as Media corps', 'Ten Minute Tokyo 2': 'Hi. no one cares, thanks.', 'Бя&doиe V': 'Libtards to ban the word "Jesus" in CHRISTmas songs sung by schoolchildren; sounds about right. Surely it was the children who were "uncomfortable" with it too. Facebook\'s anti-conservative policies are unnerving, and I agree, Trump should absolutely shut them down. I\'ll be checking out Minds.com! Well, despite the world going to hell, you\'re doing an excellent job of reporting on it.', 'Williamjames Hoffer': "We have already entered that dark age. Look at the transgender garbage. Look at the illiberal left's takeover of academia, media, entertainment, and business. Note how their ideology is faith-based: Believe all women. Facts are socially constructed. Science is white male. Etc.", 'Grim reaper': 'Oh boy, are they riding my balls. I have been banned for saying if you do not like our country get the fuck out on one video of a celebrity bitching about how he hates our country. Then on my other account, I was banned for saying take your pity and shove it up your ass that was bullying the other was hate speech. I am always constantly being banned but this is another level of asinine. The noose is indeed very very tight right now.', 'Lester Scates': "Screw secularism it's ruining the West!", 'Tripp Bond': 'Dave, when will you review the New Feminist Who', 'measl': '*Wow! A defense of the CERN guy coming from Wilfred Laurier Universtity??? The same place thattried to crucify (and accidentally made a world wide star) of both Jordan Peterson and Lindsay Shepherd???*', 'joey dubbs76': 'You really wanna know “how this is a thing”? Look no further than you’re local cowardly conservative/ republican representative & ask him/ her where their balls are?', 'Binks Webelf': 'Well said.\n\nThe Left/ Corporate machine/ Mohammedanism all agree: Jesus & his uppity ideas & followers must be crushed. Somehow, the West-- minus the actual spiritual life, truths, value for life, true freedom and redeeming of people-- will still march onwards.. towards.. something. That something is becoming clearer and clearer.. along with the blind obedience and soul-crushing force required to implement it.\n\nIn my area, the elementary school-kids were allowed to play Christmas MUSIC at a "Winterval" concert, but no words were permitted. Because reasons. Sad that an actual something (celebrating the birth of the Saviour) is to be replaced with less, or nothing (seasonal \'festivals\', diversity, empty symbols).', 'Tom Lauris': 'Just spread memes on Facebook, "Minds - the free speech platform Facebook doesn\'t want you to see"', 'Random Khajiit': "Christianity and Buddhism have some of the most down to earth valuues. Fuck the religious nonsense they have really good codes for people to live by.... Islam  doesn't and it never will but  people want you to love it. yeah I'll love pedophilia and rape culture when I'm wrapped in a straight jacket", 'SteleCat': 'Facebook war room against trolls? The fools! They will only make the trolls stronger.', 'Shaffan Mustafa': 'War Room? Sounds really hostile', 'Ifkensen _': 'The first atricle takes place in my state.... OK WHAT THE FUCK', 'Grim Knight': 'Keep it up mate.', 'graham orr': 'Will western Judeo-Christian Europeans ban the Adhan(call to prayer) 5 times a day now invading European city soundscapes.  No they will ban any Christmas song referring to Jesus to not offend Muslims.   WTF????', 'Ecchi Oni': 'On one hand fuck religion, on the other fuck diversity.   Gonna sit this one on the fence.', 'Dawn Browning': 'Religious carols stopped about 15 years ago in Australia 🇦🇺', 'John Cundiss': 'LMAO.  Christmas is the celebration of Jesus birthday.  I am an Atheist and I know this.  Now we cannot sing songs on the day where most of the country is at home at peace in there own way?  If you do not like the Christmas carols, DON"T F*^CKING SING THEM.  Keep you nasty ass kids at home.', 'Jay Eisenhardt': 'Holy shit so are Christmas carols now hate speech too?\nWell at least they finally admit Jesus is the son of God, otherwise they have no point.', 'cantalot': 'Much as I despise it, If it comes to removing "Jesus" from Christmas song lists or having islam allowed in schools, I choose the former; I can teach Jesus at home or in church but I don\'t want mine being taught islam, not even introduced much less indoctrinated.\nAs to CERN male discrimination & suspension of one & firing of the other scientist, all I can think is that science is now in reverse & heading for the Dark Ages #2 when leftists ignore science & witch hunt its own community who dare speak it.  This is evident in the Left deciding doctors created a false narrative of 2 sexes & eschewing science in favor of 71+ flavors of sexual identity politics.', 'Okidoke': "You know what I don't like about your videos Dave, you're always bringing to our attention how pathetic human beings are ruining society, but at the same time you're promoting playing videos games......yeah, keeping us inside our homes playing these stupid time wasting games instead of going out and remembering how to engage physically with other people in a meaningful way.", 'Jackson Valad': 'How could jesus offend "diverse students" when jesus was a "jewish palestinian rabbi killed by the evil white supremasict patriarchy"?!!', 'KKuurus': 'Dave the regressive left will never admit that giving minorities, umm womyn make up the majority, extras is discrimination against the whites/males.', 'Benjamin Esposti': 'And they wonder why we oppose them so much ... SMH.\nI\'m not really even religious but this is over the top, it\'s just like the schools that forced kids to read the bible. You go to bible school for that, not public school. And don\'t get me started on the national anthem. It\'s the national anthem, and "god" is pretty much universal to every religion, whether it be kami-sama or Aloha Snackbar.', 'Hugh Jones': 'It\'s not necessarily to censor or throw away all your traditions.  I don\'t believe Jesus is "the son of God" but he\'s part of our culture.  And there\'s nothing healthy about being ashamed of your culture.  People who move to the west should not be trying to make their host country throw away its culture.  I wouldn\'t go to China and tell them to get rid of Confucius (although they already have, when the Marxists took over).', 'Brain rich': 'That Facebook "war room" sounds scary. Like "1984" scary.', 'GTW': 'Hahahahaha!  Fakebook gets to decide what\'s "fake."  LMAO', 'Monday Politics MacBlackadder': "Well I guess Facebook hasn't seen the security certificate or the fact Minds uses Port 443. Let alone they're using cyber security as a smoke screen, whilst at the same time trying to obtain a cyber security company.", 'Driftwood': 'A war room of facebook leaders dealing with Safety and Security. In other words, the elite SS forces of Facebook, looking for a final solution to end the online lives of those they disagree with. Something like this has NEVER happened before.', 'Amused': "So you can't mention the REASON WE HAVE CHRISTMAS?\nMaybe we should just do away with all Holidays?\nThen we can't offend anyone.", 'Great White7': 'Its 2018, why would anyone want to sing Christmas carols or read the bible anyways?!', 'Projekt Kobra': 'Merry Christmas....or I will punch your teeth down your fvcking throat.', 'Natalie Wood': 'Tampon tax ad on your video... how is that a thing?', 'Dan Z': 'HEY if facebook, with it\'s spotless track record of constant censorship and monitoring in an attempt to manipulate people, SAYS they will stop "fake news", "hate speech", "trolling", and "interference", I BELIEVE THEM. Of course seeing how ALL OF THOSE TERMS are not defined clearly i guess that could also mean they are going to be manipulating information for their personal biases 24/7.', 'William Morgan': "The Facebook War room just makes me think of the line you can't fight in here this is the war room From Doctor Strangelove", 'JetblackThemeTime': "No religion of any kind in PUBLIC (funded by the taxes) Schools. I'm OK with this.", 'Gloria Mundi': 'Fk "immigrants" and their idiotic beliefs. If they CANNOT accept a country\'s traditions and culture then SHOULN\'T MOVE THERE! I refuse to bow down to "immigrants" and their way of life. Fk them and fk the PC/SJW/Feminist/Left agenda.', 'Madmax': 'When I worked in Baghdad we were asked not to sing xmas carols that mentioned Jesus so we replaced all potentially offensive words with "fuck". Worked a treat', 'Scott Williamson': "Wait. You cant sing carols celebrating JC's birth on the holiday to celebrate JC's birth? WTF?. \nThis better damn well be enforced equally across ALL religions.", 'Shell Beach': "Getting them to stop isn't good enough, these tech giants have to be PUNISHED!  There have to be consequences.", 'Heidi Pykkonen': 'We are living in an age where the majority is tricked into thinking they are the minority. We’ve all been asleep as they’ve taken over the media, social media and academia.  None of their censorship and propaganda will work on the already woke, but it sure as hell is working on our youth. We will be outnumbered if we let this shit continue. Trump needs to set up his own war room to combat this very real threat. Oh, and Soros kicking the bucket would be great as well.', 'MrMegaPussyPlayer': '2:00 Was a  reason to start blasting "Personal Jesus" at volume (too bad that the Marilyn Manson wasn\'t in prime)', 'StablizdBlodd': 'When you skip the ad and you the youtuber makes an ad in his video', 'Twisties T': 'I dont think you should be singing Christian songs in a public school any if you want you kids to follow your bullshit God put them in a private Christian school', 'Kalle Vuolteenaho': "I'm offended for my religion being cecored.", 'Carl Rood': 'I was under the impression that U.S. Public schools removed the religious aspects from Christmas decades ago.  Not sure how this one school lasted so long.', 'Brother Judas': '"Judeo-Christian"\n\nOnly Christian. Remove that Judeo part. Christianity was formed as a reaction to the Semite psyche', 'Muscle Man': "So what they are saying is religions that aren't Christianity aren't sacred, they are islamophobic racist bigots.", 'Threadnaught': '"Inspired by classic Role Playing Games such as [Not a Role Playing Game] and [Not a Role Playing Game]..."\nYour sponsorship is inaccurate. It\'s a Strategy game and those other games you mentioned are Strategy games.', 'a hel': 'So who\'s up for trolling this "war room" by just over loading it with "sophisticated trolling".', 'Len Hazell': 'Okay, so no "Jesus" in Christmas (that\'s CHRISTmas) carols \nAnd None of them spots the irony in this?\nI\'m an atheist and even I can spot it.', 'chillguysplease': 'Christmas carols are wonderful. This comes from a full blooded athiest.', 'Bsicdlgv': 'From Brazil here. This newspaper "Folha de São Paulo" published this article without a shred of evidence that right wing candidate Jair Bolsonaro would be behind this scheme, or that such a scheme even exists. Most brazilians received absolutely nothing in their cellphones from strange numbers, and the only political messages they received were from numbers they knew, such as friends and family. There\'s also inconsistency because the price for message implied by the reporting is enough to reach over 150 million cellphones, but according to companies, Brazil only has 120 million active phones. Most importantly, the newspaper didn\'t give any source or documents to corroborate those statements, and didn\'t even provide an example of the so called "fake news" that allegedly were being circulated on mass. Note that this newspaper has also been consistent in publishing articles against the right wing candidate.\n\nOf course, none of this prevented the left wing party from jumping on board and filing a lawsuit against Bolsonaro alleging electoral fraud to try and stop his candidacy. In short, this is a scam much like the alleged american Trump-Russian collusion', 'Autumn Entertainment': "I am 100% behind atheism. I don't think religion should *ever* be taught in schools.", 'Crylec': "Oh no Jesus is in a Christmas song. Oh god I am not a Christian I can't stand it. The horror, oh woes is me.", 'Starlin Vander': "Can't say black.. \nCan't clap..\nCan't say miss or ma'am n so on ... gender BS\nand llots more and NOOOWWWw\nCan't say jesus!!", 'Adamantium Scorpion': 'At school where my daughter takes ballet the have posters up for Islamic heritage month.  (Even though canada has NO Islamic heritage.)', 'jayson botes': 'It`s the same old BS, SJW`s go off into real world and DIE!!!', 'The Machine': '"The war room is staffed with millenials [...]"\n\nTells you everything you need to know really, doesn\'t it?', 'DestroyerJamie': "Inclusive by being excluding Christian values. I know if it were Muslims that this was done to, we won't hear the end of it.", 'Bernhard Jordan': "If the school is funded by the state it should be no promotion of superstitions and religion. \n\nBut that is for everyone. A state school has pork in its menu.  And a dress code that don't allow beekeeping apparel for girls as uniform. For the most allergic an epipen will suffice", 'Richard Wilson': 'Jesus is de way!', 'DragonFruitXVI': 'You seem a bit heavy handed in your analogues.', 'Roberto Rivera': 'I wonder how he Facebook keyboard commandos feel about working in a windowless room? Is it at least air-conditioned?', 'Subliminal Origami': 'So they argue to be tolerant of other cultures we have to be intolerant of our own? \nFucking double-standards - every thought they have. v_v', 'LukeSumIpsePatremTe': 'If they want to sign their religious hymns or carols, let them do it outside of school as long as they please.', 'Nicholas Patton': '"It\'s the end of the world as we\'ve known it, aaaand i feel (not so) fine."', 'Do you like Bacon? I like Bacon': 'FB is big brother', 'MeTaz': "Investigating censorship on-line- NOPE, wont happen.  He's too busy holding rallies. And this 7 thousand + caravan [mob]  coming to storm the US boarder?  What cha gonna do POTUS?  Cave of course.  Cuckservatives and Libs are playing both ends to the middle.  Like angry chickens, neither want to blink, or the angels might really see them for what they are.  I getting tired of the rhetoric, I want to see actions.", 'Unrelated Coma': '0:11 you say "a strategy game inspired by 90s role playing games" and then list Civilization and Command and Conquer which were both strategy games... not roleplaying.', 'Making Monsters': 'Classic ROLE PLAYING GAMES like Civilization or Command and Conquer?  :O', 'James Oldfield': '"Strumia was fired after saying men were discriminated against in STEM."\n\nSo, he\'s right, then??', 'Differently Abled Muslim Jewish Lesbian of Colour': 'just wear a shirt with Jesus on it. What are they gonna do? Stop the kid from expressing his religious views? It flips the tables. Also good to hear the science community shafting their best and brightest as usual. This world is going to hell.', 'I agree': 'It will soon be "offensive" to show white skin to diverse population as it "represents oppression " so you will be asked to cover up starting with straight white male.', 'Fire Bush': 'Will they finally ban the flat earthers?', 'Daniel Rice': 'sophistcated trolls? do they have a butler too?\nSophistcated Troll: oh Jeffrey, bring me my key board. It is time for my daily shitposting.\nJeffrey: Right a way Sir, would you like me to put on shadilay as well.\nSophistcated Troll: MMU-YEESSS, that would bring much pleasantries to my ears.', 'Christopher Fisher': "Does anybody else see eerie similarities to RL and the Phantom Menace? Soros is Palpatine playing the Republic against its self by supporting the soft way of compassion and inclusion, all the while mired in complete corruption but behind the scenes, he supports the useful idiots of the separatists, played by radical leftists and terrorists IRL, but is really the Far right evil Empire in disguise and when the stability of the New World Order is threatened by Nationalism and Populism it'll turn out that the Corporate Conservatives use it all as an excuse to initiate Martial Law and FEMA camps for our own protection?", 'Keith Baker': '"Intellectual dark age"... wow... this insanity couldn\'t be more of an accurate representation of that exact description. ..', "The Future Isn't so Bright": "The very first Christmas episode of South Park, when they introduced Mr Hankey, predicted the 'im offended' culture. Matt Stone and Trey Parker really predicted the future many times in the early episodes of South Park.", 'JMasta Flex': "On the Christmas song thing, there is a separation of church and state. So I don't really disagree with it. Now I'm cool with secular Christmas songs like Rudolph and Santa Claus kinda songs or the students sing the carols themselves that's OK, but you can't expect teachers lead religious non secular songs because that infringes on the separation of church and state as public schools are state funded. So that's a bit of a weak argument.", 'DeadBunny69': 'Right, because Christ has no business being part of Christmas.', 'Rose Lynn': 'I now do not use my facebook it just sits there has for a long time dont delete it cause of the pictures and memories while i raised my kids so its just storage for now lol. I deleted Twitter this week to cause i was feeding into debating, arguing, praising my group so to me it wasnt what i wanted to continue in. youtube is only thing i use now only to watch i dont have content on mine, so far gotta keep this for real info, news.', 'Elricson': "I was a child in an atheist house attending a catholic leaning school (it was a walk away from my house). I thought the story of Jesus an Moses was just that, a story. I walked with a decorated cross with colourful paper during Easter. I never gave a shit about singing Jesus Christmas carols nor did my parents. If you don't believe in it anyway, it's just a song, soooo no issue...", 'Le Kanraposte': "When will they stop mentioning Allah in arabs countries when I come to visit?\nNo, they won't?\nAh...", 'lyokomajor': 'Start buying guns, everyone.\nEventually this will get to the point where shooting these fools is the only option we sane people have.\nThe liberal NPCs are alreadys starting to advocate for confronting people *in their own home!*'}{'MarioFanaticXV': '"Inspired by the classic ROLE PLAYING GAMES of the 90s such as CIVILIZATION and COMMAND AND CONQUER".\n\nDave, I know you don\'t get to write your own ad blurbs, but... Really? How is this a thing?', 'Fina Bentley-Kimura': '"Cultural Vandalism", that\'s a good line.  I\'ll use it.', 'shadow librarian': 'America needs to become completely conservative, Republicans seem to be the only ones with their heads on.', 'ironwarmonger': "Affirmative Action cost me the hopes and dreams of my entire life.  I made massive sacrifices by my life, to get my degrees.  Being a Dyslexic Dysgraphic, I had to work twice as hard for twice as long to get the grades other got.  I did that.  I graduate second in my class with a BS in Electrical Engineering, and very high in my class with my Masters of Electrical and Computer engineering.  But after all that struggle, I was turned down for a teaching job that would have allow me to get my PhD.  And Affirmative Action was used to allow the school to break the H1B visa laws at the time.  In 2005 it was illegal to apply for an H1B visa if a Qualified American was available.  I was fully qualified for the job!  13 year later I am still looking for a equal or better (or hell even close) opportunity to what was taken from me.  At the time I was threatened that if I took any action I would be branded a racist and would be lucky to get a job as a burger flipper after that!    But at this point it no longer makes any different I don't have enough years of my life let to get anything I wanted, I life in a unending hell, a job I hate every minute of and that has ZERO benefits (welcome to the turth about small business in American), so I get to work until the day I die, because in the United States of America I was declared a second class citizen, were even the laws no longer protect me!", 'Dionysus': 'Fake News = Objective Reality. The fantasy narrative must be maintained at all costs.', 'Windfolla': '5:12 \nQ. Wth is a sophisticated troll?\nA. Someone who disagrees with you using a polite, rational argument.', 'Atsuma Komatsu': "We are sensitive to diverse people. We allow them to live here. They don't get to force us to no longer celebrate our culture. A large part of that culture is Christian get over it.", 'E-Rank Luck Lancer': "How is this a thing? Women vote, and have no accountability. And we all know that christians won't kill a woman for rocking the boat, and women as a group can't love anything that isn't about them. Since god is identified as a male, that's evil. Since jesus was a male? Also evil.", 'Dean J': 'Another reason to not be on FB', '86thislove': 'As an atheist I’m fine either way on that first story.', 'edstar83': 'https://www.youtube.com/watch?v=zb7AeLYKp2A', '427Arbok': 'Remember when we were scared that the NSA would be used to target political enemies and dissenters?  I guess we were looking in the wrong place.', 'Ashley Montgomery': "Why is it that only tenured liberal professors speak out? Why can't tenured conservatives speak out and talk about the negative effects of affirmative action? \nI know for a fact I was underqualified for my first job in IT...I believe they hired me bc I was a woman. I eventually learned what I needed to but I know it is what it is", 'mr. mr.': 'Diverse population my ass. As long as your not singing for the death of gays or infidels. Or inciting violence or having any heavy profanity. Idgaf, sing what u want.', 'PikaboICU': "If they don't like Jesus and they don't want CHRIST in Christmas than they don't get the HOLYday off. Let 'em work. It's frighteningly hypocritical to celebrate The birth of Christ/Jesus and ban His name from it.. Perhaps they should start preparing for the mother of all BBQ's.", 'Morgan Lane Bennett': 'judeochristianity IS PROBLEMATIC to some people indeed. The ones with brains.', 'marcwolfleach': 'Their war room will backfire when you silence people you\nGive them power', 'Joana R': "I'm deeply offended by that.", 'David Morrissey': 'A Michael D election video in the pre video ad.....Quite ironic a learjet socialist should appear before a Dave Cullen video :)', 'Joseph White': "But somehow it's okay to teach the children how to be Muslim dogs.\nHow is Facebook not being accused of election tampering?\nIsn't this what the Russians were accused of?", 'Matthew Keith': "So in order to be inclusive you have to be exclusive. That's what you call ironic.....", 'Carlos Alberto Garcia Jimenez': 'When I was teenager I was the typical "atheist" but one thing I never stop doing was singing Christmas carols.', 'Dmlaney': 'Its ok to be Christian', 'Fahraynk': "Chill, a public school can't put on a religious ceremony.", 'MadEclectic': 'Approved:\xa0 Ramadan the Red-Nosed Reindeer.\xa0 Brown Christmas.\xa0 Mohammed loves me, this I know, cuz the Koran tells me so.', 'Clock Tower Prison': 'Dave you want to talk about the truth? Start with #TAKEAWAYWOMENSRIGHTS. Speak with Turd Flinging Monkey.', 'David Barton': 'thats the way the left is taking away our values!!😡😡😡😡 we have to say no!!! and we want our values  taught in schools!!! no more i as Christian in American she my daughter sing Christmas carols and sing songs of patriotism to this country and if people find that offensively why are you here you can always go back we are not replacing our values for your  stone-age barbaric values!!! enough is enough!!!', 'Dragoninthewest': "I don't see a problem with them singing more secular Christmas songs. Christmas isn't even a really Christian holiday anymore, it's a corporate one. Which I really enjoy actually.", 'patrick Katalenas': 'glad our intellegent ginger is getting advertisers <3', 'iamLI3': 'when will this shit stop...\nwell at least i get to see how pretty where you live is.....', 'P Mason': '6:50  Yes facebook is no longer a platform, they are publisher. This now opens them up to liable and defamation of character for all posting under them just like a newspaper.', 'KRAFTWERK2K6': "Every day i die inside a little more…  Also, Dave. You're officially my first BitChute Subscription.", 'Jesse12489': "I worship Arceus. As long they don't ban Pokémon,i'll continue praying to our Lord and Creator Arceus. PRAY ARCEUS!", 'Victor Holtzman': 'How did Facebook go from the Social Media business, to cyber security? Shut all the big tech companies down.', 'Dual Future': 'Do a vid on Nikola Tesla, a person that faced the classic way people try to stop innovations that would advance mankind', 'No Way': 'I cannot believe I haven’t previously come across your channel. I’m so glad I found you. So good to hear your dulcet tones. A ray of light in this dimming wilderness of Globalist double speak. It’s time we all find our voices. Somehow, given that the Mockingbird media, only present their shills and have blocked all alternative views, I can only hope, there are more of us than we think. Thank you.', 'r p': 'The truth is science is a sausage fest err a I mean non diverse and they need all the women they can get Soo they can get laid err a I mean science better... For some reason.', 'Pensive WolF': '"Staffed with Millennials" that\'s a dooms day ticket if there ever was one.', 'Reaper419Darkangel': "didn't somne of this already happen in south park?\n\nwasn't the result a shitty clusterfuck that needed copious amounts of violernce?", 'peterc': 'It has now become a house of cards that will inevitably come tumbling down.   Radical feminism, and the entire plethora of politically correct insanity now dominating most political and intellectual discourse, has become a malignant cultural tumour that will deliver a now unavoidable  tsunami of demographic, social and economic consequence.  It will leave the vast majority of human beings attempting to pick up the pieces amongst the rubble of the societies delivered to them unequivocally declaring it all to have been a crime against humanity eclipsing all previous sources of collective shame.', 'MrShmanckles': 'Go man, love it.', 'lauren ennis': 'I left Facebook.. Best choice of my life. Fuck identity politics, seriously..', 'Eated Cringe': 'Looks like my Mexican buddy Jesús can’t be allowed in school because someone somewhere could somehow be offended by his name. Beautiful.', 'Joe Carter': 'Great video Dave, keep up the good work. And fuck NPCs.', 'Watery Watery': '...pretty sure CERN bows to something else entirely', 'Phial Substance': 'I\'m not surprised about CERN being that way. The SJW thing only started becoming mainstream since the LHC finished their upgrade and began their second run of experiments in 2015. I keep saying to people the SJW\'s are the legion of the beast. They are hive minded, they are empathically connected, they cannot be reasoned with. They do not think, they just feel and react based on their emotions. But if you can interrupt their emotional flow by giving them something else to feel or turn them against each other, their strength of unity crumbles. Star Trek as a franchise has always been very aware of this. "The needs of the many outweigh the needs of the few, or the one". That wasn\'t a direct or subliminal message; it was a prediction, a warning. Just like Beyond predicted that you stop the swarm by dividing them. Break their connection and they destroy themselves.', 'STE4MPUNK': 'So facebook is gonna shut down CNN (creative news network) and NPC errr NBC for the elections duration?', 'HumanCloset': "Isnt Jesus in the three major religions? It's a Christian country anyway.", 'NoMuse13': 'They...they are aware Christmas is a Christian holiday celebrating the birth of Christ?', 'Robert K': "But it's not about helping people, it's about power and social justice points, it's a game. communist march Sat in Dublin advocating to give free housing for homeless people. What could go wrong?", 'Nunya Dambidniss': "Here's how you stop all this shit: you KILL the people that do it. When skool admin pukes outlaw Xmas carols, SHOOT THE ADMIN PUKES. When the City Hall assholes get rid of historical statues, you go to City Hall and KILL THE PEOPLE WHO ORDERED THAT. \n\nKilling commies stops them. Nothing less works. They will enslave and destroy if they are not destroyed first.", 'Ben Knight': 'damn it cern! first the whole thing with those guys in Akihabara and now this?', 'T Myelinator': 'Since when do Google and Facebook get to decide on what is correct information or misinformation. There is ample historical evidence that the Deep state has used corporate means in order to promulgate untrue propaganda. just think of all the false information that was being promoted during the lead up to each of the Iraq wars. Incubator baby death fake news comes to mind. Lies about weapons of mass destruction comes to mind.', 'Krazykal': "Not that I give 2 craps about Christmas carols but how much ya wanna bet the school wouldn't ban or even encourage this being sang.     https://www.youtube.com/watch?v=2TCdmy-7-Xw", 'Neil Thackeray': "Science is filled with left leaning people, so I'm not surprised.", 'Random Entity': "I'd rather that they remove overt religiousness from school holiday celebrations (Separation of Church and State) than have the kids participating in other religious celebrations Ramadan, Hannukah, Kwanzaa.... etc.", 'Joris Vander Cammen': "I guess you weren't aware of the true nature of CERN. I am not surprised that they buy into this nonsense.\nMasks are slipping.", 'Steven Baal': 'I have an IQ of 114 and refuse to contribute to bullshit. I refuse to pay income tax to this culture.', 'Lords of Media': 'Make Christmas Pagan Again!', 'Daniel Price': "Literally has his name in the holiday and people aren't allowed to mention his name", 'Kaos Warrior': 'Jes...sorry, _non-judeo-christian figure_ *FUCKING* _non-judeo-christian figure_\nSchizophrenic Genderfluid Fuckfest!\nFacebook will be meddling in all elections everywhere they can. The current election in Brazil has seen several profiles and pages connected to Libertarians and Liberal Conservatives and anything "right wing" taken down for supposed "Fake News", meanwhile the reports I got on the Socialist and Communists seemed to ignore the tsunami of Fake News the left has spread there, including the MSM(which was bought by the Left in the past by government publicity contracts). Gramsci and Lenin would be proud of the left wing parties, the MSM down there and Facebook. The corrupt Worker\'s Party, involved in the greatest corruption scandals, seemed to be loosing the election before it even started, but has bought MSM and research polls, while trying to manipulate the judicial system to get rid of the main right wing candidate. They even tried to make WhatsApp limit groups and message fowarding, while have indicated to be in favor of censorship on all social media and MSM for years. Twitter was pressured also and it also seems they won\'t be banning left wing abuse, only right wing free expression, so nothing new there!\nSmells like Venezuela! They sure as hell are trying a coup through some "democratic contitutional assembly" idea, but before that there\'s all those attacks calling people on the right: racist, transphobic, homophobic, misogynist, etc. creating false attacks on left wing supporters(self harm saying it was a nazi that made a FLIPPED OVER swastika, fake reports of all sorts of assault, etc.), meanwhile any right wing supporter could always be attacked(and that seemed to be happening for years) and the main right wing candidate was almost killed by a knife stabbing during the campaing. This shit is better then any book or movie about political conspiracy, dystopian authoritarian futures and similar stuff!', 'tomthetavernman': "I'm scared.", 'bullthrush': 'Science in the 21st century is all about discovering grant money.', 'nickyiil': 'The minute you get infiltrated by the crazies you have two options ,you either gather all of them and boot them out , or you kiss any productive work good buy.\nThey are not there to work ,they are there to make sure you do not work and prove they are ignorant of anything ,except bitching about shit that is none of their business.', 'Mason Hil': 'Why?', 'Fox Over Feelings': "See I'm okay with a public school not singing ANY religious songs in the choir because of separation of church and state. But the reason they gave is absolute bs", 'Outbackbloke': 'Celebrating Christmas without Christ, seems rather anti-Christian to me.', 'Auburn Jewels': 'A story about Facebook is as useful as a story about MySpace. Thanks. And the STEM info., duh.', 'Nate Jennings': '"..we have to exclude certain people." Yeah, exclude white people.\nFacebook\'s "war room" sounds like a bunch of already indoctrinated, Silicon Valley lefties. "Hate speech", that poorly defined term used to make people walk on eggshells.', 'haywoodyoudome': 'Content starts at 1:05.', 'Dekuboy Mapping': 'more of a jihad if you ask me.', 'Trescarto Lerestindo': 'Can we blow up this room or send an RPG rocket after all they have to be inclusive of rockets :D', 'Infinity plus1': 'They stole Alex Jones "War Room" name!! Adding insult to injury perhaps!?', '][N O T H I N G][': 'And I thought Jesus was referenced in Islam and is concidered to be very important.....', 'Dr BlackCoffee': "Once in royal Davids city,\nStood a lowly cattle shed,\nWhere a mother laid her Baby,\nIn a manger for His bed:\nMary was that mother mild,\nJesus Christ, her little Child\n\nHe came down to earth from heaven,\nWho is God and Lord of all,\nAnd His shelter was a stable,\nAnd His cradle was a stall:\nWith the poor, and mean, and lowly,\nLived on earth our Saviour holy.\n\nFor He is our childhood's pattern;\nDay by day, like us, He grew;\nHe was little, weak, and helpless,\nTears and smiles, like us He knew;\nAnd He cares when we are sad,\nAnd he shares when we are glad.\n\nAnd our eyes at last shall see Him,\nThrough His own redeeming love;\nFor that Child so dear and gentle,\nIs our Lord in heaven above:\nAnd He leads His children on,\nTo the place where He is gone.\n\nYour Welcome", 'Paul Goodridge': 'I wish I could facepalm myself right now but my hands are too dirty and greasy.', 'm a': "During Christmas we celebrate the birth of (blank). Even if you don't believe Jesus was real, you at least reconizes it is his birthday", 'Gerudo Tempest': '2:59 I\'m just trying to imagine how this sort of thing would play out in, say, the middle east. "Um, guys, I\'m a christian, and your daily prayer calls are making me uncomfortable. Could you please be considerate and NOT do that?"', 'Mr Pool': 'oh so they ban Christmas?then we should just ban other holidays too like Kwanzaa and Hanuka because those are offensive to christians.', 'Dee-Bee Kooper': "Millennials shouldn't be allowed to do anything that will effect actual adults...  no seriously, how IS THIS  a thing???", 'Cranky Conservative': 'This is how you get conquered through sympathy', 'Hadam10Rose': 'They banned Christmas music back in 2008 at Sataluces High School in Lake Worth FL. Told us we had to remove the words, Jesus, Christmas, Angel, and God, or any over offerncive references to the holiday. And our concert was changed to "winter celebration" we sang the songs anyway. Our teacher got in trouble, it made the songs odd without the proper words, we tried them all, but decided against them after hearing them. For example they wanted us to sing "away in a manger, no crib for a bed, the little boy, laid down his sweet head" the funniest things was "greeting cards have all been sent, the rush is through, but I still have one wish to make, a special one for you, merry darling, we\'re apart that\'s true, but everydays a when I\'m here with you"', 'V-Zix': 'Satan hates mention of Jesus, and Satan’s little helpers on the Left are on board with that.', 'ROCKY SOLDIER': 'Behind the meme crazy feminists', 'Patricia Diaz': 'do people know how many people are called Jesus in the Spanish states so you gonna block or kick people from events because there have same name', 'Professor Chaos': 'Foreign invaders should be shot on sight.', 'wellhungindung': "Why would WhatsApp be involved if your messages are encrypted and can't be read by facebook or anyone else?...", 'Laszlo Sandor': "What? An intellectual Dark Age, caused by WAMYN?!!? Mate, you've just committed blasphemy, you heretic!", 'Jamie Siple': 'this happens me when i post a  picture from the minds on facebook  it was just nature or dog', 'Laura M.': "Gee... it's almost like it's in the name CHRISTmas!", 'Alice Moore': 'What is Christmas without Christ? Don\'t celebrate it if you are an athiest. Go to work that day. What are we going to call it "mas"?', 'Gregor Kolar': 'i was wondering what this censoring of certain accounts would even accomplish. i mean, why put up a wall if we already know whats behind it. it actually shows that social media sites think that some ppl are so stupid that if it cant be seen, its not there. and a lot of ppl confirm that belief. its "the current year" and ppl seem to be more stupid than at point in history.', 'Colton Norman': 'Fake News Purge?! Will the Onion be spared?!?!', 'BlackCroft666LP': "Even though Christmas isn't a christian holiday, to forbid that kind of stuff is ridiculous.", 'Gee Tee': "Facebook owns Whatsapp? Welp, that's a worry."}{'Allenpoe17': "I'm not religious at all haven't ever been really. But if they wanna sing. Let. Them. Sing.", 'Higgsfield In the field': 'Ijust kept getting captcha after captcha when I tried to go on minds,com.  No mater how many I did it just kept giving me more.', 'germinvermin': "“The government of the United States is not, in any sense, founded on the Christian religion.” - John Adams, Treaty of Tripoli\n\nI'm glad there's an option to go to a public school and not be inundated with religion. Freedom of religion also includes freedom from religion.", 'Street Skater 66': 'So sick of this retarded bullshit.', 'Alan2022': 'Is the school public or private?', 'Ian Vincent': "That's fine if we can ban anyone talking about mohammed Allah shiva vishnu Buddha and all other deities", 'Anton Antonson': 'I am starting to hate muslims. They hate my Culture and therefor I hate them.', 'usquanigo': 'Christmas isn\'t Christian. So taking that part out is ok. Especially if doing so, and getting this info out could sway the normies against the SJWs on their crusade. Christmas IS European however, and also inclusive. It is also THE December holiday of Europe and it\'s former colonies. Using "holiday" as a euphamism is merely the first part of a plan to eliminate the celebration entirely. This must be stopped.\n\nThe SJWs official line is that it\'s Christian. Well, it isn\'t. Point that out to people. The name, a few songs, and the manger scene are the ONLY christian things about it. Absolutely everything else is Pagan. And people who don\'t put up mangers or go to christmas mass, are merely celebrating the Yule. As we have done for millenia.', 'HEIL PEPE': 'Sorry church and state should be two different things. I see creationists just as bad as sjws. They are still my enmeys as shurely as feminists.', 'TJPhoenix': 'The gender wars Where men, women and attack helicopters all fight each other for control', 'Brent Holt': 'Does anyone expect Trump to do the right thing and reclassify the online monopolies and provider monopolies as utilities and treat everyone equally? The GOP has already sided with there campaign donors. This has already been decided in favour of the left by the GOP.', 'Yoshii': "I used to enjoy the thought of Game Design or Programming as a career, then I saw how they actively destroyed it. I was interested in scientific study, but now it's all about social-political bullshit and who can appease the most sponsors. This is swiftly turning into a world where independent movement and study is mandatory unless you succumb and drink the kool-aid.", 'Ryan MacFarlane': 'This is just going to make conservative ideas into a forbidden fruit, which will increase their appeal exponentially.', 'Chillproduction': 'Why can’t these Numbskull Penis Cleaner’s just fuck off. Why can’t people just do whatever the fuck they want (so long as they aren’t causing harm to or infringing on another’s rights) without these porno theatre floor lickers inserting themselves!? Fuck em all! \nMerry Christmas, fuck your “happy holidays”!\n...and ..happy Halloween..I hope the devil comes on all hallows and fucks em all in the face! Haha', 'Rising Power': 'Good video.', 'Suedocode': '1:20 Well, this is actually a pretty real problem. If you are Jewish and you try to raise your kids Jewish, putting them in regular public schools ends up being really confusing for them. There\'s only stuff on Christianity and Jesus. Maybe censoring the word "Jesus" is taking it too far, but perhaps we could celebrate a larger scope of religions in public school?', 'Techroach': '1:05 SKIP AD', 'PTSDSquirrel': 'We are being set up for genocide.', 'Chris Musix': 'Jesus and the cross ARE an offense to the people of this world.  But this kind of banning is not new in America.', 'Infernikus': "Funny how they're monitoring the two elections where the right have legitimate chances of winning... Nah it's just coincidence surely", 'Sparky': 'Fuck me! I can’t believe CERN went that low! You would think they would be all about science. The PC bullshit has gone too far.', 'Fixt100': 'If christians cant sing carols at the school, does that mean then that the muslim kids cant pray at the school also????\nsince, you know, its religious and everything??', 'W. C. Pandala': 'The satanic new world order is pulling out all the stops.', 'sylverscale': "I'm an atheist and I never had any problems with Christmas Carols whatsoever. I think students should not be forced to participate in any religious activities but that doesn't mean they need to be banned...\n\nMy time in school is long past but we had alternatives to religion (which was a class we had) for those who were either atheist or not Christian (which was the basis of the religion class), ethics class was one, I think. No helicopter parents or perpetually offended parents or kids back then, though...\n\nAtheist, fine, ethics class. Moslem, fine, ethics class, Buddhist... You get the idea.", 'icepicjoey': 'facepalm inducing....lol', 'Mug Gum': "You can't appease, you can't compromise. They won't let you. They always demand more.", 'Billy Jones': 'I wish the UK would ban Christmas pop songs from the radio and public places from around mid november until about 2041 ( I should hopefully be dead by then). Most pop music is shite, but christmas pop takes it to and whole new level, especially "feed the bastard world" and anything by Cliff.', 'Tyvern Overlord': '1934...when?', 'Driver': 'Chesterfield County is around Richmond, Virginia (the city).  You\'ll always find this leftist "plague" near cities because it\'s filled with your usual "progressives" who loved to tear down our culture. \n\nI can tell you that the school administration is getting an earful though.  As we get close to Christmas, don\'t think that fight is over (or won) by progressives.  They\'ll push it along and hope no one notices.  They don\'t understand that they are getting into the south (Bible belt) and people will come out swinging to defend it.', 'holoholo haole no ka oi': "NPC's being arranged into battle formation", 'RageScholar': 'Quick! Get to the time machine so SERN doesn’t get you!', 'cnmckenna': 'Sophisticated Troll = Someone on the Right who is smarter than you and makes you mad.', 'phoenix rises': '"Sophisticated trolls"? Wow they\'re really reaching here', 'krista doss': "Here in the states we have the separation of church and state so public schools cannot Have  religious themes.  This is just one school that's been getting away with it until now.", 'Joel Everett': 'FB has now unveiled its new "Ministry of Truth" war room.', 'Shoota027': "Well it's only gonna get worse everything's in the crash and burn in the meantime If something is not done well we can kiss Everything  good bye", 'Bert Verboven': 'wow. thats some quality shilling', 'Mahojo Hodge': "*Uses the 'includes paid promotion' Youtube tab instead of taking 5 minutes to edit it into the video*", 'Nick Williamson': 'I\'d be more ok with this "war room" if they weren\'t only targeting conservatives.', 'silkhead44': "and Mohammed's mothers vagina glowed when he was born", 'ROCK AUSTIN': 'Banning Christmas Carols and Jesus? I seen that on South Park.', 'DH M': 'You\'re wrong on the December 25th holiday.  Chris Rodda dug up the original laws and the steps to making it a holiday.  It started when bankers in DC wanted a bank holiday during the Grant administration.  It specified that any debt that was due on Dec 25th had to be paid by Dec 24th, for instance.  It was spread to other holidays such as "Thanksgiving" mentioned by name but Christmas was just "December 25th".\n\nIn 1962 the Supreme Court "outlawed prayer in school".  Not quite. Government functions cannot be turned into church services.  Children are impressionable and under the psychological power of authority until the moment of their 18th birthday when they become a "reasonable man" ( <--- legalese ). So:\n\n1) A teacher cannot lead a prayer.\n2) A student cannot lead a prayer at a school function because children have to sit and keep quiet and listen in school -- just like church.\n3) A student putting a Bible quote or such for their picture in the yearbook is OK. The ACLU went to court on that one.\n4) When a chaplain gives a prayer or sermonette in a legislature you will see legislators chatting quietly, getting up and leaving or coming back to sit down. Some of them have to disrespect the prayer or the meeting of the legislature would be a church service.\n5) Colleges are largely exempt.  They can\'t use government funds for the chapel, chaplain or theology courses and many are founded by churches such as Southern Methodist.  It is assumed that the students are old enough to understand that the government is funding the secular parts of education, allowing, but not endorsing religion.  \n\nSo over 50 years ago schools had to remove Jesus from Christmas.  The one you cited is doing nothing new.  It is just catching up to the rest of the US.\n\nI knew an elementary teacher in a "diverse" school who still had to negotiate with some parents about Christmas art lessons.  Santa and snowmen were forbidden as idols and coloring a Santa is IDOLATRY.  Moslems, amirite??  Wrong.  Seventh Day Adventists.', 'PythonPlusPlus': 'The question I was asking at the end was: “It’s already 23rd October?”', 'Someone Someone': 'Science bad.  Whimmin good. Beep.', 'Ganon Russ': '"Sophisticated troll?" xD', 'Terry T': "We all know what they are referring to is Muslims. I have to see hijabs and burkas and hear All uh Akbar on a daily basis but they can't hear the word Jesus. There is 1.4 billion Muslims on the planet we are told regularly, well there is is 2.4 billion Christians. Whats your point?\nState funded schools in America are meant to be secular, therefore free of all religious symbols and doctrines. OK. Remove all references to Christianity including the word Jesus as well as all references to Judaism including the skullcap all references to Sikhism including the turban and all references to Islam including the hijab.", 'derfo20': 'Now we have to question everything that comes out of CERN.', 'Dizziepunch Gaming': 'What\'s next? "We wish you a happy holiday and a happy January 1st"? Oiah, that\'s clunky as hell.', 'Michael Mud-Dragon': "Christmas carols can't mention Christ?", 'nunya bisnass': "I was once part of a message board that censored the word Jesus but not any other religious figure. Most members were atheists, and only a handful people didn't agree with the double standard. But that board had a huge problem across a wide variety selective enforcement, because it was moderated by collage students. It was horribly cliquey in that way, and appeals were typically only handled by the specific mod that took the original action.", 'Paul Thongkham': 'When NPCs try to take over the world', 'Allen Smithee': '“Freedom of” is nearly the opposite of “Freedom from”, yet schools are bribed and intimidated by the federal government to do just that.', 'Mr. Bones': 'Facebook literally setting up the Ministry of Truth.', 'Thomas Boyd': 'Awesome. Great video. Excellent channel.', 'Erynn Collier': '(° ≥ °) NPC meme bad! BAN NPC ACCOUNTS! (° ≥ °)', 'bravojr': "I pledge allegiance  to the flag of the United States of America, and to the Republic for which it stands. One nation, under God, indivisible with Liberty and Justice for all.\n\nP.S Under God doesn't have a religious significance. It is signifying humility and unity under the notion of God given rights, Sic Semper Tyranus.", 'Sandra Ward': 'Allen West stated the most important vote you can cast is for the school board.  I agree.', 'Roman': 'will that war room block out interference from non-citizen voters?', 'Cyricist001': 'Insanity, absolute insanity.', 'SneakyWarrior 82': 'Hope everyone has a great day!', 'Trinal Galaxy': "I love how people use the bad parts of Christian history to justify throwing it out, but when confronted with Islam's WORSE history, they say that its in the past and those (aka the majority of Muslims in the world) that follow those practices are radical extremists.  Instead i say we support the true Islamic extremists, the ones that want to bring Islam into the 21st century and out of the 5th.  the problem is political bullshit and economics, namely Saudi Arabia's oil.", 'Logical Extreme': 'Thank a jew for all this leftist destruction. The West has kicked those parasites out hundreds of time and never learn', 'autotune bacon': 'I am boyctting facebook I hope other people do as well. As for last story i hope the man \nwho was fired gets retired, as for the songs related to Crist I have no problem with them.', 'spacegirl226': "These gorgeous landscape shots -- and then I think of Facebook's windowless conference room full of millennials Big Brothering everyone.\n\nI'd rather be outside.", 'A Internet': 'People look at Facebook to get news?', 'Delta 23': '"chinese and Iranian interference" I\'m surprised they even would look for anything involving them, here I thought they wanted the commies and muslims to take us over', 'Thang Tran': 'is that a rock in the water??', 'Crepitus': 'these idealogical wars seem to have one end goal. dystopia.', 'Rez Zircon': 'If we can ban "Jesus" we can ban "Mohammad". Fair enough??', 'radical whiteward': "Now I know why it took humansa long time to mentally evolve it's because we are so so so stupid. While we are focused on social justice other countries are advancing", 'Sandi216': 'Of course, children are also taken to mosques on field trips to be "inclusive" and encourage their "multiculturalism and diversity."', 'THEJAXEL': 'Nothing on the up coming referendum???', 'Christopher Pineau': "Ugh. I am not religious at all, and I found that first thing utterly lame and silly. They're in *our* country, whatever happened to assimilation? Old generations of immigrants would be disappointed, I think. Further, that's the biggest reason I ditched Facebook months ago, the political bullshit and suppression of dissenting voices. Minds represents a credible threat against Facebook, therefore they're attempting to crush it. Go figure. America is slowly waking up to this reality, but emphasis on slowly...I hope it's not too late.", 'Mr. Clean': '“Judeo-Christian values” ummm no, just Christian....', 'Captain Nemo': 'Watch /pol/ to get around facebook again', 'b m': 'Facebook is a Global problem that never ends........', 'Cali Fornia': 'Great now even Dave is forced to include a long-winded commercial in his videos. Dave you need to look into getting your own CRTV show', 'Matheus Leitao': 'Well... Let the witch hunt begin!!', 'Sly Foxx': 'EXCLUDE Jesus in the name of DIVERSITY?\n\n(insert Picard facepalm meme here)', 'fastold carz': "Facebook got the needle in the arms of the brain-dead narcissist crowd that just HAD to let the whole world know where they took their last dump, and now that they've got 'em, they're going to tell them all what to think. Why is this a surprise?", 'Theseus9': "Just get off of Facebook already people!  It's like yall know the problem, but your hooked to it like an addict.  I got off of FB years ago, and haven't regretted it a bit.", 'EmpiricalMind': 'From Mansized tissues to physics,  is there anything free from the feminist power grab?', 'PhillipOnTakos': "So we're not allowed Christmas carols with Jesus in them? The holiday is a Chirstian one right?\n\nI personally am an atheist but I always loved singing Christmas carols even if they mentioned Jesus because they put me a in a good mood.\n\nBut hey I guess enjoying something when it has one thing you disagree with is wrong now", 'National 1': 'Wouldn\'t it be "offensive" against Christian\'s doing that? Oh! That\'s right it\'s ok to do it against Christian\'s because Christian\'s don\'t go around blowing them selfs up and are not violent like a certain "religion of peace".', 'Alexander Franke': "Fuck it, folks the schools have only been ''Frosty'', ''Ruindolf'' for some time now.  Haunakkak, Kwanza and dreidel songs in my children's entirely Christian classroom, this is GOOD I'm told!", 'Nathan Bevill': 'I think Facebook is Breaking the law talking about safety and security I dont think its legal not to have a window for a room with people working because they have to have 2 ways out in case of a fire or other danger', 'A M': 'Im sure he can work and talk shit on twahtter. XD', 'PyreGnome Ay': "I wasn't comfortable singing Christmas carols in my Christian school when I was younger as an atheist. You know what I did? I didn't sing them. Shocker.", 'R. Blakehole': 'So, the Robious Middle School is going to offend 60-70% of the kids, their families, and extended families in order to not offend the 2-3% militant atheist kids and their families.  In what twisted logic, HR Giger reality, does this make any sense?  If our society still enjoyed logic the school administration would simply lay out the Christmas carols/hymns that would be sung and any students/or student families would not be penalized for not attending or taking part.  There could even be a separate choral assembly for "Chestnuts Roasting" music.  Shoot I would be willing to bet most of the atheist kids that were musically inclined would love to take part in performing the old Christmas hymns because....They are good music!', 'Helgan': 'In Sweden a. University professor said Facts can “create wrong view of human values” ... so stupid if anything I WANT SCHOOL TO TEACH FACT.... NOT THEORIES', 'swardinc': 'so why is the war room staffed with millennials? Lol, like they could stop fake news if people decided to really give it too him', 'Rex Haus': 'How is an unaccountable, multinational corporation like Facebook setting up a “war room” designed specifically to interfere with the political outcomes of elections not more of a threat to our government than Russia buying a few grand worth of ads?', 'f*** the EU': "Don't forget prince charles wanted moohamhead placed in Christian nativity scenes"}{'M H': 'I believe that CERN is an instrument to help accelerate our entry into a spiritual dark age.', 'Marc Guinn': "That's fucked up! Right in my back yard. Va is goin down the toilet fast! And facebook will die soon! Goin the way of Myspace.", 'James Marvel': "Liberals: We're not trying to take Jesus out of schools.\n\n*takes Jesus out of schools*", 'Ix Suomi': 'Finally you / someone covered that scientist in Cern news. It was in shade for 2 weeks.', 'John 23': "I'm an atheist and I'm still going to the Community Centre at Christmas to sing carols!", 'Abhorrent Autist': "Whether you're pro-brexit or not I'd keep an eye on the frequency of pro-brexit posts on Facebook. Those in favour of leave and remain are often accused of proliferating misinformation. So if we see a significant reduction in pro-brexit posts but not remain something nefarious may be going on; especially since Nick Clegg was hired by Facebook.", 'r3w': "CERN literally just proved that they DO discriminate against men... apparently if you're a man at CERN, you're not allowed to open your mouth and speak a very basic opinion, even when evidence is present.\n3rd-wave feminists destroy everything they touch.", 'Nick Berg': "I'm not Christian anymore, doesn't mean I would be offended by a Carol about Jesus. We have freedom of religion, we need to keep it. Let people have their damn Carols.", 'Straw Hat Luffy': 'Dave, these How Is This A Thing’s are covering more and more troubling events. The West is collapsing and I would suggest that some of us, at least, do like Black Pigeon Speaks and go to a less insane country like Japan or one in Eastern Europe. The West is lost and there seems to be nothing we can do to stop it.', 'CAROLYN SCILLEY': 'I got rid of my Facebook account weeks ago.  I get my alternate news from many sources.  Thank you for the information that you give us.', 'Noah Williams': 'Facebook and other platforms should be regulated as public utilities. Plain and simple. People should be able to say whatever they want as long as it doesn’t insight violence or constitute defamation as provable in a court of law. Alex Jones should have been banned for insighting violence, not for hate speech.', 'Eoval': "Rudolph was a drunk no one wanted to hang out with - aren't they going to ban it, or at least use it as part of an anti-bullying/don't drink program?", 'Jim Bond': "If they don't want to celebrate CHRISTmas that's fine. If they do, Jesus CHRIST is the reason the celebration exists, not toy companies or LGBTPQRSTUVWXYZ. They can continue on their path and go to hell.", 'ryan breheny': 'dave.. western civilization is not (((judeo)))-(((christian))) ideas like democracy and even the days of the week have nothing to do with the dick cutting cult from the desert - hail the dagda o/', 'PaulOfThebes': 'Anti-Christ-mas, Anti-Conservatism, Anti-Science... Neo-paganism!', 'Brian Sneary': "Superstition doesn't belong in schools", 'Jake Erdson': 'Idiocracy is happening right now.', 'Edge Lord': "It's okay to be white", 'Joshua Dersham': '*clears throat..* IT HAS BEGUN *Sha Kahn voice*', 'udhsids': 'I would have thought Christianity, which is rooted throughout most of our systems, would go on untouch. But apparently even the Untouchable can be touched.', 'nonamerequired123': 'Judeo-Christian, and a holiday that was taken from another pre-Christian religion.   The irony of people complaining about this is scintillating.', 'ZeOverman': 'Stopping sinning of religious songs in schools is a great idea. All religiosity should be banned from schools.\nNo public prayers, no singing of religious songs, no religious symbolism (crosses ect.) and so on.\nBest idea ever.\nYou want to waste your time with religion like that middle-eastern import death worshiping cult aka. "Christianity" then do it on your own time.', 'Agnot Wot': "I'm 43 so if I'm lucky I won't be around much longer. But this bullshit makes me regret having children. My two sons are going into a FUCKED world because of the vocal minority and our society is bending over and willingly getting fucked.", 'Dark RavenNightX': 'This is South Park Wow My God XD', 'Izahdnb': "I trust Facebook to decide for me what's fake news and what's non-fake news~!!!!", 'Cam Alft': 'start singing swinging twist christmas music....or maybe heavy metal christmas tunes...then see what the schools have to say about that....hahahaha...that war room would be on fire eh...', 'Simon Grey': 'That CERN protest thing. They have a lot of signatures, with those people i checked being actual scientists.\nBut then i took a look at the letter. And it became clear where this stench of shit was coming from. Letter was typical "muh evidence of discrimination" and listed  numerous papers as "proof". And then it got interested. Out of all the references provided i looked only thru 3, so maybe there is one that can be taken seriously. But those 3 that i did looked thru was typical libtardian "science", in every paper - they provided facts, like there is far less women in STEM fields and then they just ASSERT that it is due to discrimination. Not a single evidence linking A to B were provided. There is less women in STEM, therefore sexism(all the usual suspects mentioned at some point - sexism, racism, homophobia, etc).\nThis is not science.', 'kakkaohjus': 'Is that the same Laurie Uni that had the pronoun fuckup? I bet someones getting an audit for "anti-inclusive social media post".', 'Mountain MGTOW': "Science isn't science anymore. Science is woman. Everything is woman, everything is vagina.", 'Dave Shields': 'I’ve falsified all my personal data on Facebook. The only thing they have is a dormant email address\nThanks Dave for another great video,', 'Keynomaru': "You don't think CERN is really using this to distract us from the time machine they are building that will plunge the world into world war 3?", 'Citzen_J': "I have no issue with removing god and religion from public schools. They aren't supposed to be there in the first place. Public schools are funded by the government, and as such, ought to remain separate. Fuck Christianity. Fuck Judaism. Fuck Islam.", 'MarsIsRight Tonite': "My son received rejection letters from every California university as an engineering major with a 3.9gpa and scoring in the top 5% in mathematics in the state, thanks to Trump's mandate for universities to recruit more females. Trump should have never made such a mandate because the future of science and engineering will eventually suffer as less qualified minds enter the various fields. Since graduating HS in 2017, my son has earned a 2yr degree in physics (only took him 1 yr to complete) \xa0and is working on another in biochemistry waiting for the next enrollment period to enter his university of choice.", 'Micah Robinson': 'Im not from Europe but i am always wanting to know the truth about what is happeninng around the world so thank you for giving us a update about the crazy Eu orverlords', 'H Himmel': "Great video. I can't imagine how hard for you to digest the facts you are exposing. This is the decease of degeneracy afflicting the west. If the west ever cures itself from it it'll never be the same. God knows what it'll become but the decease must be eradicated.", 'Eclispestar': "Well would a druid ceremony be ok at the school.  For diversity?  I'm sure the school will have culture awareness days for Cinco de Mayo.  And various Muslim holidays.", 'Eddie Haskell': "CERN's had this problem for years. The left can't irony: Women are getting more STEM jobs (whatever that actually means), but that's bad because feminism. Keep your eyes on the prize, girls!", 'Travis Romig': 'Today was weak, you should have skipped it.', 'Daniel Cevallos': 'USA and Brazil elections are important to left. Because they are going to loose both again and NPCs era will end suddenly and loudly.', 'Andy Bates': 'A literal Ministry of Truth. Why is there not a huge uproar over this?', 'Bon Futur': 'maybe when the world order takes over they can send us to island, we could name it falkland', 'ukkr': 'Computing Forever\nSCIENCE is supposed to use, and its facts are to be determined by, THE SCIENTIFIC METHOD!\n\nsci·en·tif·ic meth·od\nnoun\nnoun: scientific method; plural noun: scientific methods\na method of procedure that has characterized natural science since the 17th century, consisting in systematic observation, measurement, and experiment, and the formulation, testing, and modification of hypotheses.\n\nSO, you come up with a THEORY, DEVELOP VALID TESTS, TEST YOUR THEORY, DOCUMENT IT, AND, if it works, PRESENT IT!  PEERS are then to revue, critique, and test.  If your "PEER[s} have REVIEW[ed]" it, and the tests all work out, THEN it may be considered as fact, AND SCIENCE.  UNTIL THEN, it is just a THEORY,\n\nhttps://www.merriam-webster.com/dictionary/theory\n\nCONSENSUS is NOT supposed to make ANY difference unless the tests are valid tests, and work in line with the theory.\n\nSo YEAH, a lot of "scientists" don\'t even seem to know what science is, let alone care.', 'Dokino Sam': 'We want to make sure no one interferes with elections...except for us.\nYou know, I don’t even know what to do at this point.  I’m trying to establish some creative things and need to be able to be visible, but I also am just bored to shit with Facebook and Twitter being retarded tyrants.  I’d say that I’m going to just go off the grid and be a hermit, but knowing my luck, some assholes will show up demanding that I give up my shanty so they can have the land for people less fortunate.\nJesus, people keep tagging on Trump and how we haven’t learned from the past, but when you point out that there are major pitfalls coming with the ideologies being promoted and that they will, in fact, destroy society, you are a troll.', 'Mr Reasonable': 'Next thing they will ban is Rudolph the Red Nose Reindeer. You know to be more sensitive to people with deformities.', 'Nebula Ultra': 'my new this week in stupid since sargon went full shilltard doxxer', 'iloveevrywn 1': 'You should post all your videos to Youtube and Bitchute. I primarily use BitChute but I have to go to youtube to watch your videos and I love your videos.', 'MaidenAirTM': 'just know if the left attack you. then you atleast  know you are doing something right', 'True Contrarian': 'The Left really are a bunch of assholes.', 'LuisBarrim': 'Brazilian election is THE battleground for censors. \nThere is a enemy of mainstream media and politics running. And he made to second round with 48% of votes.\nBrazilian election works on 2 rounds, if a candidate doesn\'t have 50% of votes in the first round there is a second round with the 2 with most votes.\n\nBrazil past 6 elections were polarized by PT (Workers Party) and PSDB (Social Democracy Party). They were identified as "the left" (PT) and "the right" (PSDB) for at least 20 years.\nThen Jair gained popularity, as the "true right". PSDB is a libertarian party, not a conservative one (and PT is a socialist aligned one). And with almost no political power (his party controlled near 1,5% of the house, now is the second biggest) had 49% of votes (at least, polls on second round say he has 59% now). \n\nSo... People say that fake news on Whatsapp are the ones at fault. And even the son of the candidate was suspended from Whatsapp.\nIf social media can make a (previous inexistent) right win elections on a heavy US influenced country, this WILL scare then. A LOT.\n\nSo... You should keep an eye on Brazilian elections.', 'Richie Madashell': "Don't say Jesus. Its offensive. WTF?", 'Noelle Campbell': "It's CHRISTmas.", 'The Mad Tinkerer': '"Classic Role-Playing Games like Civilization and Command & Conquer." \n\nThe pedantic in me wants to argue, but the poet in me wants to applaud.', 'Gunt-Free Zone': 'a bunch of stupid cunts in STEM fields...what could possibly go wrong?', 'Cyber Bruiser': 'I will be singing Christmas songs now in the public eye,just to piss off the tribal islamists pigs hahahahah', 'Scorp': "Welcome to the beginning of your end. It seems a new era of Slavic dominance will soon come about. The ironic thing is that it's one of western doing. That's a giggle of history if I've ever seen one.", 'Jamey Cordery': "How can people learn to be accepting if they insist we remove things they don't like? That is teaching the wrong message.", 'Hans Nielsen': '“Orange man bad. Feminists good. Diversity is our strength. All white men are racists. Immigration is enrichment”. - NPC#369246', 'Jessy D': "So sick of seeing plugs for this cheap vikings freemium game. We know you don't play this crap, you just took the sponsorship for the cash. Sad to see you selling your platform like this.", 'Eric haskell': 'The noose tightens...........', 'The Opinionated One': 'I swear pockets of Virginia (mostly Northern Virginia) are nuts but then other parts are super anti-pc it’s weird.', 'Genghis Khan': "I'm not surprised. But I don't really have a problem with it if it's a public school. I mean, have you seen american public school? they're a complete joke", 'Radical Edward': 'What happened to just letting kids who aren’t comfortable singing those songs not having to rather than getting rid of them outright', 'Argentarii Homini': "CHRISTmas carols containing references to CHRIST have been banned to avoid offend people from other religions? Makes sense. I'm guessing those giant Jewish menorahs in the White How don't offend anyone.", 'ARC Trooper Nox': 'How long until the Rockefeller Christmas tree is deemed offensive and is no longer put up? National tradition since 1933 but I best go see it this year else I may never get the chance', 'IceKarma': 'When CERN pulls down its pants and starts playing with its own shit with the rest of the retards, you know humanity is truly fucked.', 'AlbertusMagnus_44': 'Get your kids OUT of Government Schools!', 'Coalition for the Eradication of Stupid': "Just spitballing here, but doesn't that whole Facebook story sounds familiar?  Didn't they just accuse Russia of manipulating an election?  Where's the difference between this war room and Russian bots?", 'Mike Novak': '"Sophisticated troll" ?\n\nLike one with a monocle and shit?  What does that even mean?  Are uncouth trolls not an issue for them?', 'MrOwl322': 'We don\'t have "Judeo-Christian" roots. "Judeo-Christian" is not a thing.', 'Thor': "The facebook teams WILL, of course, take a break from advancing the cause of censorship every hour for the collective '2 Minute Hate'.........", 'Lucas Miller': 'Great episode', 'Tristan smith': 'ah so their hate for us comes to the fore more and more, i wonder when they will start killing us in the west now like those who rule in islamic countries do.', 'Tom Cat': 'been fascist book free now for two years & two months. minds & gab all the way (never had twatter).', 'bfbf 334': 'https://jonrappoport.wordpress.com/2018/03/13/outrageous-chemical-dosing-experiment-to-force-friendship-toward-migrants/', 'i7fan': 'So in countries where ISIS take over and they find Christian monuments they destroy them, and when Muslims come to the west WE destroy Christianity FOR THEM.\n\nAre these idiots signaling to the world that we are on ISIS side? SIGH..................................!', 'ItsNotTrue': 'That Christmas in school stuff is nothing new. When I was in 3rd grade I got sent to the counselor for refusing to play the Dreidel game because "I\'m not Jewish"\n\nThey said by not celebrating a holiday I don\'t believe in (in all fairness, I don\'t believe in any religion) I was being "intolerant." When I asked "why don\'t we make them do Christmas stuff" they called my dad! He\'s not the kind of guy to give a fuck about that. His response was "Well, why don\'t you?" That bitch was red in the face. Highlight of my school life.', 'Marius du Plessis': 'Where can I resign from being classified as a human being? I am offended by 99.99999999999999999 of humanity.', 'GroundSquirrel264': 'Mousilini would be proud.', 'A M': 'Globalism is poison to human rights and national sovereignty.', 'alex jervis': 'Why are Western Governments forcing cultural suicide on their own people through Mass Immigration?\nA population, hopelessly confused and divided, has no ability to take the action necessary to fight and win this War of National, Cultural Identity, of National Survival!\nMuslims, a weapon of Globalists, are a powerful threat due to their Cohesion and willingness to cause mayhem at the call of the Imams!.................. Demography is Destiny!', 'Marty Ollier': "Awww, you didn't show the part of the vikings advert where the hot looking girl is bent over the bow of the boat...  so disappointed.", 'Red Shirt One': 'Hate speech on facebook: posting "sometimes women lie about sexual assault" and got me put in facebook jail for a month. It got flagged as hate speech.', 'Punky Lesh': 'Sophisticated trolls are just like regular troll except they wear a top hat and a monocle while posting.', 'White And Proud': "WOW, this diversity political correctness (((madness))) continues,scew it I refuse to play along with this (((madness)))... I'm out.", 'Glen Tight': 'Spread the news.... or better yet, spread OUR news motherfuckers👌 \n\nAlternative viewpoints..... they are OK.... As long as they fall within the acceptable spectrum (may actually be the Autism spectrum.) If the slant on the viewpoint is critical of the Left, or, in fact, slightly right.... forget about publishing on facebook.... \n\nToo many "a little to the left" (like my cock) narcasists out here running the show .\n\n\nWankers..', 'Guilherme Henrique': 'Wait? Is there a NPC Room monitoring our elections here in Brazil ??', 'Michel Boryoku': "Diversity to exclude Jesus. Diversity to exclude Man/Woman/Boy/Girl/Mr/Mrs/Ms/Gender (2 genders heavily oppressed) DiVerse divides, UniVerse Unites.\nFacebook isn't meddling in the election... as they are silence every opposition.", 'Loke Baldersbane': 'Blaming Russia for what facebook and other shitty (a)social media companies actually do. How can they shift election meddling from a hostile act to something positive? New speak of course.\n A war room in a private company, great, the Blackwater/Academi/Xi/whatever of California, mercenaries armed with keyboards.\n\nIf havent deleted your facebook profile yet, please do it now.', 'ColonelEviscerator': 'Fake News is more often than not Genuine Information.', 'Ed Le Toggaf': 'FUCKING HERETIC! DEUS VULT', 'J V': 'PC is life blood for the NPC’s', 'LodanSD': 'You know, Napoleon was a Tyrant, so we should probably burn all Paintings of him and tear down all statues of him, right?', 'NotOrdinaryInGames': 'How about FUCK judeo-christian values, and re-embrace what existed BEFORE THE FORCED AND BLOODY CHRISTIANIZATION?', 'Mordakai Silberstein': "To all the autists sperging out about Christianity here, guess what cupcakes? Christianity is integral to the west, it is a founding part of Europeans, it's values are built into the society, you can't replace or get rid of Christianity from the west and expect it to continue to be the west anymore than you can remove the English from Britain and expect it to remain British. This is NOT hard to understand. And if you care about the west you have zero excuse, ZERO, to not notice the enemies of the west attacking Christianity in order to destroy the west. You have to be really stupid not to get this. It's not alone about whether you personally are religious or not, it's about your civilization and it's founding pillars. How on Gods earth can you expect to remove Christianity without major ramafications? If you're joining the left in attacking Christianity. YOU are PART of the problem.", 'Schnake Eyes': "I'm just waiting for countries to change Christmas to holidays or some bs, you can fuck right off", 'LongLiveRockAnRoll': "Well muslims apparently think jesus was a prophet and since they're the only religion sjws care if they offend, why are they banning those songs?", 'Joshua Owens': "Do people not realize Christmas is a Christian holiday? That's the entire reason for the holiday. It's in the fucking title!", 'Grovilite 12': '"I used to love Christmas. But now the liberals have decided that Christmas is offensive someone feelings could get hurt. Well do you know who\'s to blame for all of this? Well do you?! Jane Fonda. Today\'s liberals are yesterday\'s hippies and they would have worn themselves out dancing in the mud but no she had to revitalize their dying movement by going to North Vietnam and humanizing the enemy. I\'m Hinowa Jane dont kill communists look at my boobies that was the beginning of the end." Anerican dad.'}{'Glen Tight': 'Eat a "Jesus" sized Dick!', 'vincentgraymore': 'The CERN thing is a real concern. Obviously, his data is not EVERY SINGLE FIELD AT EVERY LOCATION but I think it is a generalisation and that it is accurate. It seems like this also spills out into everything. Women seem to be prioritised in most places nowadays as one sees less and fewer men everywhere.', 'Brian Bellia': 'Dave, could you please increase the volume of your videos a tad, please?', 'Innsmouth Fisherman': 'We need to go back to our roots.\nWhich are:\n1. In Ancient Greece, you were considered a Hellene if you qualified by all three of the following: language; customs; blood. Outsiders lacking these were suspect. The culture produced as a result is still the highest and richest in history.\n2. Women did not participate in political life.', 'Bryan Price': "> Native populations of Western counties\n\nWell, that's a long winded way of saying white people :P.", 'WildManTheGamer': 'Fucking diversity you ruined diversity', 'Remedy': ':^l channel called:< "computing forever" <error-message> does not compute', 'Mike Oliver': 'Take Christ out of Christmas and their is no Christmas.', 'Southern California Deplorable Henry Lindeman': 'I am so sick and tired of kow-Towing to Islam, in this country, get these dirtbags the *hell out* of here, and back to the cat box where they belong.\nand may the *"fleas of a thousand camels"*  infest their armpits along their Journey.\nThanks', 'Connie Twiceshot': '"How is This a Thing?", a show where we hold hands together and get depressed or infuriated at idiotic shit happening at places of power or foundations of our civilization.\n3:00 This is 100% election interference by the corporation and yet, as if by magic, bunch of weasel words and outright lying how it isn\'t is enough to let it happen unopposed.\nAlso, how the fuck the whole "Corporations are trying to take over the world!" turned into "They\'re private companies!!!!!!!!" screeching? I guess leftist NPCs are very easy to reprogram.\n3:50 Given how "competent" Facebook usually is, I really REALLY hope this will turn into one big shitstorm of over-stretching and will fuck their platform even more.\n8:00 CERN IS OVER PARTY, lol.', 'Laughing.Man.d8D': 'The Ministry of Truth is now manifest.', 'hogensan': 'The rise of incompetence continues and financial problems go huge........', 'Frank Lynn': "Everytime I read hate speech I feel like vomiting. \nIt's the ultimate snowflake term.", 'Endor 66': 'The vikings devs should really give people a more lax script. Currently every shill they hire sounds the same', 'Colonel Panic': "Funny. The ENTIRE existence of Christmas is dependent upon Jesus. Sing Christmas songs that don't mention the namesake.  Got it. Full retardation and peak end of civilization.", 'yollam': 'Small suggestion. I like your content but I don’t watch every video from people I’m subscribed to. If you put something about the actual topic, there’d be a much greater chance of me watching. Also, church and state are strictly separated in the US. This isn’t new and it’s not about PC. If you want Jesus songs you can put your kids in a Christian school.', 'Peter Roberts': 'Plot twist... The "Diverse" students were white atheists protesting religious music', 'Aether Toast': 'Hate Speech in the USA was told to fuck off by the Supreme Court so the companies enforcing this based and operating in the USA need to back off this boogeyman.', 'L.A.R.P.': 'Hmm, I wonder why foreigners think we have no culture (or balls). Oh, wait...we do everything we can to sanitize our culture creating a void allowing everyone else to insert their culture.', 'Brian Gariepy': 'More like NPC room', 'Saran Nevac': 'So to be more inclusive of diverse cultures you have to censor certain cultures to be more inclusive? That makes no sense at all. The west has accepted all cultures and religions into our countries and given them the freedom to practice those beliefs. So why are our beliefs being destroyed? When i was a kid we had muslims kids in the christmas play. Its only now with the rise of islamic extremism that people are pandering to them in case one gets triggered. But most normal muslims dont care about christmas. Like for most of us, we dont care about Eid.', 'Dylanrules22': "When I was Elementary school we sang a Jewish song in music class during one particular Christmas season. Although my father was puzzled, nobody cared! Nobody cared when we sang Christian songs either. Why do we all suddenly have to be this sensitive about harmless music? I don't worship other gods, so I'm good", 'Maskkyubii': "So that's why America is being left behind by Japan in medical science\xa0and physics.", 'Dongs': 'jesus was a cunt', 'Ivar lodbrok': "Whites must be willing to reject diversity and multicultural. Its no doubt if multicultural is not stopped and reversed throughout Europe, it will surly be the beginning of the end for the native European. There's nothing worse than being told to rejoice in the robbery of your own homelands throughout Europe. The appropriate response for any race, would be to seize, and protect their homeland from the globalist regime. This is exactly what whites need to do, take Europe back from the globalist, and protect their homeland from further globalist aggression. Whites are waking up, and realizing that their is a war being waged against them, and were furious about it......", 'MultiRokusho': 'Fucking CERN. El psy congru when?', 'Gabriel Lopes': "A multibillionaire company interfering on their country's and other countries elections...Wow I love democracy!", "Ke'reth Makura": 'Religion sucks!!!', 'Joseph DeMaio': "The issue with Christmas carols, the Facebook  war room, and bias against men at CERN all are part of the same thing, the dismantling of Western civilization.  I know many civilizations have fallen throughout history, but I'm not sure if in history any civilization has dismantled itself like this. This is double disastrous with the low birth rates of Western countries.   Regardless, if this idiocy isn't stopped, another civilization will replace Western civilization, one that has male leadership and actually pro  motes itself. And just in time here comes Islam that perfectly fits that description, including much  higher birth rates.  Are the feminists ready for harems?  Are LGBTQs ready to die or go into hiding?", 'Hunter Lafcm': 'Nice job stealing the title War Room from InfoWars Facebook.  What a total fucking joke you are Facebook.', 'Radiccal': 'I live in Virginia..', 'Quball87': "I work in a corporation and I can tell you the bias towards the left and the leftist point of view is seen as the only POV. Everyone is pressured to follow this view. It'll be the same at Facebook.", 'Harry Barnes': 'Doctor who?', 'Dontlie Tome': 'Facebook talking about safety is like a snake promising to protect you from the scorpian, because their poison is bad.', 'Michael Haimerl': "It's ok to be Jesus.", 'Mellow Punk': '"Diverse students" offended by Jesus hahahaha oh man well I\'m offended by some of the chucking of gays off rooftops but hey different strokes for different folks and some of these folks probably had strokes', 'Seth Apex': '>not allowed to sing jesus themed carols in school\n>another school shooter is born', 'beayn': 'So an American company is interfering with the Brazilian elections... and lefties are perfectly OK with this.', 'kit Pemberton': 'Oh so nice lets all grab 1984 and think about double think, Oh I mean political correctness', 'Antipodean33': "I'm not a religious person, that said i don't worry as much about Christianity, as much as i do about Islam. I've lived among Christians, Hindu's, Buddhists for over 50 years and we've all got on fine. Islam seeped in and we have trouble, big trouble", 'Danethanor': 'Jesus was a middle eastern jew and Christianity is a bastardized version of Judaism. They need to replace Jesus with Santa, The great Pumpkin, Thor or maybe Hercules wherever its applicable.', 'speedy': 'Facebook employees where crying because a high up in the company is friends with kavanaugh. The war room will be totally unbiased.', 'Ronald Huffington': "To be fair with the first story, we have a separation of church and state. The schools aren't supposed to push literally any religion on you in any way.", 'sporeman29': 'We are racing backwards toward the days when going against the church resulted in ostracization. May the spirt of Galileo Galilei be with everyone who still has scientific integrity.', 'Mattuiop': "Yet this same school would proudly chant verses of the Qur'an about hitting women and killing gays  :^)", 'Fek The First': 'You forgot to mention that Cleggers is on his way to Facebook to give his ‘biased and balanced’ approach.\n\nHow the hell is that in thing!!!\n\nMr “an EU army is a dangerous fantasy” is now fingers deep in the world of facebook. \nWhat a lovely ‘un biased’ future we all must look forward to now.\n🤦🏻‍♀️\n\nBut as Sir Nigel Farage put it is beautifully...\n“It proves you dont need freedom of movement for low skilled workers to find a job”\n😅👌', 'DesertMav 76': 'I’d like to see a HORDE of Catholic Latino and Gospel African American parents throw an absolute FIT! \n\nThere needs to be an extension of the Bill of Rights to cover the internet; since Silicon Valley is in the US it could help battle the EU’s censoring...', 'kromulous': "Let's see, Islamic students who hate Jesus because they cannot tolerate even other Abrahamic religions? Most Muslims who immigrate to the west are not like this. Why is the teacher coddling to this behavior?", 'Sablon76': 'Alex Jones is controlled opposition! Faceturd, Gluetube & Shitter will be replaced as they beat themselves into a hole that will cause their collapse.', 'Yruasack': 'Capitalism and conservatives create seasonal jobs around the holidays.  Marxism and progressives create seasonal jobs around elections to silence their opposition.', 'halflife352011': "Unfortunately here in the states, it's some butthurt sensitive atheist mom or dad who complain about the Christmas stuff. They threaten to get the freedom from religion organizations involved, schools get scared and out the door our culture goes. I've seen this scenario repeat itself. You know, once we remove all traces of God in public we will gain that utopian society😒🙄.", 'wyopaul82': 'Call it what it is. The West is being colonized.', 'Troy Stuart': 'Check out “call the cops: cafe”. You’ll have another thing to explain how it’s a thing lol.', "Sid'istic Atheist": '1:09 It\'s _"Baa Baa _*_Purple_*_ Sheep"_  all over again... AAAAarrrgghhhh!!!!', 'Mathieu Leader': 'Jesus has a role in all of the abrahamic faith though', 'Cornpone': 'Everyone (anyone that thinks for themselves) needs to take a deep breath, and delete your Facebook account. It’ll be ok...... I know it’s become a standard of communication of sorts, but there are alternatives. Besides, anyone in your life that you truly care about, you already communicate with in other ways, right? You don’t need it....... it’ll be ok.', 'LamentedGuide': 'You what makes me fucking SICK of PC culture?! It’s this notion that we can’t be “offensive” to other groups of people, yet EVERY. SINGLE. GOD DAMN TIME. It’s done by suppressing something even marginally considered white, patriotic, and/or judeo-christian in nature.\n\nHow the FUCK is this right? Offending a majority group for the sake of something that MIGHT offend someone else is so ass backwards!', 'Wotsalot Grau': 'Oh Dave. \n\n\n"Whhhhiiite Men" and people have to Behead them self\'s and hand it to there "betters" on a silver platter or else we\'re all Bigots and Racist... and what ever "ist" that is out there... as long as its not against men.... whhhiiite men.', 'Ferris Bueller': 'If "diverse" students are so easily offended by Christian values in Christian countries, they are welcome to sod off to whatever s***hole country they came from and worship whatever garbage that helped make their country a s***hole. If you have kids at any such school, pull them out.', 'Hydrogen One': 'You got to control the narrative.', 'THICC IRON': 'They already have taken culture, now science?', 'stephan daoust': '(((Divers))) students', 'Greg': 'So the "diverse" children might have been atheists… and as a public institution it has no business promoting any religion.  In America there is still a heated debate about the role publics schools should play in the promotion of Christianity.', 'NPC 10143': "Orange beard man bad. You don't have to think like we do, but if you don't you're a nazi and should be banned!!!", 'Words of Cheresie': 'If religious carols are to be banned, then all dreidels and menorahs must be banned too. The dreidel has written on its four sides, "A Great Miracle Happened There". Every single dreidel is religious indoctrination. A menorah also represents a religious miracle and thus must be banned.', 'palimpalim': 'Leftists are so stupid, they even don\'t get the correlation between "Christmas" and "Jesus".', 'Aqua Fyre': 'Holy Jeeeezus  -- the world has turned into an episode of Southpark.', 'Thumbs Down': 'Away in a manger, no crib for his bed,\nthe little Lord Jesus laid down his sweet head.\nThe stars in the bright sky looked down where he lay,\nThe little Lord Jesus asleep on the hay.\n\nThe cattle are lowing, the baby awakes,\nbut little Lord Jesus no crying he makes.\nI love thee, Lord Jesus! Look down from the sky,\nAnd stay by my side until morning is nigh.', 'Inisfad': 'Just another reason to dump Facebook.  Let it go the way of My Space.', 'im160bpmplus': '20mil playing that game? How is THAT  a thing.', 'Tsynami Garmadon': 'What has the world become?!', 'N7Mith': 'Be consequent then, take away all the Santa carols as well. I know that some Christians find that offensive too.', 'Francine': 'Children are assholes at times. The younger ones are malleable but the older ones who can see what a load of horseshit the no religious carols policy is will happily troll their peers by singing them. What is Chesterfield school district going to do? Suspend the kids for singing? Do you know what kind of blowback that would bring?', 'OneLittleAlex': 'This it people! The last pure thing in this world is under attack! Time to get out the torches and pitchforks!😂😤', 'SolidNEIN': "So diverse we can't include Jesus? Come on😇", 'Geoff Totten': 'They do this at some schools here in Australia as well.', 'Jon Schultheis': 'Who watches the Watchmen?', 'ThatUndeadLegacy': 'Diversity = the death of white people, the death of freedom.', 'Aard': "I guess fairness isn't their biggest conCERN", 'Apoc5k': 'Islam deserves to be irradicated from every corner of the world, Islam is cancer.', 'Nathalia Archer': 'Your kids will be singing praise of another God a few Christmases from now.', 'jonrmahnke': "I got rid of all social media accounts.  It isn't worth the bullshit.", 'A Shekel For A Good Goy': 'I remember waking up one day in the 90s and being told I suddenly have to care enough about non-Christians to change my religion. Guess what faggets?! If you can’t let me live my beliefs the way I wish I’m fine with a Crusade to wipe you out.', 'Zargonof': "I'm ok with the Christmas Carol thing because separation of church and state.  Schools are not a place to teach religion.", 'Anthony Giacopello': 'Good thing I don’t use Facebook, that site for old crusty boomers anyway', 'PDD 60 Absorbed': "Contrarians don't like any references to what they deem myth and primitve superstition in the form of Christianity. According to them, this pie-in-the-sky rubbish is not only false, it somehow scares the hell out of them. Forever learning but unable to come to the knowledge of the truth.", 'Bry 117': 'How is this a thing', 'llriv': '"Sophisticated troll" (noun) -- A person we want to purge, but having no real justification; we call them a troll.', 'theresa42213': "face book war room\xa0 > ''Packed with Millennials''\xa0 to\xa0_'save'_ an election ??!?!\xa0\xa0Oh\xa0GEE!\xa0 Now the population\xa0can rest easy!", 'Aeon Underhand': "That Vikings War if Clans only lets you select two genders.\n\nI wasn't going to sign up but I think I will now :)", 'CaptmagiKono': 'Modern "scientific" academia is no longer about truth, it is about diversity. Guess we won\'t be getting off Earth anytime soon.', 'Warped Reflection': "When I was at school the kids of non-christian faith were excused from assemblies when the local christian minister was there and the ones that didn't give a crap and came to assemblies  either joined in the with the singing or didn't. This was the same when my sons went to school. \nSo is it the kids crying to their choir teacher about this or a case of their choir teacher taking offence on other peoples behalf and virtue signalling."}{'Stephan F': 'How is 4am to midnight 24/7? LOL', 'Ralph Macchio': 'We are now mirroring the Roman Empire.....', 'CaptmagiKono': "During the mid-terms, I'm voting against anybody that the mainstream media is championing behind.", 'Jim': "That's a shame about the carols. Carols like Little Town of Bethelem, Hark the Herald Angels Sing and Tidings of Comfort and Joy are often among the best songs to hear at Christmas.", 'Comic Book Guy': 'With less patriarchal pigs getting in the way, CERN can now put the LHC to work searching for the elusive "misogyny particle", thought to be the cause of the hateful misogyny which is keeping millions of genius women out of STEM.', 'HotblackDesiat042': "Imagine that!  CHRISTmas carols might have a CHRISTian bias and thus may contain the name Jesus in the lyrics.  Who'd a thunk?  There is no limit to the stupidity of the Left.", 'ian elley': '" That which can be asserted without evidence can be dismissed without evidence ". Christopher Hitchins. If only !', 'A not so silent Robert': 'The CERN story makes me wish I could change world lines.', 'rob28803': 'There\'s going to be a massive media censorship drive for the mid-terms- blatant shilling for the left, blanket bans for the right, lies and spin and beat-ups in an open attempt to sway the election, much worse than any puny attempt by the Russians last time. Now the left are desperate and will try to win " by any means necessary"', 'John Henry': 'Civil war is coming. This is the end goal of cultural Marxist Zionist idealogies.', 'Victor Von Doom Jr.': 'Communist Agenda:\n- destroy any established system\n- create chaos in the process\n- take over with ease to reign\n- establish slavery of body & mind.\nSolution:\n- kill every communist\nPeople will shun you, shame you, blame, you, hate you, arrest you....but years later you will be celebrated as a hero.\nJust look at Simo Häyä.', 'covfefe': 'What are "diverse" students?', 'Harry Forsyth': 'sing it with me now HARK NOW HEAR THE ANGELS SING A NEW CHILD BORN TODAY MARYS BOY CHILD JESUS CHRIST WAS BORN ON CHRISTMAS DAY', 'Mr S': "As I understand it many of Facebook's watchdog algorithms are text based. So write your messages out on a piece of paper old-school style in hand writing and take a blurry picture of it and upload it to Facebook. I mean hypothetically speaking that's what I hear people can do.", 'Okaro X': 'How can a student be diverse?', 'mythgraven': 'First full minute is ad for f2p game.', 'Yosef Yonin': 'all cultures are diverse...\nexcept white Christian/jewish culture. we need to eradicate those in the name of cultural diversity.\neeyup makes sense to me....', 'ldk777far': 'Why bother having Christmas at all! Because Jesus is the whole point of Christmas! We need to stand up to this crap!!', 'Anthony Bennett': 'FaceBook and Google utilize the Southern Poverty Law Center as a fact-checker/truth arbiter for crying out loud. The SPLC is actual hate, intolerance and racism.', 'BrickDevil Tributes': "CERN....\nAye, it's me. The organization has truly begun it's quest to achieve world domination. Yes, I know. I'll commence operation restoration. El. Psy. Kongroo.\n\nBut in all seriousness, another reason to keep my up at night. 1984 is looking ever so closer with each passing day....", 'Jay isbored': 'Off topic but was computing forever one of the personalities that was shilling the candid app? Just found out about that debacle', 'Andrew Foster [Matthew 5:43-44]': 'We could create a form of DOS (denial of service) by everyone posting NPC memes etc. Continually. Swamp them with pointless censorship so that they are incapable of focusing on any real news.', 'Super Sheepy': "Like new years and Chinese new year, have the school have all religion rather then no religions. I'd rather kids know all cultures rather than cry it's not there religion", 'Imgema': 'Singing carols is offensive. Muslims whipping themselves in public is progressive.', 'e n o u g h': "The world isn't dying, someone is killing it, and the people killing it have names and addresses.", 'son of Susan': 'Diversity is out weakness', 'Kuuppa FIN': 'Watch out for the rising of the New world order and Orwellian world wide government that will destroy this world. Be aware! Remember 1984! Its so unbelievably clear whats happening!', 'Controversial Topics': "So let me get this straight, a holiday entirely based around the birth of Christ has a school that refuses to sing carols that have Jesus's name in them? Yeah sounds totally rational... I may not be a full on Christian but I feel this is pushing things a bit too far, it was bad enough when they removed the pledge of allegiance and the lord's prayer from schools, not to mention the nativity scenes from government buildings but to push this agenda further is just insanity.", 'Mark Browne': 'No at all happy that El Presidente Michael Huggins is shilling his ads on your channel. I hate Liberal You tube.', 'ShortbusMooner': 'I get such a feeling of frustration after these vids..', 'discmach': '"Judeo-Christian" roots. Yeah you need to go read up on that. You\'re simply wrong.', 'Aracore': 'THIS VIDEO NEEDS TO BE SHARED TO EVERYONE.  Facebook finally done fucked up and even if the governments dont take them to task.. the userbase will just ... LEAVE.. this is just one step too far and will be for most.', 'aka DORK': 'Seen is concerning to me because I have sons in stem & tag & smile school programs , how will they advance if not by merit', 'ck risk': 'The Russians and the Chinese would be more then happy to take these pesky white male scientist off our hands. \nAs for the Christmas Carols, as the song goes " another brick in the wall."', 'AlphaBiggitz': "When can we finally ban Ramadam and Mohammed for the purposes of inclusion?\nI noticed South American and Mexicans weren't included in the Russian/China interference on Facebook's watch list. Illegals voting and whatnot.", 'Adriano Agostino': 'Supreme Court already ruled on hate speech. These tech companies are setting themselves up to get sued eventually. Fingers crossed...', 'Breaking Brad': 'As a Jew I would not sing any songs about Christmas and jesus and the birth of jesus. I do not celebrate the "Christ\'s mass" nor do I believe jesus is the messiah. If it is a public funded school in the USA they should not be singing songs about jesus, mudslidemuhamid, buda or Judaism. \nNo.. I cannot say "how is this a thing". \nIf you want to sing songs about the birth of jesus than you can go to church.', 'Antonovich': 'Ok the 1st story, fuck right off! Religion is a cancer in modern society! I don\'t have a problem if they "banned" Christmas carols, and I\'m pretty fucking sure Dave wouldn\'t have a problem if the kids were previously been forced to sing some muslim songs and those songs were banned!', 'Joseph Rosario': 'and this is why i never used facebook...knew long ago it was going to go bad.', 'American Restoration Initiative': "Our culture offends them? Wow, it's like we need a place of our own just for us to be ourselves...", 'ShogunBean': "The left is runing scared in America all the internal polls are saying the expected blue wave is more of a ripple. Let's hope for freedoms sake it is so.", 'Zontar': 'CERN is only concerned with developing time travel with microwaves', 'Maddog3060': '[ sees Facebook story]\nWe were all so worried abouy 1984 that Shadowrun snuck in behind us.', 'Charles Belton': 'The Higgs Boson is RACIST!!', 'Pepe': 'Might as well cut the bullshit with us government and just microchip us all now tbh. This is the only thing left to kill the west.', 'MrRABC1': "And the destruction of the west continues. .  .what vile scum these leftists are. . . \nHow much hate would have to be in you to want to destroy the fairest and most moral nations the world has ever seen??? \nI am the biggest critic of Christianity you'll ever find anywhere *EVER* but when one peaceful religion is being targeted when it is 99% peaceful and the one's that are violent are completely left out of even the smallest criticism by the same people calling the peaceful ones out for whatever stupidity they are involved in I can only dismiss *ALL* of that persons arguments as they are clearly operating on two tier system where one is exempt from criticism and the other the obvious target. . . \nHow this isnt making alarms go off in every sane persons head makes me stand in awe at just how well left wing indoctrination works. . . \nHow can people be so blind towards what are obvious facts. . .  its more obvious than a punch in the face ffs. .  .", 'Raymondx': 'I have never seen a “free” mobile game that is 100% “free”', 'jason kennedy': 'Colonize Mars, send the entire left Socialists, femmests there. Then Nuke the fuck out of Mars.', 'Farmer Jon': "1. if there is a problem they could send a note asking if parents have problems with Christmas carols. 2. Facebook (and any social media site) having a war room is scary. 3. WTF CERN, really? Well this isn't new", 'That Cynical Guy': 'Wow enlightening! No one is surprise; a few critiques. The people destroying said country culture is of said country majority; white leftist. Education is compromised; thanks to the Frankfurt school of social theory. Only if McCarthy had stuck to his guns. We wouldn’t have been here.', 'Squire Praggerstope': 'Yep, STEM subject academics are being dragooned back into the era of Copernicus and Galileo....   by a contemporary p.c. version of the Papacy.', 'Sulphurous': 'Please, go ahead and ask one of these people what they exactly mean by "Diversity".', 'PissedOff RebelinMI': "3:07- ARE YOU FUCKING KIDDING ME?\nThey don't need facebook!\nDemocrats and Republicans smear campaign eachother all the time with fake news on mainstream TV and radio! I am sure they do it in other countries as well, accept for maybe Airstrip 1, where the left has become oligarchical totalitarians defending their far right Londonstanian refugees!", 'The Thinking Man': 'Those games are pay to win, copy and paste, money sucking trash my friend! Please choose a better sponsor.', 'Alex Dunham': 'Those Virginians should go to that school and begin singing Christmas carols just off the property and spread some Christmas cheer', 'Electric Dreams': 'CERN is concerned exclusively with drawing funds from various governments and non-governmental agencies. Science is an afterthought there.', 'Daniel Maycock': 'These articles clearly show a dual standards approach to gender and racial inequality.  It\'s ok for one group to shout, complain and highlight issues, but god forbid if the so-called "white privileged" males speak up for the same reasons, even if they are justified.  Science requires investigation of particular topics, which needs knowledge and experience.  Surely if these roles are going to someone less qualified, it\'s going to take far longer to complete or could even be wrong in the first place?', 'B L': "I deactivated my FB account weeks ago. I don't have any faith in that platform anymore.", 'donado xie': 'This is not a video! This is just a stupid advertisement for brabants day leaf!', 'Real Human Bean': 'Imagine how great America would be if we had been taking in people like Dave Cullen since 1965 instead of third wordlers.', 'Peter Lantela': 'the demons possessing the children cannot stand the mention of his name.', 'SimeonDoesStuff BG': "The four Gospels are, at this point in time, the only books of the Bible that I've read but one thing I remembered was that Jesus himself straight up denied being God in all four of them. I may be mistaken as this was a few years ago, but I'm 99% sure the divine nature of Jesus was a later creation.", 'Chrisfragger1': "You could say, as a Christian I am offended by this action, but as a Christian you are much less inclinede to KILL them for offending your religious beliefs, so they won't care.", 'Paul Wilkinson': 'There is more than enough diversity within my own western culture . I don’t need any other backward regressive so called diversity from backward cultures that have nothing in common with our values .', 'Tom Donnelly': "It's my birthday and I get a How Is This A Thing, Dave you spoil me.", 'Highlander Jeff': '*Facebook* we are the ministry of truth', 'Laurence D': 'The west is best', 'James': 'But Islam Shouting their Prayers is cool?', 'RavenPrecept': "It's happened, some people are _Diverse_ and others are not. Everyone who is not _Diverse_ has to give way to those who are.", 'kyokogodai': 'The Left must be stopped, before they destroy us all.\n\nEDIT:  I have just become a victim of Facebook\'s "War Room", having been banned for 3 days and the "offending" post being deleted.  To HELL with Leftist social networks.', 'Alexander Leslie': "I don't give a fuck", 'JazzyJ': "But Dave, Christmas isn't Christian in origin. It's pagan.", 'BlunderingFool': 'Dave, Vikings is nothing like the Strategy games of old, stop plugging that pay or wait crap.', 'Ben Chapple': 'Have these people never heard of Galileo Galilei?', 'space man reviews': 'F--K DIVERSITY! HOMESCHOOL YOUR KIDS!', 'biostemm': "Regarding the Christmas Carol thing - if it's a public school, then they can't endorse or otherwise promote any religion.  Now, if they were to encourage or otherwise allow, for instance, Islamic songs to be sung by the school chorus, then that would be hypocritical...", 'The White Wolfos': "It's absolutely scary that a person can get his job fired just for suggesting men can be discriminated against, especially when study supports this idea.", 'Poisonedblade': "My old team works for Facebook.  They're a bunch of feminists from SF.\nOne literally went insane when Trump won.", 'A Salamander at Heart': 'Imma start singing songs of the crusade', 'Aroven Talmav': "Heinlein's Republic when?", 'Reu Seven': 'Do you have any plans to do a video about South Africa?', 'EriolTolkien': "I am an atheist and I still sing carols. I'll sing whatever the fuck I want.", 'Maxwell Smart': "So that's the new buzzword for pisslam....\nAl's snack bar can fuck it's self", 'Mr. JustAGuyWithALightsaber': "I'm atheist and I think it's wrong to remove Jesus from Christmas carols.", 'Ojama Black': 'Jesus Jesus Jesus Jesus Jesus Jesus!!!!!! How many NPC’s did I trigger?', 'alic seprin': 'I have a headache', 'Big-gunbrother25': 'The amount of brainwashing and literal whiteout or blackout of European culture (see what I did there XD) is basically self genocide on the lefts part.\n\nWhere does the madness end?! Cause if this goes on then there will be nothing special or left of European culture and not to mention values if these idiots behind this aren’t brought down.', 'Faolan Hart {Animal Above The Man}': 'To be honest I hated the school prayer/hymn. \nI\'ve never believed in god & when I realised that\'s what it was about I disliked it more.  \nI eventually stopped taking part & would end up challenging the teachers as to why I have to take part in a religious ritual despite not being religious?\nFunny thing is that let me sit in silence after that. I still had to be there but I didn\'t have to take part. Good enough for me. \n\nI feel the same way about religious holiday songs. Kids shouldn\'t be forced to take part in them because apparently its part of our "culture".\nIf I must be religious to be part of a culture then I might as well move to Saudi Arabia.\nBanning them is going to far. They are part of our history & part of many people\'s lives. \nBut they shouldn\'t be forced. Religious things should never be forced. \n\nI remember being on YouTube when a bunch of Christians would basically call you evil for not liking those songs. \nNow we have a bunch of SJWs basically calling people evil for liking them.', 'paul riggall': 'Diversity =no whites', 'Mike Groneberg': "I am atheist and think that christmas songs are not ofensieves. They should get us into the mood for Christmas.\nIt does not matter if you see Jesus as the son of God for the songs. one should only get in mood. what's wrong with that? Christmas has never had anything to do with religion for me and my family.", 'Falstaff': "We are in a culture war against those who have discarded all pretense of fair play and rules of engagement. There is no lie too big, no misrepresentation too outrageous, no mischaracterization too personal, no pawn too innocent, no manipulation too shameless, and no intimidation too vicious for them to use against us. \n\nThe left have demonstrated time and again that they will do anything in their power and use everything in their arsenal to advance their global, socialist, anti-Western agenda. They've poisoned the well of education and deployed activist judges to corrupt the justice system.  They've taken control of public discourse and silenced the opposition by rigging social media. They've destroyed the lives and livelihoods of their opponents by fair means or foul. \n\nThese ruthless social terrorists have no interest in genuine debate, real data, or rational arguments. They care nothing for the truth, or decency, or fairness. They continue to employ guerrilla tactics in the culture war. Meanwhile, noble knights on the right rush into battle on fiery steeds clutching the shield of integrity and the sword of truth only to get mowed down by 21st century weapons. The field of battle is starting to look more like a bloody massacre as our best and brightest leaders and fighters are targeted and taken down one by one. \n\nI don't pretend to have the answers, but we have to start seeing the situation more clearly. We need to stop fooling ourselves into thinking that old strategies and battle plans will be enough to save us in this escalating ideological war -- or the gulag awaits.", 'Challagar': 'The leftist ideology is only dominant because they are the loudest whiniest voices out there and they have Hollywood and the corporate media to shout their gospel.', 'kesselrunner': "Definitely not surprised about the Christmas carols.  I've seen a lot of this going on over the years.  Post-modernism tells us that religion is obsolete, that it served its purpose to humanity when we had a more primitive mindset.  Newsflash: People haven't changed.  At all.", '_ Tommo': 'Equality and diversity over quality and merit? OK. 50% quotas of females in all combat arms jobs in the army including units like SASR, SBS, Royal Marines, Paras. Females must make up 50% of all soldiers deployed on operations. No dropping of recruiting and selection standards. Mandate it in to law now. If women want equal opportunity they must share equally the mental and physical burden of war not just esteemed civil and academic positions and status.'}{'Google Sucks': 'Division is our strength. -NPC', 'ThePreciseClimber': 'Clearly CERN would rather focus on developing time travel tech and creating a dystopian future.', 'installtekz': 'I\'m Christian but like many other Christians, I\'m not religious. But we need to stand for our religion. "This is against my religion and is offensive to me that Jesus is being suppressed like this" I AM OFFENDED', 'The White Wolfos': '"The war room is staffed with millenials..."\n\nWell colour me surprised, I didn\'t see that coming.', 'Lyton Coil': "I'm not christian, but singing a song like that is fine by me, I wouldn't complain.After all, I'm still a member of this nation, a nation raised primarily by christianity, It's the least I can do to sing a damn song.", 'Rooster Gold': 'Its a Christ<------mas song............ his name is on the tin.', 'Winston Smith': 'How else are the "diverse students" supposed to get in on this lucrative and beneficial "diversity?" You wouldn\'t want to exclude them, would you, Miss Diversity Officer?', 'Pieter le Roux': 'A lot of christophobians ...', 'jon The hermit': 'Sophisticated trolls, like the guy who came up with npc? I hear he a dangerous genius super villain .', 'Theodore Pinnock': "I saw this thing the other day: A tech company celebrated having a 50:50 split of men and women in its recruits. They hadn't done this by lowering standards or actively discriminating against men, but by recruiting exclusively from only TOP-LEVEL universities with mostly women in their graduating classes, women who had high GPAs, so they were still recruiting the best people for the job.", 'naseilat': "Is it a war room or a whore room? After all they're willing to bend over and take it from the likes of the California, CNN, NBC and ABC too keep the masters happy. Zuchbot has become a sex bot!", 'Cary B': "Facebook is becoming sinister. Grown ups do not need 'protecting' by dumb millennials.", 'Danny Grant': 'Let it go on until we reach peak insanity! Why not ? Surely right minded mentally strong people are not listening and adhering to this madness ?? So let the loons destroy themselves hahaaaa. It’s very hard for normal people to live in society at the moment but as soon as some kind of financial catastrophe, or war is on the horizon do you think people with give 2 fucks about someone’s safe space ? Or listen to one thing a feminist has to say ? Not a chance !! It’s like reading the desert menu on the titanic ladies and gents ( and freaks) this shit is going down , your pc nonsense is only furling the fire .', 'its_a_trab': 'Also! Drinking milk in the morning is now racist, accordinging to PETA', 'Neon Eviscerate': 'The SJWs do realise that most of these "minority" folks will likely be Christian. Ffs even in Islam they consider Jesus a prophet.\n\nThis has nothing to do with protecting minorities, but shielding their own fee fees.', 'Mr Q-tip': 'Who uses Facebook anyway?', 'glen jackson': 'Why does offence taking of diverse students trump my offence at any use of islamic teachings in front of me?... what happened to actual equality!', 'burnzy3210': "Dave, can you please decide if you're for or against phones and their addiction. your phone game sponsor seems to promote behavior counter to your previously mentioned views.", 'Dylan Ross': 'So Facebook set up their own truth Ministry huh?', 'WeWuz Cavebeasts': 'science and facts are sexist eh, cheers Dave', 'Woden of the Angles': "Good video. 'European roots' are pagan though, not Christian. In fact, it's cuck-Christianity that is one of the reasons we're in this mess..", 'Epicforger 12345': 'Banning christmas carols is the stupidest thing i have ever heard idiots', 'TheZodiacz': "Why is Facebook's whore room only staffed by millenials? Where is there age diversity? I demand they have a quota of grannies. Especially as research has shown under 30s are the least likely demographic to actually use the tired and dying old Farcebook platform.", 'Mac Clift': "Slowly but surely these *invaders and usurpers* (i.e., the *exploiters:* watch Stephan Molyneux's video: The Ideological War) *are gnawing away at and destroying* our culture: *we are allowing them to do this* which means *we are willingly allowing ourselves to be lock-marched to extinction!* Like a plague of locusts (or NPC Langoliers, take your pick!) they have settled on our culture and when they have finished, *there will be NOTHING  left!* It might be wise to remove the welfare handouts that these opportunists are growing fat on!", 'Sara Jeong Fan': 'The Guardian and BBC want you to breed the white out of you.', 'HIKKUPZ': 'Ban all religion if this is the case not just christian religion. #REMOVE ISLAM from Western Schools.', 'Nico': '"I\'m offended" is not an argument, it\'s a "gotcha" statement. It is the stronghold of political crybabies who "know" they need to fight, but can\'t explain why. It\'s a non-starter, because it\'s a show stopper. It has only one function: the immediate cessation of critical thinking.\n\nBecause in a world of ideologues, thinking is dangerous.', 'colin a.': "If you dont like it or you are sensitive to think that you don't like, I would tell you to not be there or better yet stay home with your family who thinks you are victimized by being born.", 'Lahbreca': 'Civilisation and C&C were _role playing_ games?', 'Trunk McEight': 'The emergence of the Digital Cheka...', 'Jeff T': "I'll be home schooling my children.", 'GOAT McGregor': 'Stop saying judeo Christian', 'Akurei': "Seeing some of the crazy things happening today makes me wonder what is it going to be like in 20 years when those confused ''theybies'' grow up.", 'Lyceaos': 'ok first story and gotta put some facts here that you missed, while im against this bs of stopping them from having any songs, the US is not actually founded in jewdaochristian roots in any way if anything it was founded on something closer to an agnostic spiritual ism considering some of the founders were the closest thing to out right athiests youd see at the time. also as soome who boht knows a lot of jewish people and has half my family jewish, that term alone is actually well rather stupid and nonsensical. but ill point you to liana K on youtube who can doa  far better explination then i can on that. also damn fine youtuber and nerd like many of us', 'Xeno Man': 'Dave, to most of these individuals and corporations who are using these deleterous, or murderous and censurous methods, i like to ask one question: what is their worldview/moral basis/belief system? \n\nThe spirit of both Western Secularism and Islam is the same: submit to the system for total control. This is why is it no wonder that MANY examples of secular individuals and organisations, which would NEVER support anything even vaguely Christianese, are truly now justifying their acceptance of Muslims and Islam into their ranks!\n\nRemember when it was good for these hypocrites to rebel against the basis for the moral norms of their societies? But it turns out that it was only a lie just until their values had gained enough POWER, even as a minority, to now start revealing their very horrifying designs for the rest of us.\n\nI know that some may see this and say "But "I" am not like that! And I\'m not religious etc"... yeah, #NotAll', 'Darren': "But, but... It literally has his name in the holiday.  CHRISTmas.  It's celebrating the birth of Jesus.  These people are just plain idiots.", 'The Commenter': 'The term "Sophisticated Troll" makes me laugh! REAL trolls are not "Sophisticated" =D REAL Trolls are just blatant assholes LOL\nWhat they are talking about are memelords and jokesters.', 'Ari Bargolani': 'Personally I think all religions should be kept out of school. Seperation of churchband state, and these are public schools. There are plenty of children and holiday songs to choose from that do not reference religion. But we have come to a point where it is a tradition to include these Christian leaning songs and teachings and in these schools, and tradition is religion\'s second cousin. These state schools however don\'t want to keep religion out of the school, simply the religions that would trigger the "diverse" students.', 'no privacy': 'I am a dues paying member of one of the organizations that work to keep religion out of government and organizations and activities that are government funded. Separation of church and state is one of the 5 rights gauranteed by then first amendment to our constitution. The first amendment is first in our Bill Of Rights because it contains our most fundamental, our most important protections. It is what keeps use from having happen to us things that happen to you.\n\n It is part of our heritage from the beginning of our nation. We have no need to have a refermdum to end blasphemy laws. We have no worry that we might find ourselves in prison for so called "hate speech" such has happened in your nation.\n\n We are free to criticize any religion be it Islam or Catholicism.\n\n We are gauranteed that even in a community dominated by Islam we will not have Islam enforced on us in our public schools. The same goes for all religions including yours.\n\nIf we did not have the freedom to say things that others are offended by, we would be a nation like yours where your speech is not protected.\n\nIf we did not have freedom from all religions, we have no religious freedom. We would be like yours where you fear that one day Islam would take the place of subjegating us and being forced upon our children the way Catholicism is in your nation.', 'Mordakai Silberstein': 'They never have a problem with non Christian Westerners.', 'Spatterjay hoop': 'Our discourse is now put in the hands of spoiled far left millenials..... Humanity is doomed', 'Dom Reale': "If these fuckers don't like christmas they can always fuck off to the middle east.", 'daniel webb': "Assume they will be advising the parents not to give Christmas presents to their own children too?\nNon Christians receiving Christmas presents is cultural appropriation? So atheist's children should go without / be punished?\nMadness", 'Mivs': "Diversity of religion should work both ways otherwise there isn't diversity,\nI'm just seeing suppression of Christianity and the submission to Islam on the rise \n Islam means to submit.", 'william joyce': "I don't think government employees should be teaching children religious carols of any kind, but the government shouldn't be running our schools in the first place.\nI understand the argument for public funding of k-12 education (that's around age 5-18 for those outside of the American system) based on the fact that children are somewhat of a special case when it comes to their right to an education, as that right can't be dependent on whether their parents are complete fuck-ups or not, but I don't see the argument for the actual running of the schools being up to the government. I'm a firmly believe that we should make use of charter schools which could introduce the great benefits of market competition into k-12 education, something that it sorely lacks right now.\n\nMaybe I'm missing something, but the wide acceptance of public schooling makes no sense to me, not just for the benefit of competition, but also because it separates the state from religious practice in a way which I think -would- should leave everybody happy. I understand the argument made in this video, but even as a strong defender of christian values, I think that the principle of separation of church and state that Jefferson spoke of is does more good than harm, and is something that should be kept as strong as possible. This separation would be much easier to uphold if the government wasn't inserted into every damn aspect of our private lives, and so we should take every opportunity that we can to get them the hell out of all the roles they've adopted that are not legitimate functions of the state.\n\nGreat video though. Been watching a lot more of your content lately.", 'Poes Law': 'Is it a US public school? If so then good. Religion and ideology has no place in government or education.', 'Lenny Pearl': 'Remember the first South Park episode with My. Hankey, Phillip Glass and the "happy, non-offensive, non-denominational Christmas play"?', 'Gerard Short': 'When I was in senior school in Ireland those, the one or two, were allowed leave the class when religion came up.', 'kabur88': "Don't they know that Christ is also considered a prophet in Islam?", 'Zero Tolerance': 'That was a short one! Also, perhaps we should just start posting statements with links to confirming evidence that proves our point?', '2nd Amendment for Canada!': 'then we want Mohammed\xa0and the word Israel\xa0banned because it offends us', 'Support My Patreon': 'Another nice video Sargon of Allad. Great choice!', 'KRZY !KZ': 'Go to bed', 'Kisama001': 'Hey fuckers !! When you come to my country, you do not get to dictate which of our traditions are acceptable. If you have a problem with our culture, and traditions, then you can take your ass back to whatever shit-hole country you came from. You are a guest in our country !! We will tell you which of your traditions are unacceptable in our country !!', 'Edd25164605': "So Christmas....literally 'Christ-Mass' is being excluded from Christian carols to appease non christians !?!.\nWhen is this shit going to end?.\nAre we going to rename the festival 'DiversityMas' next!?!.", 'veritas6464': 'Lol..."sophisticated trolls", lol -\xa0intelligent white people with sound reasoned arguments and the ability to articulate them! Which is why I say arse\'oles to\xa0lucid dialogue! FUCK\'EM! Worthless wankers! Stick that in your Ai and Algorithm it!', 'MaTtRoSiTy': 'I suspect Facebook is going to censor anyone who is guilty of wrong think as the mid terms approach.\nI just got a month ban for literally stating I have nothing against transgenders but I reject the 72 genders nonsense and I won\'t pretend biological facts don\'t exist. \nApparently this is "hate speech"! \nNo abuse or threats, nor singling out any individual... fuck Facebook, they are nothing but a faux liberal anti conservative propaganda machine', 'Matt Jones': "At this point in time its looking like The Western World is currently rather subversive and could very well end up escalating into an all out war between citizens and illegal immigrants a like (I don't like using the term Civil War as I believe it to be an oxymoron) based on opposing religious and political views or we'll end up in a Dystopian Future just like 1984, either way the globalists win", 'Shàydo Rahl': 'Your surprised scientific organizations fire and blacklist those with wrong opinions especially when they are backed by evidence?!\n\nThis shit has been happening for decades against critics of Secular fallacies like Evolutionary theory (Excluding sub speciation).\n\nFiring and blacklisting scientists who commit thought crimes is part and parcel of modern mainstream “science”.', 'B E': 'C unts\nE ven\nR uin\nN erdom', 'Derrick Brinson': 'I never get this "you can do that \'cause I don\'t like that stuff" kind of attitude like in the first story. My family never celebrated Christmas or Valentine\'s or whatever but we never pushed that on anyone else, I just didn\'t participate.', 'TheBcoolGuy': 'Next one will be on my birthday! :D', 'TheNumberOneRealis': 'How is the first story bad?\n\nThe story doesn’t mention them singing Islamic songs instead or Jewish songs instead\n\nTheir reasoning is stupid but no religion should receive special treatment just because it’s a minority. If you don’t want them singing Islamic songs then they can’t sing Christian songs', 'Julian Thornley': "Kiora from New Zealand on the first article about banning Jesus from Christmas carols is this in America where they ram Jesus and prayer in schools down people's throats I went to Catholic schools the last one I went to was an all boys Catholic School only class I don't go to in the end was religious studies how religions forget history amazes me and and how conveniently they forget the Crusades the Spanish Inquisition multiple other things child abuse pedophilic priests etc etc as a result I left the Roman Catholic faith I could not be bothered with an arrogant bullying controlling organisation full of contradictions double standards and hypocrisy on a later issue where Facebook showed it's war room America again for hate speech other things all I can remember is the nineteen fifties McCarthy witch hunts four Reds so when conservatives go on about their free speech being censored how can friendly they forget also where they were talking about Russian Chinese and Iranian interference seems a bit rich coming from a country that interferes in the internal affairs of other countries and is willing to turn a blind eye some of the most brutal corrupt greedy regimes provided a anti-communist", 'Archibald Buttle': 'So if I find Islam offensive will we hear no more on the religion? No more mass prayer meetings on the streets of the UK? No more celebrating Their holidays? Ah right, I thought not....', 'Kevtairn': "I wish women didn't need affirmative action in stem.", 'Gareth': 'Is the Vikings game the new Candid?', 'arami187': "I'm too Drunk for this (2am at USA).", 'Neil Price': 'Back in the 90\'s, My Secondary school had students from multiple faiths and they just celebrated everyones religious holiday equally. Christmas was given the same attention to Eid, Diwali and all of the other holiday\'s.\nWhy exclude bits from them?\nEvery year sections of the right like to claim "A war on Christmas" or on Christians in general and stories, like the one where they are going to cut Jesus out of Christmas Carols, is actually giving them ammunition for their claims.', 'The Scrambler': 'Christ is King and I will always sing his praise.', 'Arcadia Occult Curio Shop Autumn Storm Hp': 'You do realize that Christmas is actually a pagan holiday it\'s The Rebirth of the sun God in the religion of Witchcraft and most of the Christmas carols are infect Pagan songs like Deck the Halls and Silent Night "Joy to the World the Lord has come let the Earth receive her King" and seen the fact that everything about christmas and is in fact Witchcraft and the religion of Witchcraft is a marginalized group these libtards are attacking a marginalized religion... And that bothers me.\n we Witches will continue to celebrate the rebirth of our sun God and christians will continue to celebrate the birth of their christ and if you don\'t like it drop dead!\nBlessed be... Autumn Storm Hp', 'Yeev': 'Oh my God, this video came from the future!!!', "Molly O'Kami": 'In the words of Foamy the Squirrel, "LEAVE THE CHRISTMAS FOLK ALONE!  Stop ruining the holidays, you Neo-Yuppie Scumbags…Or I\'ll beat you with a Baby Jesus!"  I\'m a Christian and that makes me laugh when I watch that video every year…especially at a time of year when I REALLY need it.\n\nIf you want to enjoy it, too, here\'s the video:  (Disclaimer: Harsh Language)\nNo Christmas for You! (https://www.youtube.com/watch?v=mJZjR7xyyWE)', 'Hurst Mitchell': 'Well whether we like, believe or hate Christianity, if and when it disappears from the West\nit will be replaced by Islam. Careful what you wish for.', 'Jessica Triplev': "The alt-right bots have penetrated every sphere of our society, including even science. Their hateful, bigoted war on inclusivity and on marginalized identities is sickening. I know this is an alt-right channel and expect to be bullied by the haters and bots. That's the point. We need to talk about YouTube providing its platform to these racists, misogynists and homophobes. UGH smh", 'erik dee': "=== Executive Order to  Investigate Censorship Online!!!  Too late. Let's do it anyway, come on, we have no time left!", 'Shannon Davis': "Banning Christian song during Chritmas.....Christians being forced to participate in sacreligious events....thank Odin Christianity isn't being persecuted anywhere. That would make atheists look like they didn't know what they were talking about.", 'Dairo Leon': 'Jesus Christ, how many people are owned by that stupid viking game?', 'UMTongo': 'War room? How is it  a war?', 'LawLibertyCompassion Justice': "It's time to shut down Facebook for sedition and being a monopoly.", 'Piercerson': 'Age of Empires 2 is pretty fun.', 'His Eminence': 'How about teachers put their phones down and tell it to out faces.', 'Catalin Alexandru': 'We need that dam plague or meteor to reset this planet coz this shit is out of control!!', 'MLPDethDealr32': 'i stopped using Facebook Years Ago.', 'Dumpstertron': 'Sorry I took a couple of screen shots to from this video ....to post on Facebook....to educate the minions!!!', 'Zeruda Densetsu': 'So early this video has an advertisement. One min into the actual and I already want to die.', 'c l': 'Every1 Knows Left  Hates Christianity  and Loves Is*am, Facebook always deletes my anti-is*mic posts but it has no problem when my friends post anti-christian posts.'}{'Adders Dewinter': 'Thank God (chritian god) that i never joined facebook. Its corrupt. 😂😂😂', 'Atlas WalkedAway': '"Huge swaths"\nSuch as...', 'Tech10K': "The Democrats/ Libtards/ NPCs will be doing their absolute disgusting underhanded best to silence and mislead public opinion leading up to the US mid-terms... And they'll still get completely pwned!!", 'Rodney Payne': 'Orange man bad 🤖 NPCbook.', 'Charles Xavier': 'Just got up and had a big shit so now I can relax with my first coffee watch this video.', 'Lemon Lee': 'The town of Chipman in New Brunswick, Canada raised a Straight Pride flag. That lasted about a minute.', 'David Alexander': 'These same school boards will also push teaching literal Sharia Law to students.  Search San Diego county school board ... the rest will be filled in', 'HeinerDaddel': 'And here I was thinking Jesus was kinda essential to that Christmas thing - silly me', 'Kenny Powers': 'I got a very serious question to ask,what is wrong with committing violence against the left?', 'Aaron Evinger': '"Christians r/TheDonald. We call ourselves Christians"\n\n"That\'s right! J u d e o  Christians" ^squeak squeak^', 'Electric Dreams': 'So offend the majority in order not to offend the minority. And then say, "see, these are the people who made us offend you." How could this possibly go wrong?', 'Son of the Allfather': "I don't give a fvark if Christmas carols offend anyone. All they want to do is destroy anything that reminds them of Christian Europeans and that is sick.", 'Dave Dogge': 'Jesus is the new Jordan Peterson.', 'Lonnie Olafson': "NPC War Room. Facebook is cancer and is openly engaging in sedition. These NGO's need to be crushed under foot.", 'The Devil': "Facebook is lame. I don't know why anyone would even use it.", 'Marcus Conchraidh': 'Says the self proclaimed Computing Forever atheist lol', 'Irish cailín': "So  if they told  the  sleeping  down on they're knees public jump in the river  they do it   its just  amazing the  weakness  of ppl  wtf is going on    so they're afraid they stop they're money     but  money  is  fake   economic downfall is on the way either way   I can't   believe  the public    human behaviour  has shocked me  afraid of words", 'TRW1974': 'I will be interested to see Live streams in the lead up to the mid-terms....\napparently google is censoring chat in real time.\n\n\nDont *Be Evil*', 'WildCard2281': 'fucking NPCs ruining everything.', 'Peregrin Took': "Laveyan satanist here...it's just a song. I'd have no problem singing it. I don't freak out when my friends pray before a meal, these people need to grow up.", 'Joe Cronin Show': 'HERE WE GOOO.   I have exploded inside', 'Bart Lester': 'Well on the christmas carol thing i will say this . i used to be christen but now since ive removed the christen blinders and see what christany really is i have no problem removeing the songs of a FAKE GOD and i would go as far as saying untill christens openly admit they stole and coruppted every major holiday. For there own perverce use they should be shut down and removed from public view .', 'Mental Gear': 'lets call our election meddling "anti-election meddling"so nobody gets suspicious', 'Kyles Isler': 'Facebook fact checkers have about as much credibility as Don Lemon.', 'flake452': 'Fuck Jesus we should sing songs about Odin.', 'michael mangan': "5 years in jail in the middle East for celebrating Christmass. Can't put up a Christmass Tree or Nativity scene in the West because it's offensive. Kinda worse than 1984 when you think about it", 'The Critic on Camera': 'How is this a thing: Faith Goldy censored by Canadian MSM, and as a result, lost mayoral election.', 'Thomas H': 'christianity was a big part of the destruction of our culture.', 'Some Random Satanist': "Well I won't miss the lack of Jesus... wait did I say that right? That doesn't sound right... Eh whatever you can read my name and guess what I meant", 'Liberals Get the Bullet Too': 'First names are divisive, and detract from a sense of community.  \nNames serve to feed the ego and reinforce harmful behaviors such as self-interest.\nBan names in schools for a more equal world.', 'An Average Gaming Channel': 'Didn’t Jesus exist in Islam as a normal prophet?', 'Kelly': "Screw diversity! It's ruining the west!", 'SaltpeterTaffy': '"What I find most awesome about Vikings is that it doesn\'t run on my dumbphone" is what you really mean, right? :D', 'AP1 S2K': 'The shitlib scourge in my state (oregon) is getting worse. Mayor is a full blown antifa member.', 'Thorne': 'I swear to fucking god if I fail another fucking captcha on 4chan I’m going to have another meltdown', 'Jamie Paterson': 'Firstn’t', 'FireCatStudios': 'trump 2020', 'Latvian Dragon': 'Not the first', 'Andrew Ace': 'Here we go again...\n_(Drinks shot)_', 'Matt Stone': 'TRUMP 2020', 'Cytotron': 'FURST~!'}{'Adders Dewinter': 'Thank God (chritian god) that i never joined facebook. Its corrupt. 😂😂😂', 'Atlas WalkedAway': '"Huge swaths"\nSuch as...', 'Tech10K': "The Democrats/ Libtards/ NPCs will be doing their absolute disgusting underhanded best to silence and mislead public opinion leading up to the US mid-terms... And they'll still get completely pwned!!", 'Rodney Payne': 'Orange man bad 🤖 NPCbook.', 'Charles Xavier': 'Just got up and had a big shit so now I can relax with my first coffee watch this video.', 'Lemon Lee': 'The town of Chipman in New Brunswick, Canada raised a Straight Pride flag. That lasted about a minute.', 'David Alexander': 'These same school boards will also push teaching literal Sharia Law to students.  Search San Diego county school board ... the rest will be filled in', 'HeinerDaddel': 'And here I was thinking Jesus was kinda essential to that Christmas thing - silly me', 'Kenny Powers': 'I got a very serious question to ask,what is wrong with committing violence against the left?', 'Aaron Evinger': '"Christians r/TheDonald. We call ourselves Christians"\n\n"That\'s right! J u d e o  Christians" ^squeak squeak^', 'Electric Dreams': 'So offend the majority in order not to offend the minority. And then say, "see, these are the people who made us offend you." How could this possibly go wrong?', 'Son of the Allfather': "I don't give a fvark if Christmas carols offend anyone. All they want to do is destroy anything that reminds them of Christian Europeans and that is sick.", 'Dave Dogge': 'Jesus is the new Jordan Peterson.', 'Lonnie Olafson': "NPC War Room. Facebook is cancer and is openly engaging in sedition. These NGO's need to be crushed under foot.", 'The Devil': "Facebook is lame. I don't know why anyone would even use it.", 'Marcus Conchraidh': 'Says the self proclaimed Computing Forever atheist lol', 'Irish cailín': "So  if they told  the  sleeping  down on they're knees public jump in the river  they do it   its just  amazing the  weakness  of ppl  wtf is going on    so they're afraid they stop they're money     but  money  is  fake   economic downfall is on the way either way   I can't   believe  the public    human behaviour  has shocked me  afraid of words", 'TRW1974': 'I will be interested to see Live streams in the lead up to the mid-terms....\napparently google is censoring chat in real time.\n\n\nDont *Be Evil*', 'WildCard2281': 'fucking NPCs ruining everything.', 'Peregrin Took': "Laveyan satanist here...it's just a song. I'd have no problem singing it. I don't freak out when my friends pray before a meal, these people need to grow up.", 'Joe Cronin Show': 'HERE WE GOOO.   I have exploded inside', 'Bart Lester': 'Well on the christmas carol thing i will say this . i used to be christen but now since ive removed the christen blinders and see what christany really is i have no problem removeing the songs of a FAKE GOD and i would go as far as saying untill christens openly admit they stole and coruppted every major holiday. For there own perverce use they should be shut down and removed from public view .', 'Mental Gear': 'lets call our election meddling "anti-election meddling"so nobody gets suspicious', 'Kyles Isler': 'Facebook fact checkers have about as much credibility as Don Lemon.', 'flake452': 'Fuck Jesus we should sing songs about Odin.', 'michael mangan': "5 years in jail in the middle East for celebrating Christmass. Can't put up a Christmass Tree or Nativity scene in the West because it's offensive. Kinda worse than 1984 when you think about it", 'The Critic on Camera': 'How is this a thing: Faith Goldy censored by Canadian MSM, and as a result, lost mayoral election.', 'Thomas H': 'christianity was a big part of the destruction of our culture.', 'Some Random Satanist': "Well I won't miss the lack of Jesus... wait did I say that right? That doesn't sound right... Eh whatever you can read my name and guess what I meant", 'Liberals Get the Bullet Too': 'First names are divisive, and detract from a sense of community.  \nNames serve to feed the ego and reinforce harmful behaviors such as self-interest.\nBan names in schools for a more equal world.', 'An Average Gaming Channel': 'Didn’t Jesus exist in Islam as a normal prophet?', 'Kelly': "Screw diversity! It's ruining the west!", 'SaltpeterTaffy': '"What I find most awesome about Vikings is that it doesn\'t run on my dumbphone" is what you really mean, right? :D', 'AP1 S2K': 'The shitlib scourge in my state (oregon) is getting worse. Mayor is a full blown antifa member.', 'Thorne': 'I swear to fucking god if I fail another fucking captcha on 4chan I’m going to have another meltdown', 'Jamie Paterson': 'Firstn’t', 'FireCatStudios': 'trump 2020', 'Latvian Dragon': 'Not the first', 'Andrew Ace': 'Here we go again...\n_(Drinks shot)_', 'Matt Stone': 'TRUMP 2020', 'Cytotron': 'FURST~!'}{'Adders Dewinter': 'Thank God (chritian god) that i never joined facebook. Its corrupt. 😂😂😂', 'Atlas WalkedAway': '"Huge swaths"\nSuch as...', 'Tech10K': "The Democrats/ Libtards/ NPCs will be doing their absolute disgusting underhanded best to silence and mislead public opinion leading up to the US mid-terms... And they'll still get completely pwned!!", 'Rodney Payne': 'Orange man bad 🤖 NPCbook.', 'Charles Xavier': 'Just got up and had a big shit so now I can relax with my first coffee watch this video.', 'Lemon Lee': 'The town of Chipman in New Brunswick, Canada raised a Straight Pride flag. That lasted about a minute.', 'David Alexander': 'These same school boards will also push teaching literal Sharia Law to students.  Search San Diego county school board ... the rest will be filled in', 'HeinerDaddel': 'And here I was thinking Jesus was kinda essential to that Christmas thing - silly me', 'Kenny Powers': 'I got a very serious question to ask,what is wrong with committing violence against the left?', 'Aaron Evinger': '"Christians r/TheDonald. We call ourselves Christians"\n\n"That\'s right! J u d e o  Christians" ^squeak squeak^', 'Electric Dreams': 'So offend the majority in order not to offend the minority. And then say, "see, these are the people who made us offend you." How could this possibly go wrong?', 'Son of the Allfather': "I don't give a fvark if Christmas carols offend anyone. All they want to do is destroy anything that reminds them of Christian Europeans and that is sick.", 'Dave Dogge': 'Jesus is the new Jordan Peterson.', 'Lonnie Olafson': "NPC War Room. Facebook is cancer and is openly engaging in sedition. These NGO's need to be crushed under foot.", 'The Devil': "Facebook is lame. I don't know why anyone would even use it.", 'Marcus Conchraidh': 'Says the self proclaimed Computing Forever atheist lol', 'Irish cailín': "So  if they told  the  sleeping  down on they're knees public jump in the river  they do it   its just  amazing the  weakness  of ppl  wtf is going on    so they're afraid they stop they're money     but  money  is  fake   economic downfall is on the way either way   I can't   believe  the public    human behaviour  has shocked me  afraid of words", 'TRW1974': 'I will be interested to see Live streams in the lead up to the mid-terms....\napparently google is censoring chat in real time.\n\n\nDont *Be Evil*', 'WildCard2281': 'fucking NPCs ruining everything.', 'Peregrin Took': "Laveyan satanist here...it's just a song. I'd have no problem singing it. I don't freak out when my friends pray before a meal, these people need to grow up.", 'Joe Cronin Show': 'HERE WE GOOO.   I have exploded inside', 'Bart Lester': 'Well on the christmas carol thing i will say this . i used to be christen but now since ive removed the christen blinders and see what christany really is i have no problem removeing the songs of a FAKE GOD and i would go as far as saying untill christens openly admit they stole and coruppted every major holiday. For there own perverce use they should be shut down and removed from public view .', 'Mental Gear': 'lets call our election meddling "anti-election meddling"so nobody gets suspicious', 'Kyles Isler': 'Facebook fact checkers have about as much credibility as Don Lemon.', 'flake452': 'Fuck Jesus we should sing songs about Odin.', 'michael mangan': "5 years in jail in the middle East for celebrating Christmass. Can't put up a Christmass Tree or Nativity scene in the West because it's offensive. Kinda worse than 1984 when you think about it", 'The Critic on Camera': 'How is this a thing: Faith Goldy censored by Canadian MSM, and as a result, lost mayoral election.', 'Thomas H': 'christianity was a big part of the destruction of our culture.', 'Some Random Satanist': "Well I won't miss the lack of Jesus... wait did I say that right? That doesn't sound right... Eh whatever you can read my name and guess what I meant", 'Liberals Get the Bullet Too': 'First names are divisive, and detract from a sense of community.  \nNames serve to feed the ego and reinforce harmful behaviors such as self-interest.\nBan names in schools for a more equal world.', 'An Average Gaming Channel': 'Didn’t Jesus exist in Islam as a normal prophet?', 'Kelly': "Screw diversity! It's ruining the west!", 'SaltpeterTaffy': '"What I find most awesome about Vikings is that it doesn\'t run on my dumbphone" is what you really mean, right? :D', 'AP1 S2K': 'The shitlib scourge in my state (oregon) is getting worse. Mayor is a full blown antifa member.', 'Thorne': 'I swear to fucking god if I fail another fucking captcha on 4chan I’m going to have another meltdown', 'Jamie Paterson': 'Firstn’t', 'FireCatStudios': 'trump 2020', 'Latvian Dragon': 'Not the first', 'Andrew Ace': 'Here we go again...\n_(Drinks shot)_', 'Matt Stone': 'TRUMP 2020', 'Cytotron': 'FURST~!'}{'Adders Dewinter': 'Thank God (chritian god) that i never joined facebook. Its corrupt. 😂😂😂', 'Atlas WalkedAway': '"Huge swaths"\nSuch as...', 'Tech10K': "The Democrats/ Libtards/ NPCs will be doing their absolute disgusting underhanded best to silence and mislead public opinion leading up to the US mid-terms... And they'll still get completely pwned!!", 'Rodney Payne': 'Orange man bad 🤖 NPCbook.', 'Charles Xavier': 'Just got up and had a big shit so now I can relax with my first coffee watch this video.', 'Lemon Lee': 'The town of Chipman in New Brunswick, Canada raised a Straight Pride flag. That lasted about a minute.', 'David Alexander': 'These same school boards will also push teaching literal Sharia Law to students.  Search San Diego county school board ... the rest will be filled in', 'HeinerDaddel': 'And here I was thinking Jesus was kinda essential to that Christmas thing - silly me', 'Kenny Powers': 'I got a very serious question to ask,what is wrong with committing violence against the left?', 'Aaron Evinger': '"Christians r/TheDonald. We call ourselves Christians"\n\n"That\'s right! J u d e o  Christians" ^squeak squeak^', 'Electric Dreams': 'So offend the majority in order not to offend the minority. And then say, "see, these are the people who made us offend you." How could this possibly go wrong?', 'Son of the Allfather': "I don't give a fvark if Christmas carols offend anyone. All they want to do is destroy anything that reminds them of Christian Europeans and that is sick.", 'Dave Dogge': 'Jesus is the new Jordan Peterson.', 'Lonnie Olafson': "NPC War Room. Facebook is cancer and is openly engaging in sedition. These NGO's need to be crushed under foot.", 'The Devil': "Facebook is lame. I don't know why anyone would even use it.", 'Marcus Conchraidh': 'Says the self proclaimed Computing Forever atheist lol', 'Irish cailín': "So  if they told  the  sleeping  down on they're knees public jump in the river  they do it   its just  amazing the  weakness  of ppl  wtf is going on    so they're afraid they stop they're money     but  money  is  fake   economic downfall is on the way either way   I can't   believe  the public    human behaviour  has shocked me  afraid of words", 'TRW1974': 'I will be interested to see Live streams in the lead up to the mid-terms....\napparently google is censoring chat in real time.\n\n\nDont *Be Evil*', 'WildCard2281': 'fucking NPCs ruining everything.', 'Peregrin Took': "Laveyan satanist here...it's just a song. I'd have no problem singing it. I don't freak out when my friends pray before a meal, these people need to grow up.", 'Joe Cronin Show': 'HERE WE GOOO.   I have exploded inside', 'Bart Lester': 'Well on the christmas carol thing i will say this . i used to be christen but now since ive removed the christen blinders and see what christany really is i have no problem removeing the songs of a FAKE GOD and i would go as far as saying untill christens openly admit they stole and coruppted every major holiday. For there own perverce use they should be shut down and removed from public view .', 'Mental Gear': 'lets call our election meddling "anti-election meddling"so nobody gets suspicious', 'Kyles Isler': 'Facebook fact checkers have about as much credibility as Don Lemon.', 'flake452': 'Fuck Jesus we should sing songs about Odin.', 'michael mangan': "5 years in jail in the middle East for celebrating Christmass. Can't put up a Christmass Tree or Nativity scene in the West because it's offensive. Kinda worse than 1984 when you think about it", 'The Critic on Camera': 'How is this a thing: Faith Goldy censored by Canadian MSM, and as a result, lost mayoral election.', 'Thomas H': 'christianity was a big part of the destruction of our culture.', 'Some Random Satanist': "Well I won't miss the lack of Jesus... wait did I say that right? That doesn't sound right... Eh whatever you can read my name and guess what I meant", 'Liberals Get the Bullet Too': 'First names are divisive, and detract from a sense of community.  \nNames serve to feed the ego and reinforce harmful behaviors such as self-interest.\nBan names in schools for a more equal world.', 'An Average Gaming Channel': 'Didn’t Jesus exist in Islam as a normal prophet?', 'Kelly': "Screw diversity! It's ruining the west!", 'SaltpeterTaffy': '"What I find most awesome about Vikings is that it doesn\'t run on my dumbphone" is what you really mean, right? :D', 'AP1 S2K': 'The shitlib scourge in my state (oregon) is getting worse. Mayor is a full blown antifa member.', 'Thorne': 'I swear to fucking god if I fail another fucking captcha on 4chan I’m going to have another meltdown', 'Jamie Paterson': 'Firstn’t', 'FireCatStudios': 'trump 2020', 'Latvian Dragon': 'Not the first', 'Andrew Ace': 'Here we go again...\n_(Drinks shot)_', 'Matt Stone': 'TRUMP 2020', 'Cytotron': 'FURST~!'}{'Adders Dewinter': 'Thank God (chritian god) that i never joined facebook. Its corrupt. 😂😂😂', 'Atlas WalkedAway': '"Huge swaths"\nSuch as...', 'Tech10K': "The Democrats/ Libtards/ NPCs will be doing their absolute disgusting underhanded best to silence and mislead public opinion leading up to the US mid-terms... And they'll still get completely pwned!!", 'Rodney Payne': 'Orange man bad 🤖 NPCbook.', 'Charles Xavier': 'Just got up and had a big shit so now I can relax with my first coffee watch this video.', 'Lemon Lee': 'The town of Chipman in New Brunswick, Canada raised a Straight Pride flag. That lasted about a minute.', 'David Alexander': 'These same school boards will also push teaching literal Sharia Law to students.  Search San Diego county school board ... the rest will be filled in', 'HeinerDaddel': 'And here I was thinking Jesus was kinda essential to that Christmas thing - silly me', 'Kenny Powers': 'I got a very serious question to ask,what is wrong with committing violence against the left?', 'Aaron Evinger': '"Christians r/TheDonald. We call ourselves Christians"\n\n"That\'s right! J u d e o  Christians" ^squeak squeak^', 'Electric Dreams': 'So offend the majority in order not to offend the minority. And then say, "see, these are the people who made us offend you." How could this possibly go wrong?', 'Son of the Allfather': "I don't give a fvark if Christmas carols offend anyone. All they want to do is destroy anything that reminds them of Christian Europeans and that is sick.", 'Dave Dogge': 'Jesus is the new Jordan Peterson.', 'Lonnie Olafson': "NPC War Room. Facebook is cancer and is openly engaging in sedition. These NGO's need to be crushed under foot.", 'The Devil': "Facebook is lame. I don't know why anyone would even use it.", 'Marcus Conchraidh': 'Says the self proclaimed Computing Forever atheist lol', 'Irish cailín': "So  if they told  the  sleeping  down on they're knees public jump in the river  they do it   its just  amazing the  weakness  of ppl  wtf is going on    so they're afraid they stop they're money     but  money  is  fake   economic downfall is on the way either way   I can't   believe  the public    human behaviour  has shocked me  afraid of words", 'TRW1974': 'I will be interested to see Live streams in the lead up to the mid-terms....\napparently google is censoring chat in real time.\n\n\nDont *Be Evil*', 'WildCard2281': 'fucking NPCs ruining everything.', 'Peregrin Took': "Laveyan satanist here...it's just a song. I'd have no problem singing it. I don't freak out when my friends pray before a meal, these people need to grow up.", 'Joe Cronin Show': 'HERE WE GOOO.   I have exploded inside', 'Bart Lester': 'Well on the christmas carol thing i will say this . i used to be christen but now since ive removed the christen blinders and see what christany really is i have no problem removeing the songs of a FAKE GOD and i would go as far as saying untill christens openly admit they stole and coruppted every major holiday. For there own perverce use they should be shut down and removed from public view .', 'Mental Gear': 'lets call our election meddling "anti-election meddling"so nobody gets suspicious', 'Kyles Isler': 'Facebook fact checkers have about as much credibility as Don Lemon.', 'flake452': 'Fuck Jesus we should sing songs about Odin.', 'michael mangan': "5 years in jail in the middle East for celebrating Christmass. Can't put up a Christmass Tree or Nativity scene in the West because it's offensive. Kinda worse than 1984 when you think about it", 'The Critic on Camera': 'How is this a thing: Faith Goldy censored by Canadian MSM, and as a result, lost mayoral election.', 'Thomas H': 'christianity was a big part of the destruction of our culture.', 'Some Random Satanist': "Well I won't miss the lack of Jesus... wait did I say that right? That doesn't sound right... Eh whatever you can read my name and guess what I meant", 'Liberals Get the Bullet Too': 'First names are divisive, and detract from a sense of community.  \nNames serve to feed the ego and reinforce harmful behaviors such as self-interest.\nBan names in schools for a more equal world.', 'An Average Gaming Channel': 'Didn’t Jesus exist in Islam as a normal prophet?', 'Kelly': "Screw diversity! It's ruining the west!", 'SaltpeterTaffy': '"What I find most awesome about Vikings is that it doesn\'t run on my dumbphone" is what you really mean, right? :D', 'AP1 S2K': 'The shitlib scourge in my state (oregon) is getting worse. Mayor is a full blown antifa member.', 'Thorne': 'I swear to fucking god if I fail another fucking captcha on 4chan I’m going to have another meltdown', 'Jamie Paterson': 'Firstn’t', 'FireCatStudios': 'trump 2020', 'Latvian Dragon': 'Not the first', 'Andrew Ace': 'Here we go again...\n_(Drinks shot)_', 'Matt Stone': 'TRUMP 2020', 'Cytotron': 'FURST~!'}{'Adders Dewinter': 'Thank God (chritian god) that i never joined facebook. Its corrupt. 😂😂😂', 'Atlas WalkedAway': '"Huge swaths"\nSuch as...', 'Tech10K': "The Democrats/ Libtards/ NPCs will be doing their absolute disgusting underhanded best to silence and mislead public opinion leading up to the US mid-terms... And they'll still get completely pwned!!", 'Rodney Payne': 'Orange man bad 🤖 NPCbook.', 'Charles Xavier': 'Just got up and had a big shit so now I can relax with my first coffee watch this video.', 'Lemon Lee': 'The town of Chipman in New Brunswick, Canada raised a Straight Pride flag. That lasted about a minute.', 'David Alexander': 'These same school boards will also push teaching literal Sharia Law to students.  Search San Diego county school board ... the rest will be filled in', 'HeinerDaddel': 'And here I was thinking Jesus was kinda essential to that Christmas thing - silly me', 'Kenny Powers': 'I got a very serious question to ask,what is wrong with committing violence against the left?', 'Aaron Evinger': '"Christians r/TheDonald. We call ourselves Christians"\n\n"That\'s right! J u d e o  Christians" ^squeak squeak^', 'Electric Dreams': 'So offend the majority in order not to offend the minority. And then say, "see, these are the people who made us offend you." How could this possibly go wrong?', 'Son of the Allfather': "I don't give a fvark if Christmas carols offend anyone. All they want to do is destroy anything that reminds them of Christian Europeans and that is sick.", 'Dave Dogge': 'Jesus is the new Jordan Peterson.', 'Lonnie Olafson': "NPC War Room. Facebook is cancer and is openly engaging in sedition. These NGO's need to be crushed under foot.", 'The Devil': "Facebook is lame. I don't know why anyone would even use it.", 'Marcus Conchraidh': 'Says the self proclaimed Computing Forever atheist lol', 'Irish cailín': "So  if they told  the  sleeping  down on they're knees public jump in the river  they do it   its just  amazing the  weakness  of ppl  wtf is going on    so they're afraid they stop they're money     but  money  is  fake   economic downfall is on the way either way   I can't   believe  the public    human behaviour  has shocked me  afraid of words", 'TRW1974': 'I will be interested to see Live streams in the lead up to the mid-terms....\napparently google is censoring chat in real time.\n\n\nDont *Be Evil*', 'WildCard2281': 'fucking NPCs ruining everything.', 'Peregrin Took': "Laveyan satanist here...it's just a song. I'd have no problem singing it. I don't freak out when my friends pray before a meal, these people need to grow up.", 'Joe Cronin Show': 'HERE WE GOOO.   I have exploded inside', 'Bart Lester': 'Well on the christmas carol thing i will say this . i used to be christen but now since ive removed the christen blinders and see what christany really is i have no problem removeing the songs of a FAKE GOD and i would go as far as saying untill christens openly admit they stole and coruppted every major holiday. For there own perverce use they should be shut down and removed from public view .', 'Mental Gear': 'lets call our election meddling "anti-election meddling"so nobody gets suspicious', 'Kyles Isler': 'Facebook fact checkers have about as much credibility as Don Lemon.', 'flake452': 'Fuck Jesus we should sing songs about Odin.', 'michael mangan': "5 years in jail in the middle East for celebrating Christmass. Can't put up a Christmass Tree or Nativity scene in the West because it's offensive. Kinda worse than 1984 when you think about it", 'The Critic on Camera': 'How is this a thing: Faith Goldy censored by Canadian MSM, and as a result, lost mayoral election.', 'Thomas H': 'christianity was a big part of the destruction of our culture.', 'Some Random Satanist': "Well I won't miss the lack of Jesus... wait did I say that right? That doesn't sound right... Eh whatever you can read my name and guess what I meant", 'Liberals Get the Bullet Too': 'First names are divisive, and detract from a sense of community.  \nNames serve to feed the ego and reinforce harmful behaviors such as self-interest.\nBan names in schools for a more equal world.', 'An Average Gaming Channel': 'Didn’t Jesus exist in Islam as a normal prophet?', 'Kelly': "Screw diversity! It's ruining the west!", 'SaltpeterTaffy': '"What I find most awesome about Vikings is that it doesn\'t run on my dumbphone" is what you really mean, right? :D', 'AP1 S2K': 'The shitlib scourge in my state (oregon) is getting worse. Mayor is a full blown antifa member.', 'Thorne': 'I swear to fucking god if I fail another fucking captcha on 4chan I’m going to have another meltdown', 'Jamie Paterson': 'Firstn’t', 'FireCatStudios': 'trump 2020', 'Latvian Dragon': 'Not the first', 'Andrew Ace': 'Here we go again...\n_(Drinks shot)_', 'Matt Stone': 'TRUMP 2020', 'Cytotron': 'FURST~!'}