{'Cultaholic': '#ThankYouRoman', 'Rimsha Asghar': 'King miss u😢😢😢😢😢', 'rinku khanoura': 'Roman is a real life hero', 'Prince Jai': 'Roman sir aap WWE chod kar mat jao', 'Kailash Biswal': 'Nice', 'Chandu Poojitha': 'Joe ur super man punch to leukemia 🤛', 'IMRAN GORWAAL': 'Rahul', 'Irfan Raja': 'So nice roman reigns guod bless you', 'Mark Marvan': 'First of all, get well soon, Roman Reigns. I wish you the best.\nSecond, I knew Dean Ambrose would turn heel soon, but I didnt expect it happen on this night. It was a really intense and shocking moment. Definitely the most intense RAW episode since a long, long time.', 'eden': "I honestly needed a recap of what happened, I was crying and couldn't process anything, much less what was happening on Raw after the opening...", 'Barot Veer': 'Misss  u king', 'The ROMAN REIGNS Lovers': 'He is best wrestler in the world...', 'Stevie Steve': "Dean didn't  have remorse. I got from it that he couldn't believe  Seth keeps calling him a lunatic.", 'Marion Gunga': 'idiot', 'Khushi Shaikh': 'aaj ke bad main wwe nahi dekhungi good bye wwe missssssssssssss u roman reigns', 'Craig Lovelace': 'The Ambrose turn is well timed, Reigns’ departure changes the dynamic.  Without his moderating presence, the tension between Dean and Seth exploded.', 'Liam Puzon': "You failed to mention that the five way women's match was a match to throw all the women in that's only purpose was to build a match to throw all the women in", 'Moin Qureshi': 'Boht afsos hu rha h', 'Tj Williams': 'Big dog come back house', 'Sagar Sagar': 'Boss plz come back get well soon boss😢😢ur my favorite plzzzzzzz', 'Pradeep Sankhua': 'Nice', 'সাইকো পোলাপাইন': 'We missed roman rainges very much.....\nprayer for him..\n..\nmay Allah help him', 'Vasanthipadur14 Vasanthi': 'I hate wwe because Roman illa', 'Hawkesey11': "Is it just me but is Triple H's ego out of control? His promo's are cringe. He loves biggin himself up. Someone should show him clips of dx in 1997. They mock and make fun of the older wrestles at that time who are passed there best. Yet here we are 2018 watching an old dx!", 'नेपालको छोरो': 'Get well soon', 'altaf patel': 'Chutiya hai kya', 'Jahrah Begum': 'I am vary vary sed', 'K-Time Now': 'Get back soon Roman From laukemia.....we are waiting for you', 'Rajesh porel': 'I miss you BOSS ROMAN Come back', 'Naughty Aleena': 'I farta fart farted farting FArt', 'Narasimha Roman': 'Miss you boss', 'pawan kumar': 'Back roman reigns bro', 'Deepshikha Bhartendu': 'Get well soon I am waiting for you, n u come back I believe that', 'Ibad Siddique': 'EAST AND WEST  SHELD IS THE BEST', 'KTrick Musik': 'Get well soon Joe #fuckcancer', 'Ahmad Jadoon': '😭😭😭\nRoman Miss u', 'Andy Hackett': 'This is perfect timing for Ambrose to turn heel. It creates further intrigue for one of the top 2 headlining stories on RAW. Maybe the reasoning can be linked to Roman leaving and Dean losing his mind over it.', 'umar naik': 'i pray roman become healthy', 'Jeeva V. Jeeva': 'i miss u roman', 'Rooty Rootyson': "Can we stop harping on about Bayley and Sasha being low on the card? Those two are established stars and they are getting good visibility week in week out. You can't possibly grow a woman's division by having a couple of performers monopolise the title scene for years. With the limited match slots afforded them this is the only sensible way to broaden the talent pool to a point the WWE might actually feel it's proftiable to put more women's wrestling content out there.", 'Megan Lambert': 'Mr. The jobber ! Really ?', 'rockthahouse1': 'I think Ambrose turning heel was perfect timing. Made it really go over as a complete jerk type of heel. I think most weeks, Dean still gets cheered but last night - it really pushed it through as an asshole move.', 'للعشق جنون شيفاي انيكا': 'ليش ي رومان رينز المصارعه بدونك وعع 😭😭😭💔💔', 'World is topper': 'Roman ne agar WWE chori to Kia hoa Kun ke WWE is faie', 'Reece Bender': 'imo its the best time for dean to turn fully, in kayfaybe hes distrought and emotionally unstable because of his friend being struck down by an illness, he doesnt know what to do and it could be said hes upset by it and doesnt want to be around seth reminding him of romans pain, and also that romans cancer could be a "i need to take my chances because life can go at any time" thing. he came back from his surgury buff as a fuck and looking strong, before he left he took brock to the limit, now hes back i hope they let him go a step further and have a serious title run and some time at the top vs braun seth drew and brock. hes the perfect guy to allow the scene to step away from "monsters" without them being beaten in gimmicky ways by smaller guys, seth beating brock or braun would look weird, seth beating dean or drew after they take out brock/braun would be a good way to transition it. though i think seth needs to be on smackdown no matter what happens. hes too good to be ragdolled by Big Sweaty Men™', 'epickithri': "I would give the Dean heel turn an F. The Shield won the Tag titles for Roman Reigns whos now down for another bout with Leukaemia. The remaining shield brothers would have been huge faces that could have been pushed hard and would have really won over the crowd and sold a ton of merch as a dominant Tag team champs. They look now like instead someone who could lose the belts to a pair of jobbers. It's just way too soon to break the shield up.", 'Bacon Tomato': 'I went to a live event on Sunday night and they had lio rush push finn off the ropes when he was going for the coup de grace, I much preferred the Dq win to what he had monday', 'Satvant Sonu': 'Sale jab tujhe pta nhi he fir kyu apni maa chudva raha he tu', 'Nathan Wright': 'Has an A+ ever been given?', 'Roman Gujalwad': 'Roman reigns is my favorite hi\nero', 'anushiya shankar': 'Get well soon, we miss u roman 😨 😨 😨', 'ValdoVlogger96': 'The timing was perfect.', 'combatinfantry008': "First and foremost, cancer can get the F out. Joe (Roman Reigns) is a great man/ambassador for the WWE. Not a fan of the character but a fan if the man (same as Cena). However, though done amazingly shouldn't the turn of Dean waited until oh I don't know at least a week after they won the tag titles? What do they even mean now? Are Seth and Dean going to team up and defend them? Couldn't they have had them get wrecked by AOP next week and then had Dean turn? The emotion was great (for the wrong reasons), the portrayal was amazing, the story is just rushed in a way that makes no sense. Why would Dean turn when they needed to lean on each other? Why after they just won the belts which they promised to do? Where was the logic. Once again, screw cancer. See you in the ring before too long Roman.", 'HeelNattans': "The fans have pretty much everything they've been doing cannon now.\nOwens is face\nBraun is face\nElias is face\nLashley is heel\nRoman is gone (the character not the person)\nNow all we need is a Sasha heel turn", 'Anju Kumari': 'get well soon roman', 'puropinchemikey': 'Roman reigns fans hit like.', 'The Memer': 'Was it an Elias babyface turn though?', 'Auritra Dey': 'Roman will be back to rock soon!!!', 'Kristian179': 'I mean it makes sense as now people can really hate and have a reason to hate Dean Ambrose as a heel !', 'Ryan Pollock': 'So they are the champs but will be feuding....interesting', 'Kaden L': '5:18', 'John Marston': "If WWE think I'm taking a break from RDR2 for Evolution, then they are sorely mistaken.", 'Abrax 23': 'No one is talking about the way HHH ran over the last remnants of kayfabe with a monster truck during his promo, making direct reference to Kane being the mayor of Knox County.\n\nSo all that history of the Kane character, from his first appearance as Taker\'s mysterious brother, to all the background story that was played out over the course of many feuds..."Fuck all that!" says HHH, let\'s just toss it all away and totally break the 4th wall, destroying the credibility of a beloved character in the process. Yay! Oh and let\'s mock the Brothers of Destruction\'s choice of venue for their promo too, made by the very company that HHH is the COO of.\n\nSo what is this feud now? Four guys that have been around so long that the very integrity of the nature wrestling is at stake? That\'s going to be the added stipulation just before the match starts at Crown Jewel. Vince Russo will come out and declare, "This match is now for the very concept of kayfabe! If the Brothers of Destruction lose, then it will no longer be possible for the entire WWE roster to use their in-ring names!"', 'Dark Hawk': "I try to keep these comments clean, but... F**k Cancer.\n\nI don't know the man, and likely will never meet him, but any time I've seen him out of character, like on UpUpDownDown or doing the charity work... He just seems like a great, chill guy. The fact he's been living with this for 11 years apparently? Explains why he's always there when they do the Connor's Cure promotions. That promo messed me up, and seeing Seth crying when he came out... messed me up more.\n\nTake care of yourself, Joe; we'll see you when you beat this thing.", 'issac lopez': '#thankyouromea', 'William Iron': "I hate Roman Reigns and I hate the way WWE is now. It's like a fucking cartoon show.", 'urianthefatmansgreat': "Was it too soon? No. First off, that crowd reaction was perfect. We've all speculated for months that he was going to turn, and he did it when nobody saw it coming. Combine that with his and Seth's performances during the beat down and it was perfect. Second, I'd rather have them do something that will showcase both of them than have them do some odd 2/3 shield run that devalues the intercontinental title.", 'Nick Baker': 'Alexa retweeted a promotional tweet for her fight so I don’t think she’s injured.', 'Deuce Treyz': '2-3 years for average treatment.', 'Ernest Wert': "I have a theory about the recent 50-50 booking:\nIt's all your fault. Not your as in Jack's fault, I mean everyone who thinks they're smart and who thinks they know everything about wrestling. WE proves to you each and every time you stand there scratching your heads and wondering why the fuck did they book it so stupidly, that they are unpredictable and that they are exciting.\nAlso, another theory:\nROMAN REIGNS IS FUCKING WORKING YOU LIKE LITTLE CHILDREN!!! Can't you see it? it's the ultimate grasp of WE for making Roman likeable - let's give him a fucking cancer and hope people will feel sad and clap for him, repackage him as the GOD in 2 weeks when he comes back with Leukemia's Heavyweight Title and make him win the entire Wrestlemania.\nFucking marks...", 'Foxgames 539': '#thankyouroman', 'Flying Toaster': 'Dean still holds a grudge against Seth Rollins for what he did when he betrayed The Shield. But he was loyal to Roman and fought alongside Rollins for his sake. With Roman gone, there was nothing left to attach him to Seth and so he turned on him.', 'Jose Theragood': 'With Roman gone expect the WWE to burn through all the internet fan theories and fantasy bookings (all the wrestlers that "need" a push will get a little faux push and all the dream matches will happen but they will just be shite so they can be gotten out of the way).', 'Louis Campbell': 'This was the best raw in ages. I was really losing interest these last few weeks but this was a great episode', 'Bearded Nerd SheDanigans': 'I personally think that was the smartest and possibly the only way to turn Dean and get the fans to actually boo him! Everyone knows if they turn him any other time it’d be a Becky situation', 'Der Punkrockpazifist': 'Guys, it´s time to change the Becky Picture with an angry Becky picture.', 'Dz Drak Media': '*Hope roman reigns  will come back*\n        💗♥💗 \n*Love from Kerala*', 'Noel Halyard': 'Elias turns face, drama turns heel. This was the best RAW in years.', 'Peter Fleming': 'It’s an amazing heel turn and I’m sure Roman would have given them the thumbs up to go for it and have a tremendous feud until he gets back.', 'Shaik Ayaz': 'I miss you roman', 'Mr.Otaku2399': 'the BIG DAWG! is gonna beat cancer and comeback as the true super hero vince always wanted him to be. #ThankYouRoman', 'Fuck Wizkhalifa': 'I deadass had to fast forward through the ending cause it was so hard to watch.', 'Milan Suvajac': 'Only RAW this year to deserve an A.', 'Jesus Munoz': 'If I know Roman reigns he kicks out at 1', 'MH Creed': "I mean it's kinda the best time for dean to get heat right?", 'Steve Smith': 'That makes a lot of sense...\n\n"The show must go on...."\n\n"Well it\'s to soon to turn Dean!"\n\nFucking IWC...', 'MrGreyfu': 'As soon as Roman said "My name is Joe" my stomach was just in the pits and I knew straight away it was worse than an injury. A real "oh for fuck sake moment".\n\nAdversley at the end the evening when Dean goes off on Seth I had a pretty hard laugh, I knew it was the worst night to do something like this in kayfabe but Rene shouting that disapproving "hey" when Dean hit the dirty deeds on Seth just had me howling I wonder if the announce team knew it was coming.', 'Sam Mort': 'I think the heel turn was perfect \n\nI thought from the build beforehand if he turned it’d be too obvious but after he won the tag titles and reigns promo nobody expected it that night\n\nPissed people off\n\nPerfect'}{'Franky Bernal': 'this episode of raw felt bigger than it had in years... i feel this will go down as an era defining episode', 'Bob Tallman': 'I hope Roman gets well soon, but it really helped give creative a hard reset that they needed. Braun face, Elias face, Dean heel. Things are moving in the right direction. Wonder how Renee is going to handle commentary when Dean is in the ring.', 'zman2748': 'the best raw in a long time', 'Bikrama Yadav': "I can't explain my emotio\n😭😭🙏🙏🙏", 'Tyler Gomola': "It seems I'm in the minority, but i think Dean's turn is a bad move. Heel Ambrose is boring in my opinion. And turning right after winning the titles is telegraphing them dropping the titles in the first defense.\n#thankyouroman", 'Ron Hathorne': 'What a terrible situation, it’s like this \n\nVince: “ I wish Roman Reigns could get over as a babyface”\nWWE Universe: “We wish Roman would drop the title”\nMonkey’s Paw: “ Hold my beer”\n\n#GetWellRoman', 'cool manxd': 'WHAAAAATCULTRE', 'Macephtopheles': "I'd say the Dean heel turn was perfectly timed. I think doing it not only after the emotional Roman/Joe promo but also immediately after winning the tag titles made the timing even better because it wasn't expected. Like *ANY* other time and you'd have people saying it was obviously coming/too predictable but if anyone says they saw it coming after *that* promo then they're just lying so, to me, I'd say that's what made it perfectly timed.", 'MikeMcc 19': 'I was there and everyone was cheering Dean Ambrose. Do idk if WWE changed it on tv but the whole arena gave him a huge pop.', 'Shaü-aü Phom': 'This was heavy', 'sunny Talukdar': 'Oh allah plz save romen', 'Grayhound': 'never really thought about this but is Jack, Mr the jobber because Ross is king', 'Jeff Gordon': 'A few amazing moments: 1. When Michael Cole said, "Not tonight." After Ambrose\'s DDT\n2. After getting DDT\'D, Seth Looking at Dean and saying, "It\'s okay."\n3. The fan saying, "Why man why?"\n\nProbably one of the most impacful bits of storytelling from the main roster shows I\'ve seen in a while.', 'roman reings': 'Sun never sets on roman empire come back soon', 'animesoul167': 'Yes it was too soon to turn, and thats why it works. Its the most evil thing.', 'Imran Khan': 'No. Roman', 'Larry 35': "I don't mean a single bit of disrespectful intent, I pray for Roman and hope he beats this and comes back. That said...\n\n\nIt took cancer to turn this man Babyface. Vince has been one upped by reality, that or Vince is literally God and took drastic measures to get him over.", 'Colin Lynn': '#ThankYouRoman', 'LEGENDARY & EPIC': 'Alicia Fox looked so Hot last night dayme', 'Pauladin': 'I agree that we need more Woman Stories beyond playground bitching but with the Bella Twins, that fits their character perfectly. They play the mean girl role great.', 'Himanshu Sinha': 'loved the backstage video of roman with a lot of the other wrestlers and wwe personnel specially paul heyman and braun', 'Md Jabed': 'Get well soon Roman love u🤙🤙🤙🤙', 'JURASSICDANGEROUS DINOSAUR': 'Regardless to how you feel for roman he deserves respect for doing this I really hope he pulls through THE BIG DOG.', 'riselikethephoenix1': 'With roman out i would think vince would want lashley to look dominant and add him to the main event of crown jewel. Weve seen lesnar v strowman. We have NOT seen lesnar v strowman v lashley!', 'Dylan Piazza': 'its not too soon, guarantee Roman is fine with it. He knows the business, so do Dean and Seth and its been coming for a while anyway. it was good timing if anything.  Ive always loved Roman, never been one of the nerds hating on him for things he cant control and i still liked the heel turn a lot. Love, thoughts an prayers out to Joe and his family though, all things wrestling aside', 'Christopher Lawrence': 'I honestly don’t think it’s too soon. If you asked Roman from a story telling standpoint he would be all in for it. I thought it was brilliant. My only concern is what titles will be on the show next week? Hypothetically Seth should be hurt, the tag champs are broken up and the Universal title is vacant.', 'DSTY Boys': "Heel and face turns galore! What a better than average episode of RAW. I dont wish to be rude, and feel free to dislike if you disagree, but i hope they ever so slightly incorporate roman's leave of absence with deans heel turn.", 'Mark Orr II': 'In what time or in what spot could Ambrose had gotten better heat...nowhere and never...this vacates the tag titles for possibly AOP...and widens the main event scene...', 'Ben Warner': 'The correct answer is that it’s an A+++++++++++++++ grade', 'CapHowdy': 'It was perfect timing for the turn. I am sure all three men gave the go ahead for this. WWE have already failed with Becky and her heel turn, so to do this now takes away any risk of fans not accepting Dean turning. How else do you make the fans hate Dean this much?\nAs Roman said, things do not stop, the show needs to go on. \nWith the fact that Seth and Dean are also tag champs now just adds even more to what was a stroke of genius in regards to timing.\nIn fact, the announcement by Roman would naturally probably make Dean even more unstable, so yeah, perfect timing in my eyes.\n\nEven the most die hard Roman haters know this is Joe now, and are showing their support of him.\nAnd with a more long view on this as far as Roman goes. If he does indeed get over this, it is probably the one thing that will actually get him over as the #1 baby face. Kinda shitty that.', 'Justin S': "Jack- Roman's shocking announcement, Dean's shocking heel turn, Elias turns face, Heymans great promo, DX in the house, and you give it a B+????? ARE YOU SERIOUS BRO?", 'Jason Busch': 'Dean Ambrose and Seth Rollins have more chemistry with each other than anyone on the main roster', 'brian6502': 'It was not too soon for Dean to turn. The show must go on and, and that it did once the first segment went to commercial', 'Stairwell Toronto': 'Jack shamelessly plugging his merch is why he’s great.', 'Adnan Malik': 'Rip tag titles.', 'Billy Purdue': 'Dean Ambrose heel turn was perfect, it now makes him the biggest heel in wrestling and shows he never had the problem with Roman he just had the problem with Seth', 'ayanna bertrand': "I believe Dean's heel turn was perfect timing. Who expected it last night of all nights? Thought the crowd's response really legitimized it.", 'Josh Reidy': 'Ambrose turn was perfect, if they left it and did it later we would have seen it coming', 'The Ghost of Teddy Long': "Is it sad that I'd much rather see Balor vs Rush", 'Mark Armour': 'I’m so sad Roman has had to leave for a while, I hope he gets better soon but I feel this will be an exciting time for RAW and Seth for Universal Champ let him hold all the make titles on RAW.', 'Samuel Linkous': 'All the horsewomen should be on Smackdown', 'amillo01': 'When Roman comes back, hopefully soon, he should come back more casual like last night', 'sourodeep ghosh': '#thank you roman', 'Steven Kelly': 'You better believe there’s gonna be one fucking hell of a pop when he returns, like imagine it. He deserves the pop in my opinion', 'xMKxUltra': 'I think Roman was suppose to be the one who would hold the Shield together. He was the glue. Now that he’s gone what is the point in pretending to be 2/3 of the Shield? The timing is savage and I applaud them for it. Dean and Seth will prolly happen at Mania along with the IC title.', 'Jake Dennison': 'I’ve made it no secret how I feel about Roman Reigns the Character in the past. But I, like hopefully EVERYONE else, can differentiate wrestling from Real life. If you believe it prayer, definitely pray. Everyone is wishing for a speedy recovery.', 'James Davis': 'Opening segment gets an F.\nAs in FUCK you cancer.\nSpeedy recovery Roman. \nCan’t wait to start booing you again.', 'J.Tweezy': 'Definitely not a Roman fan but I hope he kicks cancers ass!!! When he does return WWE will then have their Roman baby face they always wanted. How could you boo a guy who beats cancer.', 'sidra naz': "don't woryy  everything will be alright", 'Vernon Loyed': "NOT too soon...People have been expecting it for weeks. Placing the heel turn on this show was when no one expected it. By next week, people would've started talking about it again. It was not too soon, it was PERFECT", 'Shane Fagan': "I'd say they wanted to build Balor a bit to have a top babyface underdog", 'Kapricorn71': 'Get well soon Roman #kickcancersass', 'Rueben McFadden': 'I think it was the perfect time. he has been itching to not be with the shield for a while and this was just the right time for it. I feel this heel turn will get it more into the John Moxley persona. Might see some more extreme fights from him if we are really lucky.', 'teccosman': 'I hope Roman lets wwe use this in a storyline', 'Pallen': 'I actually think there was no better time to turn dean heel. If you want to establish a proper heel and get him hated then last night was the perfect time from a storyline perspective to do it.', 'Hugh Alabaster': 'Reigns is going to beat leukemia at mania 35 after 1 spear Believe That', 'Tyler Leggett': 'Im not a Paul Heymen guy, but his promo last night was incredible', 'Jonathan J Mitchell': 'Hope Roman has a full recovery and come back. #ThankYouRoman', 'Angel Carballo': 'At first I was against Dean turning heel but after watching it again I agree it gives Dean so much proper Heat after the whole Roman situation and their emotional win, it also fits well with his character', 'Jagdish Bharvad': 'nice', 'DrLipkin': "I don't think Elias turned face. I think it was a one time thing because of the events of the night.", 'kilala plush': 'Get Well Soon Joe ☹😢', 'The Negan Guy': 'Get well soon Joe\n#ThankYouRoman anyway to RAW it was good B for me my only negative is Finn vs Bobby and then Ronda and Bella twins promo was a let down', 'Pentarax': 'Weird thought; babyface Elias shows up with an electric guitar.', 'Jake Pearl': 'Typical Roman...putting a downer on RAW', 'Mad Maximoff': 'A few take aways about the heel turn.\n\nIt happened in the same building where Jake the Snake Roberts DDT\'ed Ricky the Dragon Steamboat onto the concrete.\n\nDean, being the massive Jake mark that he is, not only delivered Dirty Deeds on the concrete (a double arm DDT) he said "I told you this would happen, Trust Me" before delivering it, a line Jake delivered when he turned heel in 91. \n\nDean also turned on the hottest babyface of the company, as Jake did with Savage (originally warrior, but warrior got fired so they pushed home Jakes turn against Savage).\n\nDean also did several of Jakes heel mannerisms during the turn, the smile that turned to a murderous look and the lingering sitting blank stare after hitting the DDT.\n\nOnly thing missing for Dean now is to walk around wearing inferno snake tights and his entrance theme being a slowed down version with him saying "Trust Me" over it.\n\nLast night, Dean Ambrose became Dean "The Snake" Ambrose.', 'John Douglas Racing Video': "Paul Heyman's words about Roman (Joe) at the beginning of his promo were awesome. I'm glad he said what he said instead of ignoring it. Roman was part of that storyline and it needed to be mentioned instead of ignored and as usual, Paul had every right word to say about him before moving on to the work section of it... His transition from real to kayfabe in that situation was seamless, respectful and effective. A+++", 'GTA 5 games GTA 5': '#thankyouroman I hope you survive lukima please superman punch and spear his butt', 'Jay Booth': 'Hope Roman gets better soon no one deserves to go through  that hope he whips leukemias ass from post to post #thankyouroman', 'Kassadyn': "It makes sense to me tbh, Dean is like Roman's best buddy and when Roman left Dean snapped in anger and finds it a good opportunity to jump on the one that broke them apart years ago or some shit idk, more believable as well because he hesitated too.", 'Yy Memi': 'If Brock fucking wins fuck me dead', 'Alfie Ryan': "I stopped watching raw after summer slam, suppose I'll watch next weeks now. All the best to one of the most divisive heels of our time.", 'Bakorafanboy13': 'We believe in Roman', 'Dead Wafflez': "I don't think it was too soon to turn Dean heel. It was the perfect moment. WWE used the sadness of Roman leaving to add to the turn. Would it have the same impact with Roman there?", 'Roman Reigns Fan': "Roman reigns got cancer so sad I'm felling like crying😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭💔💔💔💔💔💔💔💔", 'LockedLoadedDestruct': 'When roman beats cancer and comes back the pop will be heard around the world. Shame he got cancer again, I was finally beginning to warm up to roman after years of ignoring a majority his matches and promos because they were meh. Come back soon Big Dog. ✊✊✊', 'Ron West': 'Two things we know for fact \n\nRoman always kick out at 2 \nRoman always win\n\nJoe will beat cancer \n\nOooooooooooowahhhhhhhhh!!!!', 'spaceracer23': 'the woman\'s division needs an undercard title. I suggest a "TV Title." This title would be defended on RAW/Smackdown.\nThe hook with the title is that six wins while holding the title allows the tv champ to declare themselves the no. 1 contender for the woman\'s title of their choice. The TV champ is also allowed to defend on BOTH shows if they wish in order to get to six wins faster.\nThis allows WWE to push a wrestler for a couple months without bringing Rhonda into it.', 'J.R. Cummings': 'A WWE contract signing with no broken tables or violence???', 'NotClickBait': "Rollins' face at the end of the Roman segment was so devastating. Made me cry too", 'sona sona': ':,wv nbv  vv  bwa DC c thx c. n xvf  BBC m ex dear dryer 76', 'nikmigvalbuena': 'giving dean as much heat as possible i guess', 'Miàn Ahmir': 'Roman = shit', 'Ceres': 'Id understand if they couldnt for pbvious privacy reasons, but if roman was comfortable id love to see a 24 or 365 series on Roman Reigns. A look into how he recovers and how he is able to manage his personal life and work. Kinda like the seth rollins one they did, but obviously this one is a bit more serious', 'Crayniaq Gaming': "Too soon? Hell no it wasn't too soon. \n\nI mean aside from the obvious fact that it's a work and I'm sure Rollins and Ambrose went out for a couple of cold one's right after the show, with Roman's announcement, this was PERFECT timing because literally especially after that announcement and then winning the title...nobody expected the turn to happen in the same night. That's what makes it so perfect.", 'Shavinder1999': 'Heel turn made complete sense. Seth called dean a lunatic again and that made him snap. Dean was struggling with trying to fight off that name but couldn\'t in the end which is why when he was attacking seth he kept yelling "SAY IT AGAIN" and "WHATCH YOUR MOUTH, YOU STILL THINK ITS FUNNY?" Justified turn.', 'Moshe': 'The shield has fallen', 'LIAR LIAR OF ME BLEW TOO MOVEMENT': "I'll be cheering for leukemia", 'CurbCrusher': 'WWE really suprised me with that episode, it was good. P.s Get well soon Roman', 'Iron Marmite DC': "The Roman reigns situation is heart breaking and I understand why people are little apprehensive about the timing of deans turn. Personally I feel like it had to be this week. Nothing is going to get him more heat than turning on Seth when he did. This is the way they are going to get absolute most out of it. He clearly heard Seth say something, which I hope he might reveal next week, or maybe he just doesn't trust Seth without Roman there holding them together. \nI just hope that wwe atleast talked to Roman about it.", 'Advocatus Diaboli': "Wow! Roman Reigns face turn is when he reveals he is dying and leaving. As usual too, nobody's opinions mattered.", 'whatssofunny171': 'So the point of the mens *MITB* briefcase is ?', 'Jason Fuentes': 'Whole lotta unexpected things happened here. Two Face turns, a contract signing where the table stayed intact and there was no brawl, a major Heel turn, Fin Balor won a match, and of course the unfortunate Roman Reigns hiatus.', 'MAC CHZ': "So nobody's gonna mention that Mayor of Knoxville reference by DX"}{'HAVOK586': "The heel turn was executed perfectly.  They had been planting the seeds for weeks, so when a genuine setback occurred, they were forced to pull the trigger.  Any other time or method of trying to turn him heel would have left us still loving him.  Now he seems like a genuine villain.  I think he's got Ciampa levels of heat now, which is great.  It's still early, but I think we'll be talking about this RAW for decades to come, and how this may be the best heel turn of all time.", 'Marfoof': 'So are Mickie James and Alicia Fox now "the Heels in Heels"?', 'Kenpachi343': 'I may not be a fan of Romans push but nobody deserves to have their livelihood taken away like that. That was not how I wanted him to lose the title I just hope this is not the end of his career.', 'xXtherealbgbXx': 'It took Cancer to turn Roman full face. (Yes I realize how crappy that thought is) Best of love to Him and the Anoai family', 'I hate the Young Bucks': "It was the perfect time for dean/seth to break up. Happening at the same time as roman leaving puts over roman, and I think the shield reunion hasn't worked, and that they are stronger apart from each other.", 'AcornPlays': 'I think the turn was "too soon" in the fact I really don\'t think they had planned on doing it this week. However, if you were to have Dean turn any other week he wouldn\'t have been booed, Seth wouldn\'t have been as emotional and it wouldn\'t have been quite as intense. One of the most visceral heel turns of all time.', 'Sourav DotA SEA stream': 'Cant even abuse him anymore the tv character we all hated most not the person roman :( really tough for him now', 'Andrew Downey': 'Love reigns hope he get better as he is an under-rated performer,  I thought the ending was a touch of genius.', 'yamochan': 'That was one harsh raw to watch. One thing to take home is hopefully Roman will be back soon because he finally did it. He finally got everyone behind him. Its so very sad that it took this to happen...', 'rohit kumar': 'Give a superman punch to leukemia and come back man. U definitely defeat it 100%.', 'Fritz XXI-TFK-777': 'Maybe balor is getting his push now as RAW is desperate for babyfaces with credibilitu', 'Naveen Burdak': "M n aaj tak wwe kaval Roman reings k leya dheki h un ka eak bhi match bina dheka nahi chodda I'm pray for God please Roman ko jaldi theak karo", 'Noah Jones': 'I honestly forgot almost everything not Shield related from this show', 'Mada Don': "I request All the fan of \nRoman's  to pray 4 him😐", 'turtlehead2': "I'll have to rewatch the shield/dogs of war match to see if Dean and Drew touched each other", 'MisterMercy': 'This was the first RAW I have ever been to live and holy shit. What a bombshell to witness live.', 'J Gordon': "Its funny, I actually think the timing was PERFECT. A week ago, a heel turn would have got a cheer. People have wanted Ambrose to be a heel forever. \n\nHeel turns shouldn't get cheered. They should get booed. They knew that tonight, of all nights, for the first time in ages people wanted a cohesive shield. Hell, maybe even one last SHIELD bomb with Roman on Ziggler to close the night after the title win.\n\nInstead they pulled the rug out. People were booing the hell out of Ambrose. The heel turn WORKED. \n\nNow the story can proceed with the crowd against Dean and entirely on Rollins side as he's the one who - in their eyes - is still holding the SHIELD banner with Roman. \n\nIt was PERFECT.", 'blackbeltbap': "honestly I don't know about the ambrose turn either, on one hand, I really think they should have waited at least till next week to do it because it just adds more emotion to the show on top of  Roman, and that the roman thing took a bit of believablity out of it( ambrose clearly had gotten emotional before the backstage promo, even after he had somehow made it through roman's segment where rollins broke down). on the other hand, ambrose now has even more heat because he turned on rollins at the worst possible moment.", 'Philly Prince': 'Prayers up for the big dog. #ThankYouRoman', 'WWE Memes provider on youtube': 'i never thought i would have cried for the wrestler i hated most. Get well soon Roman.', 'Michael Daniels': "The way this setting up is Braun wins and Drew gets the push he deserves. I hope this doesn't make Braun a transitional champion,  but Drew has been on the top of his game since he has been back, and I would love Drew to become the first WWE Universal Champion from the Scotland and the UK in general.", 'Tom Lucas': 'Hope joe beats this and gets back into the ring. Hate the character, love the man.', 'Syed Daniel': 'Damn man... I was shocked when I saw the news.Really sad.Hoping for a speedy recovery for him! #ThankYouRoman', 'MisterCorrin': 'Wet down elias hair and let him join the shield', 'Edwin Ortega': 'So fucking sad', 'Charlie Newman': 'imo\nGood vid on a Raw that had some real power.\nAs much as I hate opening talk replacing wrestling, this one was a gut punch...powerful.\nThe main event and following action was aces as well.\nBetween the open and the main event, poor-to so-so with just a few really good bits.\nimo', 'Lucas Chapa': 'Weird ...woke up this morning and Roman reigns has a cancer story line now? Vince will try anything to get him over', 'cqdw 1234': 'Look, think of it like this. Dean could be the biggest heel after that turn. If he keeps being a low life heel, then it’s kinda good, but the timing of the turn is a bit off', 'Pappu Jatav': 'The Power OF ROMAN REIGNS', 'Fleabag McGilicuty': 'One of the greatest heel turns I’ve ever seen. Some say too soon but it’s wrestling. Using real life shitty situations to get heat is textbook.', 'Cameron Worley': 'Here’s hoping Roman kicks out before one and piledrives leukemia into oblivion', 'enniobg13': 'Im sad for the person and hope he can return healthy for his family. For the character I think is the best for WWE. WWE was stuck and now they have all the possibilities on the world.', 'Unknown User': 'I was thinking ambrose was going to turn on reigns, imagine the heat', 'Ryan John Davies': "Shock factor it was amazing I didn't think they'd turn him at all after Romans announcement and I would have hoped that WWE asked the Shield members if they were all okay with the turn happening tonight", 'Marc Leslie': 'One of the best heel turns we’ve seen in a long time! I personally don’t think there was a better time to do it. It would have been less effective if they did it at any other time.', 'PtolemyJones': 'No comment on how Angles promo was a lifeless zombie-drone as he read someone elses words off a teleprompter.', 'Pellet #1': 'It’ll be cool if somehow Dean and Seth keep the belts for a  good while and hate each other at the same time.\nI could see Dean winning a match and making it a point not to ever tag in Seth', 'prince 007': 'thank you roman and get well soon', 'GunGreenGo': 'I think its a work. Vince will do everything to get roman over.', 'Prince spady': 'No matter how you felt about the booking of Roman or how he’s been presented, no one wants to see someone battle a sickness. I hope he comes back soon 😢 #ThankYouRoman 🤙🏾', 'Deport Robbie Kruse': 'That Roman promo was the best of his career, WHEN he comes back I hope he can channel that emotion into all promos #thankyouroman', 'Adam Stewart': "Everyone in the six-woman tag match, except maybe Sarah Logan, deserves a better spotlight at Evolution. But at least they won't get lost in the mix of a huge battle royal.", 'MIKE CROWTHER': 'Can we trade Jack for Simon?', 'David L': 'Thank you BIG DAWG!', 'kaylamoonshoes': 'Dean was yelling at Seth the whole time he was beating him up. "Say it again" and "This is what you wanted". I\'m curious to see where this goes.', 'AmadoMayday': 'Will Seth and Dean still have the belts or will they have to relinquish them?', 'Wake me when we get there Huh': 'No matter how we feel about Roman as a wrestler ,he as a person I wish you well and hope you can beat this evil again.', 'Amr Abdelhady': 'It just makes me cry more and more every time 😭 and please Roman come back and I will be praying 🙏🏻 for you \n#thankyouroman', 'The NDstructible1': "Finally Elias is a face took long enough. He has the look and can tell a great story. He has what my biggest complaint with Roman and why I couldn't stand the Big Dog Character natural mic skills. On that note Joe get your ass back home to WWE. I want you to work on your character and mic skills. If you come back with that real feeling and improve there I will be behind your character cause Joe the real man is an awesome guy. All the things he does outside the ring was great. Sorta what I like about Cena but Cena dislike was cause he killed great stories by never losing. So with Joe out and the whole Tag Titles win and perfect heel turn cause it made it so much more. It was the most intense heat that felt so natural but off the charts. The kid asking Dean why why Dean made it even more powerful. Braun is the Babyface now and he can be part of himself. As you can see via his social media. He is a goofy big guy and can be a face finally and his run will be more natural as a face cause it also feels natural compared to Roman. God Damn it Joe you better kick Leukemias ass so you can make the greatest comeback story ever. I mean if he beats the big C imagine the hope this story would tell kids fighting cancer. I could put up with the shitty Big Dog persona for that story!!! Seriously while this was a heart breaking episode of Raw it was also an awesome one. Also seeing that emotion on Seth Face made it hit home and brought tears to my eyes cause in that moment the idea of this being a work stopped in its tracks.", 'duracell 1692': 'That merch plug was swift af', 'Ragestick': 'Lets hope that the Bigdog superman punches that leukemia and gets well', 'Mridul Batra': "Literally every wrestler on twitter has said he's the locker room leader and the best guy around them. I hope I can like the Roman Reigns character when he comes back. Get well soon. Thanks for the entertainment.", 'Skye Nyx': 'Oh god... I had no idea... Wow...', 'Adam Celona': 'I was their last night and had an awesome time', 'sammy 428': 'this will go down as one of the most emotional raw of all time.\n#thankyouroman', 'Kurt S': 'I boo Roman.\n\n\n\n\n\n\nI cheer for Joe beat cancer.', 'Clément Masse': 'Gonna find that asshole yelling "you still suck" after Roman told about his leukemia and "we won\'t" after he said he doesn\'t want people to feel bad for him and fuck his weak dumb ass up', 'Shinneth': 'Your interpretation of Dean’s motivation to turn heel matches mine, Jack. “Lunatics” usually won’t understand or care about doing a anything “too soon”. And from a meta perspective, given how badly they’ve handled teasing a Dean heel turn before this, this was the best time to do it to get the audience shocked AND invested. Any other time after this loses one or both elements.', 'JuJuJetastic': 'Cancer: the ultimate face turn.', 'Buncy The Frog': "I'm a little confused, logistically, how you deal with the tag team belt being held by people actively feuding (I'm assuming)", 'KryLys': '#ThankYouRoman', 'Kris Fields': '#ThankYouRoman so sad 😢😭', 'MrMikehunt87': "The response from the fans is genuinely heart warming. For all the hate that was being thrown at him people realise that he is still a human being deep down inside. I've had a lot of negative things to say about a TON of wrestling fans over the years but good on you all for showing the world that we aren't a hateful bunch of morons\n\nSo where does WWE go from here?\n\nThey were pushing Roman to be the next big thing, the next cena, the next Hogan, the next Austin.", 'james harmer': 'i think that was the best heel turn ive seen in a long time. i do think its perfect timing', 'KevinSkye1': "Nothing strange about Sasha's position on the card, she buried herself with that comment she made about the fans.", 'SAY UNCLE!!!': 'They need to add MacIntyre to that match.', 'Abyss 1': 'I really think the last segment should have been your first A+ grade. People complaining about timeing but I think it was perfect. Everybody was shocked cause nobody in that arena expected that and the way that Dean and Seth executed what was perfect. Roman will beat cancer ( cause he is Roman and this is what he always do lol ) and we will look at this moment as one of the best segments ever in profesional wrestling.', 'Yo Uncle & Yo Daddy': "I'm incredibly sad now as Roman is probably my favorite full time wrestler at the moment.", 'Erick R': "Random thought, there's some wrestlers who are talented and need a push... idea? New nation of domination. Lashley, Apollo crews, Titus. These guys aren't getting enough credit.", 'awesomeluis': "I hope from the bottom of my heart that Joe Anoai kicks leukemias butt and gets well soon, but if this is some sick kind of way to put Roman reigns over and get the fans to cheer for him, Wwe will get what's coming to them.", 'Maximillianrex Carpediem': 'I think Finn won to cheer up the crowd.', 'sanket sinha': "The Ambrose heel turn whether good or bad depends on the 'why' promo next week.", 'JoyBoy_316': "OMG I didn't watch the ep and I just heard it in this vid this is the worst news I've heard in a long time get well soon joe and come back to us #ThankYouRoman", 'necrolobstercon gaming': "I know its an angle, but what the hell did rollins say that pissed off dean that made him scream to rollins to say it again?  I reiterate, i know its an angle. Did anybody find dean's turn peculiar, he seemed almost hurt? Not owning his turn, but rather hurt emotionally.", 'Theoretic101': 'Hate Roman, love Joe Anoai.', 'SuaveTitan': 'Whats tricky about the turn ? Its OBVIOUS he was turning so why not do it now while anybody was on a emotional high, gonna go down as one the best turns ever', 'Sharaun Martinez': 'Wouldn’t wish that on anyone.....but we finna got rid of roman. If only for a little while.', 'Erik Finkbeiner': "if Alexa Bliss is injured they should make it a triple threat match between Trish Stratus, Lita and Mickie James in my opinion. it's a nice nostalgia match at least and certainly better than a tag team match with Alicia Fox.", 'NinjaSYXX': 'Wishing all the best for Roman #ThankYouRoman\n\nOn another note, it may not be smart business-wise, but having house shows a week or 2 prior to payperviews seems to be not so good of an idea. Alexa getting injured is a huge blow to that match.', 'Adolfo Coy': 'Maybe Roman was the lynch pin for Dean and Romans sickness drove Ambrose mad', 'Potty Top': "One would of thought by now after watching raw so much Jack would realise how much the WWE love their 50/50 booking. Obviously he isn't that clicked on how WWE do things.", 'Robb Hebert': 'Having Dean turn heel on this night was a very rare stroke of genius for WWE. Kudos to them for getting that right. Biggest heel turn moment since Ciampa turned on Gargano.', 'Val': "I honestly believe Dean's turn was absolutely perfect. They managed to make a predictable heel turn unpredictable, and the timing was perfect for Dean to get some major heat.", 'KingsHeathDon91': 'I would give the Reigns segment a C-.', 'Brad Montague': 'To try and spin a small positive out of this. Roman at least got to see the fans don\'t hate "Joe," they hate the character he portrays. Once that character was pulled back, the fans supported him without question. For a guy that\'s been mercilessly booed, and has had trouble handling that reaction at times. I hope this helps in the grand scheme of things. Good luck, Roman. Come back stronger than ever!', 'tomtomthebear': 'All it took to genuinely make Roman face was leukaemia, if only vince knew this sooner..!!!', 'brock _heymanguy': 'Are the raw tag titles going to get relinquished too?🤔 If so put them on AOP', 'Nick Montenegro': 'Get Well and beat it Roman a.k.a. Joe. I love your family and yourself. Roman will be back!!!!', 'Drake Farmer': 'I hate Roman but not Joe. Hope he will get better', 'George Varughese': 'Yes it was too soon,  I give it a F . They only have each other and wtf is going to happen to the tag titles.', 'Sam Laskowski': '#thankyouroman #thatheelturn', 'Phil Christian': 'The heel turn had to happen. With Roman gone they need to get people into the Main Event scene. If Braun wins and Brock leaves the main event scene goes to Braun, Drew, Seth and Dean so they need the Seth/Dean feud completed by the time Braun/Drew have completed their feud so the champion has someone to face especially since Braun and Drew haven’t held the top belt and aren’t experienced main eventers', 'MVPboppin': 'That was the perfect time to go heel. The show must go on and it just made the biggest heel on the roster. It was definitely not too soon. It’s story telling. It’s pro wrestling.', 'A.W. Lawson': 'I hated the heal turn...HATED IT! However, I feel like it’s time we start allowing wrestlers to have an in ring character apart from their real life persona. When Roman said my real name is Joe, it could usher in a new age of non-existent kayfab. It would really help the product. It is absolute garbage right now with this meandering between real and fake.', 'Logan Johnson': 'That was a sad start but an intriguing ending.', 'Huricane Lizard': 'Roses are red \nViolets are blue \nLeukemia hits it’s finisher\nRoman still kicks out at two\n\nFor all the crap we talk about Roman and I still don’t like his push that was such a heartfelt speech and it really shook me I wish him a speedy recovery', 'wyrw': 'So will Seth and Dean have to defend the tag titles?'}{'trigglyturk': '#ThankYouRoman', 'Scott Reardon': 'I’m a little surprised that Glen Jacobs is ok with participating in Crown Jewel. I imagine that his doing business with Saudi Arabia wouldn’t look too good from a political standpoint.', 'Sean': 'Aside from the Roman situation, something really sad from WWE is the complete disregard they\'ve shown for Evolution. They want brownie points for "The first ever all women\'s PPV," but it really seems like they aren\'t even bothering to make any attempt to make it a GOOD PPV. The card is smaller than any of their other PPVs and mostly very meh. They clearly didn\'t really care about this show beyond the publicity. It\'s very upsetting to see them constantly treat the women\'s division this way. And knowing WWE, I wouldn\'t be surprised if this show gets very low ratings on the network due to the lackluster card, and rather than blame themselves for putting on a bad show, Vince and the rest of the higher ups will think it\'s because no one wants to watch women\'s wrestling.', 'Benjamin Kelln': 'That Ambrose heel turn was executed perfectly, but I think it was the wrong time.', 'Cody Laighton': 'Ambrose Turing now is perfect. Any other time he would be cheered when he turned. On this show he was basically the devil.', 'Clash with Andrew': 'Roman will be the biggest baby face on the roster when he comes back. And I predict within 2 weeks or so after his return they try and turn him heel. However, he will be cheered when they want boos, just like he was booed when they wanted cheers. I respect the guy and am proud to be a fan. I did boo him, but it was only because of booking. I will be on Romans side from this point forward. Sorry for the short essay... praying for you Joe', 'MrsPig69': "Roman always kicks out at 2 anyway, so he'll be fine", 'J-TAR': 'When and if Roman beats leukemia, maybe they should consider bringing him back under his real name and without the "Big Dog" moniker.', 'Charles Berg': "The good news is there are many different types of Leukemia and we do not know which type he has. here's to hoping it is not a severe strain of the disease. Personally I do not like Roman Reigns however I have nothing but respect for Joe, thank you for your hard work and your dedication to the business.", 'Ryan Smith': 'I absolutely love Elias & I am so glad they tuned him face. Really just hoping they don’t ruin his Booking because he can be a superstar.', 'Quan D': 'The pop when Roman comes back is gonna be CRAZY', 'Zyshawn Moore': "Good Luck to Big Rome in his fight with leukemia. Hopefully he's back very soon. I haven't shed a tear in years, but I did tonight.", 'Malorm': "I'm an unapologetic Roman detractor. That said, my prayers are with Joe for a full recovery and strength for his family. \n\nNever thought I'd say this but I can't wait to see Roman back as soon as possible. I'll never be able to boo him again.", 'Naheem Quattlebaum': '#ThankYouRoman', 'JSAcousticJuice': "Watch it back and take a shot every time Maggle mentions Roman. Great episode ruined by Cole as always. I wish no harm to Roman, but by Christ i didn't need to know he has leukaemia 600 times.", 'JustOmegaMan Ω': "Personally, I'm ok with Dean turning. It gets a bunch of heat on him as a heel. It's something fresh. It's pro wrestling, based on stories not real life. They're allowed to be friends whilst feuding. Finally, Dean didn't turn on Roman, just Seth.", 'kibowman': 'Sunday\n(sunday (sunday))', 'Mcp2powers': '“I’m gonna take out Braun” .... by kicking him once. Yep, that’ll do it. No more monster.', 'Nathan Eli Draper': 'I’m thinking, about Finn Balor’s win against Bobby Lashley, is that with Dean turning heel and Roman (the top booked babyface) gone, Finn is essentially the next guy up. This may be Finn’s time to shine 😳', 'Hermaeus Jackson': "Just goes to show, people may have bitched and complained about Roman, but in general people are better than that and are able to see the human being behind the character.  I'm very glad people didn't boo him because that would have been tragic.", 'Snake': 'Well, I wanted Roman to take a break ... but not like this', 'CR 15': 'Wwe never mention that crown jewel is being held in saudi arabia on tv.........neither on raw nor on sd.......', 'Connor Richardson': 'Get well soon Roman', 'Evaldas Sadauskas': "this week's raw was really high on emotion, #ThankYouRoman spear the leakaemia and pin it and we are waiting for your return, DA BIG DOGGG", 'ysonline': 'So Braun went face, Elias went face and Dean went heel all in one night.', 'Mitch Davison': "I'll tell you what you grade it Jack. Fucking A+! This was bloody insidious and the perfect time to turn Dean for maximum impact. You can't tell me that the shield lads wouldn't have loved this out of kayfabe. Top 5 best heel turns.", 'twinewinder1': 'Deans motivation will be something Seth said to him in the ring after the match which set him off.', 'King Covfefe': 'That shit made me cry hard, makes you realise how precious everything is. \nLove to everyone in the comments and big love and prayers to Joe.\n\nWWE probably didn’t need to mention it another 50 times though, nearly turned off so many times. Really hard episode to get through.', 'MattFrencHammer': "As a 15 year old, i can't quite realize yet what happened, i was one of them, the guys who booed him every week for his terrible booking, when he came out last night i nearly turned off raw, i feel so bad and i think i have learned something today, i think lots of kids discovered that wrestling was fake today", 'Sean Huggan': 'Roman is a man of faith, as am I. Im praying for him, his family, his fans. \n\nI pray that not only will this episode of cancer go away, but there will be a huge miracle in the cancer leaving for good. \n\n"I can do all things through Christ who strengthens me".\n\nLove ya, Big Dog.', 'gazbason': 'AOP for tag titles', 'Triggered Wresting': '#ThankYouRoman', 'Jennifer Agar': 'No its not too soon. All this fake outrage is silly it was the perfect time. To get him heat.', 'Mike Fox': 'Dean Ambrose heel turn??? If only we had seen it coming!', 'mgunter': 'Ross should love Liv because her UUDD nickname is Daddy.', 'Nikhil Jose': "Roman will kick out at 2, leukaemia's got nothing on him", 'Anthony Khallouf': '10:59 don’t regret it, just paying homage to Roman.', 'DeeDo': 'The whole show was honestly an A for me. It was an incredible night (except the news of Reigns. Get well soon big dog ❤️) with an amazing ending.', 'eyfanat 201 201 ايفنت': 'ROMAN😢', 'H3AD': 'You forgot the part whr dean did the cross sign when he was in the crowd.', 'Shady': 'Really fucked up of WWE to play with my emotions. Get Well Roman!!', 'Ty Marshall': '#ThankYouRoman', 'gingergreek': 'I give the opening segment an F for FUCK CANCER!!!! \n\nRegardless of what you think of Reigns, wrestlers are literally the most selfless entertainers because whilst doing something they love, they do it knowing that they are in the longterm sacrificing their body and wellbeing just for the sake of putting a smile on our faces.', 'Rice MenaRQ': 'Seth crying got me', 'sriram panth': 'I have mixed feelings. With Roman gone I see a better and more unpredictable product coming out from raw. Genuine world class talent like Drew and Seth will be vying for the top title. Maybe the wwe championship will start headlining once in a while as well. But I will miss booing Roman. He is a tough lad who has made his career fighting against adversity. You need serious mental strength to come out after beating Taker and soak in that reaction. So I am sure the big dog will be back soon. Just hope he shows up on NXT and puts a younger talent over on his return which would earn him major respect from all the smarks. #ThankYouBigDog #HUUUUUAAAAA', 'SR B': "I don't understand the issues with the Dean heel turn. I think it was perfect. Doing now gives it the most possible heat, without actually using Romans sickness as cheap heat. No one was expecting it now, which it made it even better. For me, it was well timed, perfectly executed (especially by Seth) and I'm so excited for this feud.", 'Dyscalcular.': "Don't worry, we all know Roman's gonna kick out at 2.", 'Daniel Wilson': 'deen how cud u?', 'zhivago': "It's about time something ended his push lol", 'James Harrison': "It's a work you filthy marks, Vince has proved he will go to any lengths to get Reigns over!", 'Ady Simons': 'Its ACTUALLY took cancer to finally get Roman over', 'Martin Walker': "is it too soon? Don't be silly it's a show and the surprise was great! makes no difference to Roman so why not make it a great show?", 'Rueck': 'YEAH JACK!!!! GIVE TAMINA THAT WOMENSMATCH THE D!!!!!', '1 Survivor': "Cancer is a bitch. I lost my uncle to a very aggressive form of Leukemia 20 years ago (I'm not sure which specific kind but he went from healthy to sick to death within a matter of only about 1-2 weeks). I was young at the time and it hurt me a lot. So I know how bad it can be.\n\nWhen I heard about Roman I cried. And I have no shame saying that. When I saw Seth crying after hugging Roman I had a nasty pit in my stomach, it made me worry about how bad his diagnosis may be. I'm praying hard for Joe and his family. Love the character of Roman Reigns or not, Joe seems like a genuinely good guy. And he's always busted his ass for the fans. Please pray for this man guys. Trust me, nobody deserves to go through what he's going through. I really really hope that one day he comes back and gets to do what he loves to do. Go kick cancers ass Big Dog. We're here for you. 💯", 'Vincent Monroe': 'Apart from that stunning news at the begining (and I wish Joey all the best, please get through that time) <3 #ThanYouRoman what was really heartbreaking (story wise) was the "Its okay" from Seth after the first Dirty Deeds. Also the look on his face at the end.', 'Savage Sagwa.': 'Come on big dog. Spear cancer right out its boots. #thankyouroman', 'Omega Riddler': "It's obvious you didn't hear what Dean Ambrose was saying during the assault but it's obvious what the justification was.  He feels like he's being treated as a joke and he's had enough with Seth Rollins making lunatic jokes.", 'kmt78901': 'Since when is a roll up a clean win lmao', 'Ishtarahara': "new punishment for a ppv, walk a mile in Alicia Fox's shoes!", 'Jorma Steelhail': 'I think this was the perfect time to turn Ambrose heel. I think his reasoning is Seth calling him "lunatic" and being condescending to him/about him. I think that will be very interesting to play out', 'Adrian Smith': 'Liked this Video For Roman Regins!', 'DannyBTalks': '#SpearCancer #FightBigDog', 'Just One Guy': "I hope I am wrong but I swear to God, if this is all a work and Roman returns at Royal Rumble entering at #30 and wins...\nIt's a disgusting, disgraceful thought I know  but someone needs to say it. I don't expect WWE creative to stoop so low to get one guy over but still.\n\nI have never before hoped to be so wrong as I am right now.\n\nI hope Joe recovers and returns to the ring soon.", 'Helicard': "You will never see Lashley, Apollo and Big E in the ring at the same time. For the same reason you don't see Mick Foley, Mankind and Dude Love in the ring the same time", 'kuhpunkt': "The new Halloween movie is no remake, it's a sequel to the original. Get your facts straight!", 'TheTwuh': "I really think the turn should have waited honestly... I wanted the turn but it really should have wait in my opinion. I mean the emotional backing to it made for incredible timing but fucking hell lol. Honestly the reason I have an issue with the timing isn't because Roman had to take time off. I just think it being immediately after winning the tittles was poor timing for the belts themselves because they're likely gonna be put on the back burner so we can focus on the new dynamic between the two.", 'zdruva Nosworthy': 'I hope roman gets well but and if he does beat the leukemia, vince will be rubbing is hands cause everyone will be behind him, and if people didnt cheer roman during is wwe career so far its not hate towards the guy but how he was booked thats what people hated about it cause it wasnt a genuine thing', 'soullessginger83': "Ok i wonder if i am the only one who noticed on the still picture for the sasha vs ruby, that both liv and Sarah's faces look like they were photoshopped in from another career...which is also filmed lol. Don't worry Liv I still love ya", 'Connor Darbyshire': '#FuckYouCancer...\nRoman has been an idol to me since returning back to watching WWE and this hit hard. Nothing has made me cry in WWE but this was a bullet to the heart. He will fight, he will conquer and he will return, faster, stronger and better than ever! Thank you Roman❤️👊🏻', 'Pepindie gaming': 'WWE is actually starting to get entertaining again, it’s amazing!', 'DerpyKid _YT': 'Ever realize that Drew and Braun have always had issues from breaking the trophy wayy back when to the feud now..', 'XL R8': 'Are they going to murder them\n😂😂😂', 'Kevin kharrat': '#thankyouroman', 'space pegasus': 'I think the timeing if the Dean turn was great as we were all excpting a hell turn from dean but doing it now pull the rug out under us', 'Grey': "I never thought that Dean's emotionless face during the group hug at the opening segment was the foreshadowing of his heel turn later that night.", 'Daryl Castillo': 'Kobashi that shit, Leati', 'Dom Edwards': 'I like the Dean heel turn, he gets super heat for betraying, but has that conflict as well, Seth turns into a super sympathetic baby face. It’s great', 'Watch My 666': 'The Big Dog will be back to his yard stronger than ever.', 'Channel Channel': 'I think at mania we will get Rollins vs Dean for the Universal title', 'Jordan': "McIntyre vs Strowman after Crown Jewel that's happening somewhere on planet earth, cant remember where, for the rest of 2018 can be epic!! Imagine these two big bastards at TLC!", 'Nikyle Bisnath': 'I was crying when that heel turn happened also.', 'Joe Cook': 'It was the right time.', 'Tito Duran': 'One of the most memorable raws for me.', 'Adil Bhatti': '#Raw #ThankYouRoman', "It's me, Stab": 'Superman punch that leukemia Roman.', 'Muhammad Smith': 'It took Roman to get cancer to get him cheered. Wrestling fans are trash', 'Larry': 'RAW was great this week, long time since I said that', 'Michel Samir': 'I hope that Drew Mcintyre is added to the universal title match', 'Julsey Rules': 'I hope Roman does to cancer what Elias did to that guitar.', 'AKPRED': "Triple H and Shawn's grave stones said 2 November 2018 but I thought Crown Jewel is no longer on 2nd November? They didn't mention the date either this week except on those gravestones", 'Georges Drouillard': "Keep your shoulders off the mat and we'll be sure your hand reaches the rope Roman! You got this!!"}{'Brandon Denniston': 'Not a bad show', 'Julsey Rules': "Cultaholic really stepping up their game.  The past few weeks, always first to post among all my wrestling subs.  Classy move not grading the opening, I was wondering where you'd take that.  Also pleased that 90% of YouTube comments are being classy.  Facebook comments have been depressing.  😑", 'HockeyDood 33': 'Just honestly I think it made the heel turn even better because there not using Roman as the focal point of the feud, but it makes Seth Rollins the Biggest Baby Face in all of wrestling, probably my favorite heel turn off all time', 'zambiekiller360': 'Its Awful to say but its ironoic that its Roman', 'FatherSasuke': '#GetwellJoe 🙏🙏', 'NEL 8584': 'F@CK CANCER!!', 'JB Tiamson': "This is how you blend reality into a storyline. Great job by the shield for putting an emotional and bitter story arc. Get well Roman. Can't wait for Seth's emotional rebuttal to Ambrose's attack next week.", 'dat boi': 'love this channel. keep up the great content 👌🏻👌🏻', 'Anthony Lopez': "Come on now. Nobody I mean NOBODY thinks it's a work to play off his diagnosis from over a decade ago?\n\nIt's not as if the WWE hasn't done worse to generate heat...", 'Venemofthe888': "The titles on raw need to dispersed a little more since seth and Dean hold the men's titles and the universal title being vacant now. I hope braun wins the universal title to be a mega face. The tag titles I hope go to someone else cause atm they r just kinda there", 'Jamieb1994': "I really hope Joe (Roman) gets better soon & comes back to RAW better & stronger. Also even though the past few RAW shows hasn't been too enjoyable imo, but last night's RAW has been enjoyable, Elias' apparent face was entertaining to see & wasn't expecting Dean to turn heel, especially when they've been crowned as new champions but having it happen last night has gave me mixed feelings though. In a way it was interesting but at the same time I felt like it might of been a bad timing for it to happen.", 'Sequellbellhelmel': 'That was one of the most emotional heel turns in quite a while. Everybody saw it coming, except not today. It gave it that extra oomph, that additional punch to the gut, if you will.', 'Kenny Havoc': "Roman is over now. He'll come back to a monster reception and he'll be loved. And we'll all love him too", 'Brock Sisson': "Can't wait for Roman to whip Leukemias ass from pillar to post. Not ashamed to say seeing Rollins cry made me cry.", 'LORDE OWS THE KING': 'Hey like I said every week you all bitch about something, now its " ambrose turning heel last night " like ok just stop the show and basically phone it in because roman said he has cancer. You motherfuckers are always crying about something.', 'Shannon James': "What happened on tonight's RAW will leave ripples throughout WWE for a long time, hoping that Joe gets through this.", 'Costa Coffee': 'I actual want roman reigns to come back and win the title, what an amazing story that would beat, beats cancer to come back for the fans. Roman has gained so much respect from me', 'Νικος Μντζ': 'Get Well Soon Joey Anoai!!!!!!! Roman Will be Back!!!!!', 'Daniel Kells': 'Obligatory "Fuck Cancer" comment.\nBut in all seriousness I do hope for Joe to make a full recovery', 'Nicky Styles': 'Get well soon, Roman. Praying for you, mate.', 'Nick Edge': 'I dont like Roman Reigns character but I LOVE Joey Anoai the Guy!!!!!!! Get Well Soon Roman you will come Back better that ever!!!! Lets All pray for Roman!!!!!!', 'brownOracle t': '#FuckLeukemia', 'Nich Hodge': "Might dislike Roman Reigns but feel sorry for Joe Anoa'i and hope he fully recovers. And I thought Dean's heel turn could have at least waited a week", 'BibahMax': 'Best RAW in a long time and you better believe that', 'AKPRED': '#ThankYouRoman', 'Daniel Farrugia': 'Reigns got cheered, Elias is a face, Braun is a face (again), Dean got NUCLEAR heat... WONDERFUL  RAW', 'Alex A': 'Never clicked so fast. Screw leukaemia', 'Jamie Holmes': 'It’s really upsetting to learn that Roman Reigns has cancer. His promo was really good and the emotion really came across from how he was dressed in street clothes and not his flak vest to how he spoke.\n\nI hope he Superman Punches and Spears his leukaemia and beats it in a squash match\n\n#ThankYouRoman #BeatTheCancer', 'Preston Mcalhany': 'He got Ligma', 'AussieMenace': 'So sad to hear of Roman’s Leukaemia.. Lets hope for him to kick cancer’s ass and return healthier than ever ❤️', 'M . A Campbell': 'That was a heavy episode to get through', 'Nibbles Paddington': 'Get well soon Roman', 'Hamish Hunter': '2nd', 'Kahn Hosko': 'first'}{'Brandon Denniston': 'Not a bad show', 'Julsey Rules': "Cultaholic really stepping up their game.  The past few weeks, always first to post among all my wrestling subs.  Classy move not grading the opening, I was wondering where you'd take that.  Also pleased that 90% of YouTube comments are being classy.  Facebook comments have been depressing.  😑", 'HockeyDood 33': 'Just honestly I think it made the heel turn even better because there not using Roman as the focal point of the feud, but it makes Seth Rollins the Biggest Baby Face in all of wrestling, probably my favorite heel turn off all time', 'zambiekiller360': 'Its Awful to say but its ironoic that its Roman', 'FatherSasuke': '#GetwellJoe 🙏🙏', 'NEL 8584': 'F@CK CANCER!!', 'JB Tiamson': "This is how you blend reality into a storyline. Great job by the shield for putting an emotional and bitter story arc. Get well Roman. Can't wait for Seth's emotional rebuttal to Ambrose's attack next week.", 'dat boi': 'love this channel. keep up the great content 👌🏻👌🏻', 'Anthony Lopez': "Come on now. Nobody I mean NOBODY thinks it's a work to play off his diagnosis from over a decade ago?\n\nIt's not as if the WWE hasn't done worse to generate heat...", 'Venemofthe888': "The titles on raw need to dispersed a little more since seth and Dean hold the men's titles and the universal title being vacant now. I hope braun wins the universal title to be a mega face. The tag titles I hope go to someone else cause atm they r just kinda there", 'Jamieb1994': "I really hope Joe (Roman) gets better soon & comes back to RAW better & stronger. Also even though the past few RAW shows hasn't been too enjoyable imo, but last night's RAW has been enjoyable, Elias' apparent face was entertaining to see & wasn't expecting Dean to turn heel, especially when they've been crowned as new champions but having it happen last night has gave me mixed feelings though. In a way it was interesting but at the same time I felt like it might of been a bad timing for it to happen.", 'Sequellbellhelmel': 'That was one of the most emotional heel turns in quite a while. Everybody saw it coming, except not today. It gave it that extra oomph, that additional punch to the gut, if you will.', 'Kenny Havoc': "Roman is over now. He'll come back to a monster reception and he'll be loved. And we'll all love him too", 'Brock Sisson': "Can't wait for Roman to whip Leukemias ass from pillar to post. Not ashamed to say seeing Rollins cry made me cry.", 'LORDE OWS THE KING': 'Hey like I said every week you all bitch about something, now its " ambrose turning heel last night " like ok just stop the show and basically phone it in because roman said he has cancer. You motherfuckers are always crying about something.', 'Shannon James': "What happened on tonight's RAW will leave ripples throughout WWE for a long time, hoping that Joe gets through this.", 'Costa Coffee': 'I actual want roman reigns to come back and win the title, what an amazing story that would beat, beats cancer to come back for the fans. Roman has gained so much respect from me', 'Νικος Μντζ': 'Get Well Soon Joey Anoai!!!!!!! Roman Will be Back!!!!!', 'Daniel Kells': 'Obligatory "Fuck Cancer" comment.\nBut in all seriousness I do hope for Joe to make a full recovery', 'Nicky Styles': 'Get well soon, Roman. Praying for you, mate.', 'Nick Edge': 'I dont like Roman Reigns character but I LOVE Joey Anoai the Guy!!!!!!! Get Well Soon Roman you will come Back better that ever!!!! Lets All pray for Roman!!!!!!', 'brownOracle t': '#FuckLeukemia', 'Nich Hodge': "Might dislike Roman Reigns but feel sorry for Joe Anoa'i and hope he fully recovers. And I thought Dean's heel turn could have at least waited a week", 'BibahMax': 'Best RAW in a long time and you better believe that', 'AKPRED': '#ThankYouRoman', 'Daniel Farrugia': 'Reigns got cheered, Elias is a face, Braun is a face (again), Dean got NUCLEAR heat... WONDERFUL  RAW', 'Alex A': 'Never clicked so fast. Screw leukaemia', 'Jamie Holmes': 'It’s really upsetting to learn that Roman Reigns has cancer. His promo was really good and the emotion really came across from how he was dressed in street clothes and not his flak vest to how he spoke.\n\nI hope he Superman Punches and Spears his leukaemia and beats it in a squash match\n\n#ThankYouRoman #BeatTheCancer', 'Preston Mcalhany': 'He got Ligma', 'AussieMenace': 'So sad to hear of Roman’s Leukaemia.. Lets hope for him to kick cancer’s ass and return healthier than ever ❤️', 'M . A Campbell': 'That was a heavy episode to get through', 'Nibbles Paddington': 'Get well soon Roman', 'Hamish Hunter': '2nd', 'Kahn Hosko': 'first'}{'Brandon Denniston': 'Not a bad show', 'Julsey Rules': "Cultaholic really stepping up their game.  The past few weeks, always first to post among all my wrestling subs.  Classy move not grading the opening, I was wondering where you'd take that.  Also pleased that 90% of YouTube comments are being classy.  Facebook comments have been depressing.  😑", 'HockeyDood 33': 'Just honestly I think it made the heel turn even better because there not using Roman as the focal point of the feud, but it makes Seth Rollins the Biggest Baby Face in all of wrestling, probably my favorite heel turn off all time', 'zambiekiller360': 'Its Awful to say but its ironoic that its Roman', 'FatherSasuke': '#GetwellJoe 🙏🙏', 'NEL 8584': 'F@CK CANCER!!', 'JB Tiamson': "This is how you blend reality into a storyline. Great job by the shield for putting an emotional and bitter story arc. Get well Roman. Can't wait for Seth's emotional rebuttal to Ambrose's attack next week.", 'dat boi': 'love this channel. keep up the great content 👌🏻👌🏻', 'Anthony Lopez': "Come on now. Nobody I mean NOBODY thinks it's a work to play off his diagnosis from over a decade ago?\n\nIt's not as if the WWE hasn't done worse to generate heat...", 'Venemofthe888': "The titles on raw need to dispersed a little more since seth and Dean hold the men's titles and the universal title being vacant now. I hope braun wins the universal title to be a mega face. The tag titles I hope go to someone else cause atm they r just kinda there", 'Jamieb1994': "I really hope Joe (Roman) gets better soon & comes back to RAW better & stronger. Also even though the past few RAW shows hasn't been too enjoyable imo, but last night's RAW has been enjoyable, Elias' apparent face was entertaining to see & wasn't expecting Dean to turn heel, especially when they've been crowned as new champions but having it happen last night has gave me mixed feelings though. In a way it was interesting but at the same time I felt like it might of been a bad timing for it to happen.", 'Sequellbellhelmel': 'That was one of the most emotional heel turns in quite a while. Everybody saw it coming, except not today. It gave it that extra oomph, that additional punch to the gut, if you will.', 'Kenny Havoc': "Roman is over now. He'll come back to a monster reception and he'll be loved. And we'll all love him too", 'Brock Sisson': "Can't wait for Roman to whip Leukemias ass from pillar to post. Not ashamed to say seeing Rollins cry made me cry.", 'LORDE OWS THE KING': 'Hey like I said every week you all bitch about something, now its " ambrose turning heel last night " like ok just stop the show and basically phone it in because roman said he has cancer. You motherfuckers are always crying about something.', 'Shannon James': "What happened on tonight's RAW will leave ripples throughout WWE for a long time, hoping that Joe gets through this.", 'Costa Coffee': 'I actual want roman reigns to come back and win the title, what an amazing story that would beat, beats cancer to come back for the fans. Roman has gained so much respect from me', 'Νικος Μντζ': 'Get Well Soon Joey Anoai!!!!!!! Roman Will be Back!!!!!', 'Daniel Kells': 'Obligatory "Fuck Cancer" comment.\nBut in all seriousness I do hope for Joe to make a full recovery', 'Nicky Styles': 'Get well soon, Roman. Praying for you, mate.', 'Nick Edge': 'I dont like Roman Reigns character but I LOVE Joey Anoai the Guy!!!!!!! Get Well Soon Roman you will come Back better that ever!!!! Lets All pray for Roman!!!!!!', 'brownOracle t': '#FuckLeukemia', 'Nich Hodge': "Might dislike Roman Reigns but feel sorry for Joe Anoa'i and hope he fully recovers. And I thought Dean's heel turn could have at least waited a week", 'BibahMax': 'Best RAW in a long time and you better believe that', 'AKPRED': '#ThankYouRoman', 'Daniel Farrugia': 'Reigns got cheered, Elias is a face, Braun is a face (again), Dean got NUCLEAR heat... WONDERFUL  RAW', 'Alex A': 'Never clicked so fast. Screw leukaemia', 'Jamie Holmes': 'It’s really upsetting to learn that Roman Reigns has cancer. His promo was really good and the emotion really came across from how he was dressed in street clothes and not his flak vest to how he spoke.\n\nI hope he Superman Punches and Spears his leukaemia and beats it in a squash match\n\n#ThankYouRoman #BeatTheCancer', 'Preston Mcalhany': 'He got Ligma', 'AussieMenace': 'So sad to hear of Roman’s Leukaemia.. Lets hope for him to kick cancer’s ass and return healthier than ever ❤️', 'M . A Campbell': 'That was a heavy episode to get through', 'Nibbles Paddington': 'Get well soon Roman', 'Hamish Hunter': '2nd', 'Kahn Hosko': 'first'}