{'ALSABAYA OMÁR': 'Are you still thinking of doing the Reus sbc?', 'Sam Twigg': 'Nep honest question does it feel to you that the game is dying already? To me everything feels sluggish and slow passes are barely making it to my team and shots are so inconsistent for me this fifa is so close to dying due to this what is ur opinion?', 'River': "I've missed up to 40 1v1s", 'lopl': 'i got 1.4 mil any ideas for a team guys?', 'Jay Billing': 'Do you think it’s worth it selling all your gold cars and getting it them back during Black Friday', 'Ryan Mix': 'Hey Nep I’m with you for getting good pack luck for goalies. I got a first owner Buffon from a basic squad builder.', 'dox soundsystem': 'Point made at the end of vid sums up Fifa 19 for me. For it now to be easier to score bicycle kicks and long shots has killed this edition of Fifa for me. I have gone from div 1/champs player to a trade to glory with little or no interest in gameplay.', 'Franco Serrao': 'Wow as a long time viewer, Nep being one of my favorite FIFA YTers.  I have to say having Nep read not one but TWO of my comments in vid is f’ing sweet.  Thanks Nep, much love, keep doing what you do.', 'Cameron Chohan': 'Can you please play in f8tal', 'Sean Borg': 'how can I claim the pre-order reward packs? I never seem to get any even though i pre-ordered ultimate version', 'Luke B23': 'Nep why aren’t you doing F8tal! You need to SKOOL these fools!', 'zSnare': 'There is a tall Chinese team???? 15:10 🤣🤣🤣', 'Joe Hurst': 'how do you bump your goal keeper, love the vids', 'shaqw19': 'i agree with you about the assisted passing nep, but ea have made it ridiculous to play semi assisted for passing and shooting. all the way up to fifa 16 semi assisted was insane and certainly meta,  now its trash, its one of the mechanics i dont understand them changing, making assisted better and making semi assisted worse lowered the skill gap dramatically, same with the passive defending mechanics we have now. it should be rewarding to read your opponent and control the situation yourself not a punishment. the games becoming bigger as an esport yet less skilful at the same time', 'Akif Dogruyol': 'Its like EA listened to you. You said in an early episode you wanted lloris because he is perfect for you 😂', 'Ninja Mufi': 'Hey Nep! What You think if EA would add console and PC cross play on fifa. In my opinion it would be amazing. You would play better players and your games would not take so long to search. And in transfer market would have more stuff what I think is good. (sorry for my bad English:) Keep up the good work, I realy enjoy watching your videos!', 'auba meyang87': 'Creat video once again neppo! My favourite time of the day is when I see your video on my sub box :)', 'MrKENYONarsenal': "Got 1.7m coins to spend on an attack as my defence is untradable and good. But I keep trying teams for a few days and hating it and keep losing tax! Don't want to not use the coins but don't want to lose them!", 'EliteHero': "Hey Nep. Been loving your videos for years now. I'm really struggling this FIFA. Have you got any tips for an average player. Practicing skills and getting a lot better at dribbling and controlling the ball.", '64 Ahmed': 'What music do u like to hear while playing FIFA just out of intrest', 'Shaun Marr': 'I wish I had terrible pack luck 🙃', 'Zabator XV': 'Hi nep I can´t ger my pre oder packs. What to do the EA help have not help me.  Have the Ultimate version', 'l': 'Your pack luck is huge', 'Ammanuel Dawit': 'Honored to have the top comment Nep. Keep it up!', 'aseel abbas': 'how do you skip after scoring  a goal', 'Thomas Sørensen': 'My biggest problem is defiently i get mad too easy', 'Mahbub': "I can't follow you on Twitter cos you got me blocked :/", 'Thierry Tribelhorn': 'hey nep, absolutely love your stuff! you said, you played some games at sunday night...when is this? like 6pm or more like 10/11pm or even like 2am?', 'Δημητρης Γερακης': 'Why you always you doing celebrations that they are attacking to your opponent i mean that shhh and dab', 'Jack McCarthy': 'Yo nep I packed sane champions league yesterday what’s the best way to use him?? Loving the series', 'Habibur Rahman': "First FIFA I'm ever playing properly. Your videos have been very useful man!", 'Dan Fagan': 'How do you do a la rocetter', 'J': 'I seen you mention on Twitter about the possibility of a sport psychologist to help you with weekend league. I really think you should try that, i think it would be interesting to see if your gameplay changes and if your mentality whilst playing the game improves. It would add to the great content you’re uploading dude.', 'francisguilherme13': 'Try meditating for 20 minutes a day. Can improve focus and learn to manage your emotions better.', 'Charlie Taylor': "Hey Nep, do you think it's worth buying all the teams for the serie a now in anticipation for the serie a league sbc? I love all your work and I hope you and your family are ok.", 'Ben Conlon': "if only you'd kept ucl vertonghen", 'laurence donaldson': 'I 100% agree with the comment of team ratings have an affect on the team ratings you come up against on fut champs. I also have an average team and only once did i come up against a team that was 3 team ratings higher than mine.', 'DannyAfi22': 'Strange, I got champion edition order stuff and a code for the standard edition, when I put itv the codes in I got 2 pre order packs because they stacked so that’s a bug that yours didn’t stack', 'Connor Robinson': 'Adan saved your ass the other video, he deserves your respect neppo. That save was HUGE.', 'UltraVioletHD': 'I listen to classical music when playing. Helps me play chill', 'Daniel Emmerich': 'Hey Nep! Just wanna thank your for your videos which entertain us nearly every day! Keep on going! Just thought it was time to tell you that ;-) Greetings from Germany!', 'Mst rmf898': 'Why does your keeper move out of the way of the shot', 'Marcin Foremniak': 'Guys, van dijk or if bailly?', 'Oscar Patterson': 'Hey Nep do you think that form could reduce your potential as a player? You get fairer games but less chance to match up against and learn from players who are much better than you', 'Scottish 123': 'Did he really just speak about a bad pass for 5 minutes, yes. Yes he did.', 'Thefootballman 06': 'Try just the movement trainer usually i hate trainer but with that im really happy as all it shows is a small arrow and the time finish bar i must recomend.', 'Aidan Soccerplayzz': 'Wiggle \n Wiggle\n   Wiggle\n     Wiggle\n       Wiggle\n   Wiggle\n  Wiggle\n Wiggle\nWiggle\n   Wiggle\n     Wiggle\n       Wiggle \n         Wiggle\n        Wiggle\n       Wiggle\n      Wiggle\n     Wiggle\n    Wiggle \n   Wiggle', 'Charlie Pundzus': 'Hey Nep, love your content. This is my first year doing FUT right away from release. What do you plan on doing with FUT Swap items from Oct, and do you know if we can use them in coming months or only the month that they were given during? Thanks man! Keep up the good work!', 'Jordan Mee': "Haven't seen what he packed yet but I assume it's Fabinho? Much love on the series Nep!! I like the concept!", 'Daan Roelofs': 'Hey nep, you can use kimpembe now you have Lloris!', "Fionn O'Hora": '4:37 what is his keeper doing I noticed it last episode too', 'Lukeoni': 'I really thought you finally packed that much needed BIG CDM although lloris is a big pull good to see a change in the team. \nLove the vid as always nep by far my favourite youtuber', 'Jack H': 'Hi nep, there’s a way to make polls which pop up during the video in the top right corner which would make getting feedback from us, the viewers, a lot easier (such as the question at the end, Oscar or augusto)', 'Villan 10': 'Oscar', 'ryan kenny': 'Hey Nep. I was wondering if you could help me out. Last year I was not that bad of a fifa player, but this year I can’t seem to get the mechanics down at all. I can’t score a lot or defend well. I was wondering if you have any tips for me to help me improve my game. Thanks love the channel brings me joy to watch your videos everyday!', 'Chris Lewis': 'Gold 1 first week ospina . Gold 3 last week van dijk b. Silva. Why feel pressure when it means nothing reward wise. Peace to you nep', 'Juho Viinikka': 'You cant use trainer in fut champs', 'Bijan Afshari': '4:37 wtf is the keeper doing. If that happened to me rip controller', 'Aidan Boyle': 'Am so happy from the champions league packs I got sane and sergi Roberto', 'Keanu Salem': 'I have a game mode idea\n\nIt’s basically a draft but you have the option to sell players (different transfer market) with that money you can buy players for example if I get Ronaldo and Messi I’d sell Messi and the team around him and I’ll buy a serie a team around Ronaldo with the option of using chem styles and position changes', 'Ked Amin': 'I got blocked on Twitter, help me unblock pls :(', 'Jorge Peña': "Hello Neppo, some pro players and youtubers are saying that this is the worst fifa ever, personally I dont like this fifa but I has to do. With the fact that I am not very good at the game but what do you think of the good players saying that is garbage? Of course you are a really good player but honestly do you think that is a bad game? You enjoy it because u win of course because as you say you learned the game mechanics but dont you think that those game mechanics are not enjoyable?? Ex. Finesse shots, abusing la croqueta, córners, headers, AI defending, all of that crap what is your opinión in that? I hope I got my point clear in general do you think that is a bad game?\nI love your videos sin fifa 13 play to win you are my favorite fifa YouTuber I'd ve amazed if you answer me, keep the good work.", 'New Zealand Lads': 'Hahahahhahahahahahahhahahahahahahahahahagahahahahahahahahahahahahahahahahahahahahahahhahahahahahahahahahahahah this game is a absolutely joke inform Neymar and aubameyang missed a combined 27 shots all in good positions and it was a mix of low drivers,finesse shots,normal shots and 6 open perfect timed shots from just outside the box then his inform indigene with 78 shot and sterling with 73 shooting from outside the box and I had a better keeper btw my opponent only took 2 shots and won 2-0 I messaged him after the match and he said he wasn’t doing timed finishes just normal shots', 'Ak Harriott': 'Hey Nep will u be going to Div 1 to help AA9skillz get game?? Lol', 'Pierre-Emerick Aubameyang': "You shouldn't be able to pick a red inform twice in fut champs rewards", 'Kevin Kelly': 'Lol I quit last weekend league at 8-14. I’m just trash at the game.', 'Decisive FIFA': "I'm sorry to burst your bubble nep but I used lloris and he was really really bad. I hope the same doesnt happen to you and I hope the new goal keeper patch fixes the mistakes they made", 'The Very Best': "Im the oppersite of Nep. I don't play the best when I don't have any pressure However I play much better if I play with some pressure. Love the vids Nep", 'Jeffrey Vu': 'Get Oscar', 'Remy Vullers': 'Hi Nep, i was wondering as to what audience that EA base FUT on. Do they create the game for like the young players who\'ll have more time to play, or do they keep in mind that there are also a bunch of "older" players who dont have time to play as much. I like the game and i have a really good team as well. But sometimes i feel like i\'m being forced to literally grind out the game to be able to do certain sbc\'s or even get into the WL. Apart from that i think its a huge addition for players like me that WL points now stack up so i dont have to create time to play entry tournaments, im happy to play WL every 2 - 3 weeks. Love the vids and continue the good work.', 'Andrew Higgins': 'Feel as though i have a lot of the same problems when playing badly under pressure i usually start weekend league 7,8,9 and 0 then i start to feel the pressure also feel fut champs is more frustrating this year as i feel match making is more accurate so the games i am losing i feel like i really should have won . In like 140 games i have honestly been well beating 5 or 6 Times the rest i feel i could of won. And im only getting gold 1 finishes. Bit of a long winded rant . Keep up the great content neppo loving the series', 'That Guy': 'Renato', 'Kevin Broad': 'Hi nep do u believe in loan players in fut champs', 'Football Emporer': 'Great Lloris pickup, put a chem style to boost his kicking as its too low', 'HaZy MaZy': '0:03 jazz hands\n0:17 screamer walkot\nI hope this is helpful. :)', 'TeCh KiwizZz': 'Hey nep I’m a gold 3 fut champs player and want to get better at fifa and I try to look for things in other players that I play who are better then me but I struggle to find things i was wondering if there was a noticeable difference that you find between lower tier players and high tier players or what things I should look more closely at when playing better opponents', 'Muhamed Zulic': 'I got scream mandzukic in my pre order pack get in 200k', 'Freddie1093': 'Nep are there still monthly rewards becuase I wasn’t sure if the weekly red informs replaced them. Keep up the good work love the vids.', 'squelching': 'Nep, i pre ordered the ultimate edition, got my 2 packs then found out my pre order was cancelled. I bough the standard edition instead and put £20 fifa points on. To my surprise, the following Monday i got 3 pre order packs, would like to see what you think?', 'Abdullah .Chatah': 'Hey neppo if you’re buying players for SBCs aren’t you basically buying the player given at the end of the SBC?', 'Ross HD': 'Hey nep do you invest in any cards?\n\n\n\n\nBtw keep up the good work❤️', 'joumarques': 'Nep what tactics do you use and changes do you make in formation/play style during games?', 'Bobby Dempsey': 'oscar , he is basically god i bring him on as a super sub he is better than a supersub though he is a god-tier substitute', 'long leg 123': 'Hi nep. I love this game at the moment and im playing it more than ever. However, i feel like the OTW promo and the start of the scream promo show EA dont care. They havent done guarentees and no SBC on the starting day of scream and just feels like a lack of efforg. Hope you read this in the video carry on with the grate content', 'Kyle Sheahan': 'I wonder if your division rivals rank has anything to do with the match making in fut champs', 'TPG RealTime': 'I have that screamer as well', 'Ivuch': '12:55 huge walkout', 'Reece Alexander': 'The English nick28t up the english', 'Kie Kelly': 'Nobody else see his keeper jus move out the way of the goal\n😂🤷🏻‍♂️', 'Danny': 'Nup sep gou yood?', 'Felix Hahahha': 'Do you think i should build my squad around ucl umtiti? I have untradeable aguero aswell', 'harry knights': 'Hey nep I was wondering would you ever start steaming on YouTube? Love the vids✌️', 'Claytonatorrr': 'Neppo I need your help, for some reason I’m just no where near as good as I was at Fifa last year as I was a division 1 player in Fifa 18 and now this fifa my record is negative and I’m struggling to figure the game out is there any tips you would give', 'Cian Dowling': 'Could you unblock me on Twitter Nep, You said you would 2 weeks ago on your stream but i guess you forgot. @Fish_Collopy is the account. Keep up the good Vids love your content GG.', 'RMI _96': "I think that Oscar is the better player. His dribbling and shooting is good and his passing is phenomenal which could make him a fantastic CAM/CF. Renato Augusto is more balanced, but I think there are too many similar players to him, for example Paulinho. So I'm getting Oscar, but it depends on what type of player you prefer.", 'Steve dabson': 'how do you get fitness on your players? love the videos, keep up the good work', 'Anthony V': 'Oscar'}{'Gamer Pro': "This comment won't get no likes", 'waleed mahamad': 'Who’s here from epi 1 like meeee', 'Andrew Carson': 'Get Oscar', 'jackane de jonge': 'Depay and thauvin are sick,specialy Depay [SBS]', 'edward boland': 'Comment', 'ProGamer99': 'I dont think you need another cam so renato augusto would be a good defensive super sub', 'Dylan 07': 'yo nep love the content, i was wondering why u went from twitch to facebook for stream', 'Sean Hoyte': 'Why does his keeper keep wandering out the net?', 'sns 101': 'All this game is, is crosses and fineness shots it’s kinda boring', 'Braydon Salzman': 'Are you going to play a fut champs on your main account anytime soon? Much love nep', 'Gard Gjærviken': 'Your shots are from so weird angels, but they actually work!', 'Mixer': 'What do you think about the past qualifiers that took place? Friends of mine had to play against Europeans and people from the Middle East (I am from South Africa). It made for very poor gameplay which ended up being unfair for both parties', 'Hgbnnj Yyujbv': 'How do you do that dribbling from foot to foot with sane at 2:28 anyone ?', 'UA V': 'Would you consider doing icon sbc in the future if you packed a low tier icon', 'Inspirational Harambe': 'I complete both Renato & Oscar as using a CSL team. I would recommend Oscar as regular Paulinho felt very similar to Renato but only cost 10k.', 'That Guy': 'Why don’t you use a different teams every week (like that verratti)and the day before fut champs you use the core team to get use to them again?? Please?!?!?', 'Harry Blackburn': 'Hi nep. Quick question. How do you do that quick side dribble thing that you did a lot in the first game of the episode. Love you man', 'Owen Thornley': 'Referring to the draft to glory do you think you should be able to pick you’re rewards like you can for div rivals to avoid getting frustrated when you get the pack you don’t desire, I think this should especially be valid for draft wins but maybe not for the first 3 rounds', 'draperlfc': "I have played 2 WL's now and I'd say about 90% of those teams have been higher rated than mine. I know mine isn't massively high at 83 or so but I still found that most opponents squads would be better  regardless of current form", 'Elliott Scott': "I'd say Renato is the more interesting player out of the two Nep, Love the vids <3", 'Donut X': '4:38 goalkeeper ?', 'Jacob Dodds': 'in regards to team rating, i have had similar instances of note: i have a decent coin stack (roughly 1.5m) and i recently noticed that i RARELY come across icons in my opponents squad. sometimes i make 100k-200k teams to have fun with when i think market prices might fluctuate and i like my "assets" to be in coins over players. but recently i have been using all my coins in my team, including one icon. and now i have come across icons, super players (90+ rating, suarez, messi, neymar, etc) i wouldn\'t doubt if your caliber of player effects your opponents in like. love the videos, keep it up nep.', 'Omar Ahmed': 'Wtf is adan doing every single video ! 4:37', 'Dwight Hindle': 'Oscar', 'Jacob Powell': 'What is the skill move that Nep does where the player shifts the ball from one foot to the other?', 'Nathaniel Lockwood': 'Hey Nep, I’m loving the rtg this year. Do you think this years FUT champs is easier compared to last year due to  the qualifying process changing. I played my first weekend and finished 18-4 (Didn’t have time to finish) last year I would scrape 20-20 not sure if it’s lower stress with 30 games or my play style suits the new game. Keep up the sick vids', 'ITz TRICKY': 'I don’t understand how people can play this game so much, I play about 5 matches and want to smash everything around me', 'Jamqs S': 'Wagwan Nep, \nI am currently in Div 4 in Rivals with an Rating of ~1850, I have the real possibility of going to Div 3, but due to the rewards, I don’t want to go to Div 3, but at the same time I want to progress through the divisions to play harder opponents and get better. What would you recommend?', 'Jack Molloy': 'Hey nep, to make the series a bit easier from your fut rivals rewards take the coins and then buy players using them coins. Love the content keep up the good work :)', 'Fino Does': 'Best pre-order pack I got was Miranda, woo', 'Hi Im Feli': 'Renato Augusto is sick', 'Adharsh .S': 'Please unblock me in Twitter- @cricadharsh', 'Robertplaysfifa': 'So he packed Fabinho, not watched it yet', 'Devon Campbell': 'Heyyyy, New Channel icon', 'Mainani 1': "Hey nep , great video as always . I really need your help with something . I use 4-1-2-1-2 second variation and I have inform talisca and coman ( super sub ) at cam and whenever I'm on defense they both drop down to either cb or rb and I end up having to counter attack with fernandinio . Is it a glitch , can I do anything to fix it ? Thank you for your great contect and best wishes to the family .", 'Adicd': 'hey nep, i dont understand why you arent doing marco reus sbc he is a insane card and it wont cost you much cause you already have high rated players in your club.', 'Max Marsh': 'I won the first round of the draft on penalties and got disconnected straight after and the game disconnected, what do I do?', 'Jack Carman': '12:45', 'Callum Chase': 'Why dont you stream on youtube', 'Cameron Mcgregor': "Didn't you get rid of Vertongen?", 'Liam Challoner': 'Through these weekend leagues I’ve had a 186/187 rated team and only come against 3/4 super teams in which i won they had pele etc. I finished gold 1. If that helps in thinking of team rating having an effect on matchmaking', 'TheSmellyGhost': 'Pick Oscar', 'Darragh Flynn': 'Hi nep do you think that squad battles is worth playing love the vids keep up the good work', 'ArsenalBowler': "Hey Nep, in my opinion the sports psychologist idea is a really good one. Majority of people don't take eSports serious enough to realize that a psychologist can play an essential part to playing consistently at a very high level and being able to consistently handle the pressure situations we're put under.\n\nI'm in the National Team in my country for the sport I play (Bowling) and used to be afraid of the psychologists, as if I was crazy to see one or something. However, I started seeing a Sports Psychologist 2 years ago as I advanced from the youth to adult level and found so much clarity in the understanding of my own mental psyche, and how to control it to respond appropriately to pressure situations. \n\nI later used these experiences from seeing the Sports Psychologist into my eSports career as well, captaining a team of nobodies into finishing 4th in a gaming league out of 24th, an achievement considering no one gave us a chance to finish out of the bottom 5. Hope you actually go on to seeing a Sports Psychologist because it would clearly help you so much and be able to help you relax under pressure while still producing top quality content for us. Keep up the great work Nep!", 'Josh Burgess': '“Follow me on Twitter”, lmao you’ve probably blocked half of the people who watch you.', 'izac dring': 'Nep I think you should be able to buy 1 players a month or something like that dont want to ruin the series just a suggestion', 'Matt Lam': 'Anyone else doing the ucl upgrades? Ive done 15 got 5 boards mata, herrera, glik, fejsa, and ziyech. These ucl packs r trash', 'HEYMiLio Geoffrion': 'I would get Oscar', 'Kxeran': 'Oscar', 'Andre Scholz': 'Do you think it would make sense to quit you first 3 games? Because i got 16-0 last Weekend and my opponents were very good, even though i lost 4 games in a row my opponents were still on a really high level.', 'TheOneAndOnly': '8gb 40mins? What you got, Tesco connection? \U0001f928', 'Alex Gadd': '4:38 wtf?', 'Ben Evison': 'Hey Nep! New to your channel but want to say its sooooooo refreshing to hear someone be so critical of their own gameplay and discuss how they want to improve themselves rather than just blaming the game like everyone else seems to', 'Dragonball438': 'hey man nepenthez hope you and your family are doing good!\nJust wanted to tell you that Ive actually only been watching you since fifa 19 but I realised you´re the fifa youtuber that Ive been missing out since fifa 13 :D wish I knew you back then and watching your videos makes me want to try a first owner RTG like yours in fifa 20 maybe when it comes out :D', 'Harvey Lewis': 'Rating matchmaking can’t be a thing cos I use a full Portsmouth squad when I’m bored and it’s 166 overall and I game up against a 187 2 times in a row', 'Tom 4444': 'I’m the same as the guy you mention at 17:00. I played my first and only weekend league this week and just got gold 1. My front three are promes cl Rodrigo and dembele and I didn’t face any real superteams until my last 5-10 games. I think rating may be a part of matchmaking IMO I don’t think it would effect the skill of opponent that much', 'David Peacock': "Team rating is definitely NOT accounted for in WL. However, it should. I had a 182 team and 90% of the teams I played were 186+ and it's so frustrating because Neymar or Suarez will score a ridiculous goal that my players could never do. I can beat those teams if the player is awful but if they're on my level or better then I can never win. It really puts me off playing the game.", 'ActiveSubscriber017864259992': 'Hey Nep can you do a mini review on Renato Augusto for all the people thinking about getting him?', 'Jonathan benton': "Hey Nep, isn't it funny how you will only get one 15k pack per week and you still will have more coins overall from the preorder packs than most people with 2 because of that verratti. Anyway, what a pull and keep up the great content.", 'Cole Amuzu': "If you aren't sure if you wan't to go to full normal rtg. You could do it in a fantasy football format where you get to buy one player after every weekend league to try and improve your squad slowly overtime.", 'Thomas Mitchell': "Hey Nep, love the RTG series, watching you play has improved my game so much. Maybe try celebrating the good goals you score more, as well as other things you do well to take the pressure off? I'm very self critical and you seem it as well, and sometimes just enjoying playing and focusing on that helps you play better. There's a time for both (analysing and enjoying). Respect your grind 🙏", 'hakim belbaraka': 'too much skills for my taste. just my opinion.', 'CC77gaming': 'Packed Shaqiri and UCL sane today so happy', 'ollie k': 'I think the champions league packs are dreadful well for me they are do u think there worth it?', 'Alex Sher': 'I agree with the comment in this video. I have a 250k team and finished 11-5 in weekend league, not once matching anyone with an icon and very few teams over a million coins. Possibly just worse players having worse teams or maybe there is some sort of rating matching on champs. Love to see you test this out in the future, good luck to the rtg, love you mate.', 'JanickR8': 'wow great pre order pack!', 'James Fleming': 'Hey nep I really hope you do some ucl upgrades I did 5 and got 4 walkouts and I think it will be a really good way to improve your account and get players to go in your team also keep up the great work', 'Sachin Naidoo': 'Why dont you stream on youtube', 'Mikkaeel Khan': 'Hey Nep👋\nI vouch for the guy that said that his team is no where near the level of yours, and he did not come up against any players near as good as yours.\nThe same goes for my team, my best players being UCL Sane and Douglas Costa, yet I rarely come up against teams of the caliber you are coming up against, I also have come Elite 3 twice this year now, so similar placements to you.\nAll the best -Mikkaeel', 'jonathan vickers': 'Parss', 'Sean Campbell': 'Oscar looks much better. Put a Maestro on him on Futbin and he’s a 92 CAM. Dribbling, passing and shooting are all great', 'Harry Priddle': "I'm guessing fabinho", 'DBon7': "Nep I will be direct in this comment. My AI doesn't defend for its life and my opponents always score when I try AI defending, I always feel like their AI just defends better than mine, I don't know why and don't know how to fix it, What you think is my problem here?", 'James': "Glad you seen my comment listening back I also meant I didn't come up against teams as good as yours or your opponents", 'John Clarke': "I said ages ago.... don't worry because you are guna pack Lloris soon. Cheers EA. Haha. I knew it", 'lewisss': 'loving the videos nep, been watching you for years and still love your content, plus your pack luck is insane! keep it up bro', 'V S': 'Has the sock question been answered?', 'Riot Gamer': 'I got Suarez from mine', 'V Roić': 'Change the club badge❤', 'Americans are fucking stupid, arrogant cunts': 'Hey nep, keep up the great work but I just want to get your thoughts on Kurt being banned and your opinions about want he said, like so nep can see', 'joshyviner888_': 'if assisted passing is what is causing misplaced passes, would you ever try manual passing? surely that would fix it, or would it make passes worse?', 'Ethan Gomme': 'love you nep love the vids favourite fifa player so inspirational kepp it up', 'Kian Dale': 'Hey nep I was wondering if u could do a bonus upload or a normal upload of your best game of the week and show the full game like yesterday’s video. Keep up the great work and vids', 'alan r': 'nothing to do with fifa but how long it take to grow your hair like that ??', 'Mike Bentham': 'oscar', 'SOLO SALAR': 'Bro i love these ucl packs i got alex Sandro', 'Reece matthews': 'Does anyone else feel like there are half’s where ea “favour” you over your opponent?', 'fivety pence': 'You traded in Vertongan', 'crbuke': "This is the best RTG on Youtube and it's not even close.", 'Brandon Price': 'Hey Nep , I’m looking forward to them patching bicicle kicks as it would make the game more realistic , considering we very rarely see them scored in real life.\nI’m loving the series and keep up the hard work', 'Kodi Byrne': "hey nep im a huge fan been watching since fifa 13. i was just wondering if anyone agrred with my problem with the price of packs in this game. for example , a 50k pack gives 12 rare gold players so 2 x 50k pack is the same as a 100k pack which is fine. but a 45k pack gives 12 gold players and only 6 rares for just 5k less than a 50k pack which to me is just illogical because 2 x 45k packs is the same as 1 x 50k pack + 1 gold players pack which is 12.5k because a gold players pack is 12 gold players 1 rare + the 12 rares of a 50k pack. what im saying is why should we have to pay 90k for 2 x 45k packs when you can get the same for a total value of 62.5k for a 50k +12.5k. Also why is a rare gold pack which is 25k coins or 500 fifa points and a premium gold players pack that is also worth 25k coins or 350 fifa points when they have the same coin value according to ea\n\nJust to add in a mega pack which costs 35k coins or 700 fifa points you have a 4.5% chance of a 87+ rated player and a 1.9% chance of a scream card but in a 45k pack or 600 fifa points you get a 4% chance of a 87+ rated and a 1.8% chance of a scream card it's not a big difference but why is the 45k pack 10k more when it is 100% worse yet the mega pack is more fifa points but less coins\n\ni really hope you see this nep considering this is a first owner road to glory packs are a big part of the series and i think this is a good talking point keep up the great vids nep and i hope your family is good and well\n\nthis formula / theory can be applied to just about every pack type", 'Tudor-Alexandru Șcraba': "Neppo, get Renato Augusto, he is a dirty disguisting OP CM. I score bangers from 35yds with him, he's tall, he has 80 strength, great shooting and passing, perfect for a CM, and decent defending. Trust me...he is a OP CM.", 'Crootdog Gaming': "Hey Neppo I'm not sure how effective form actually is. Towards the end of FIFA 18 I was a gold 1 gold 2 player in Weekend League. This weekend league, (my first Weekend League of FIFA 19) I only just scraped silver 1 in my last game of the Weekend League. I needed 2 wins from 10 to secure silver 1 and only just got it. However at one point I was around the 9-14 record due to a few disconnects, I then came up against 2 top 100 players in my last 5 games. A silver 2 player surely shouldn't be coming up against top 100 players. Would be interested to hear your thoughts on this. Love the content and hope everything is well in your life", 'Reece Games': 'I have 670k should i do hazard potm\nI have already done the chelsea one', 'CHEESEPUFFGLORY': 'Yo Nep I looked at episode 34 from last years RTG and your team is so much better this year even though this is a pack only this year. Keep up the good work.', 'Rasmus Damgaard': 'Hey Nep\nYou might wanna check out the Wim Hof method. It is a breathtaking technique that helps you to control your emotions as well as reducing stress levels. By the way I love your videos!', 'Zak Fowler': 'Sorry but what the hell happnend to the keeper at 4:39 😂😂', 'marian ganchev': 'You used UCL Verthongen in SBC you dumb......'}{'JD Gaming': 'Can you do a custom tactics video please for your 4-1-2-1-2 and 4-1-3-2 formations', 'Raided': 'Hey Nep I wanted to address something said in the last episode. You mentioned that in 2 weeks if you haven’t packed a proper defende that suits fut champs you would transition into a normal RTG. I think this would ruin a series you have come so far on I propose you buy the defenders and then continue pack only. I just don’t want something ruined love the vids and keep up the great work Nep', 'Paul Cook': "Huge?  He's only 5'5”\n😉", 'Uncl3nched': 'I’d like to ask, do we still get the pass where, say, you have the ball and there are 2 players forward but one is offside, the ball still gets passed to the offside player?\n\nAlso, offside, one of your players is in an offside position from a previous play. The ball then gets passed back by the opponent and you intercept, hence shouldn’t be offside but in Fifa does it still count as offside? Because it used to.', 'Drew Jeffery': 'Anybody think it’s too easy to get these UCL cards everyone’s gonna have super teams just like neps', 'Elliot Marsh': 'Hi Nep, do you think ea should have an upgrade sbc for unwanted champions league cards?', 'Foul Dragon': 'Why do you discard healing cards?', 'Param Hirani': 'Well fifa is messed. I did about 10-15 UCL packs didn’t get one board. Then I had some coins and just wanted see who I can get from the packs, I bought 2 mega packs and got no board shit players. I haven’t even got one walkout yet and I have opened so many packs. I done lots of SBCs and can’t get anyone. I haven’t spent money on the games. It’s just stupid.', 'sport for life': 'hey nep\n i acheived gold 2 for the first time ever in fifa, i have mastered the timed finess shot but i was wondering how u are so easily able ti smack your shots in top coner just wondering would help my game alot\nkeep up the good work will always support you', 'James Mernagh': 'How many fut swap tokens have been available so far?', 'Kyle Taylor': 'I took oscar. He is average', 'Lindsay Van Gusling': "Hey neppo, don't you think it's crazy how you got viewers around the world. I'm personally from South and have been watching you since 2015👍 keep up the great work", 'ZaddyWill': 'Do you stream on Facebook? And if so how come ?', 'Mika Schäfer': 'Now he is missing his verthongen', 'Altjos': "You're account is rigged", 'Jack Docherty': 'Plz choose Oscar nep 1 of my favourite players in football and love to see him in a future team', 'Marco Cortes': 'i got pepe on a two player pack pretty dope', 'Arjan Bijral': "On the discussion on team rating affecting matchmaking, I have an 81 rated team with my best players being son and red if King. I came against lots of teams with icons, ronaldo, Messi and mega teams. I went 11-17 and last week I went 8-20. I am not a great player or even a decent player but I don't see how while I'm negative 15 I can still come across mega squads who beat me convincingly. Thoughts would be appreciated.", 'Josh 1013': 'How have you packed UCL bale!!!', 'BABYFACE0895': "Hey Nep, first let me say im a huge fan, been with you since fifa 14, and thanks to you I've improved my gameplay so much. My qs is, I've seen in your last few episodes especially today's, that you try and guess where your opponent will shoot by moving your goalkeeper, and majority of those times you've left an open goal to concede. Just wondering do you actually think moving your goalkeeper works or is it best to play it safe and let the keeper save shots normally?", 'Troy Davies': 'I got a walkout earlier today got excited until I saw it was scream ochoa', 'Mellberg 19': 'USE KIMPEMBE!!!!', 'James Fuller': "As a solution to some players becoming extinct on the market during certain sbcs, I think that every player should be able to be purchased directly from an EA catalogue in game at all times for either their maximum price range price or a little over... For example if a player's price range is 2,000 to 35,000 coins, you should be able to buy that player from a catalogue for 40,000 coins. This would not affect the transfer market at all but prevent players from ever becoming extinct.", 'Adam Verdensmesteren': 'Great video!', 'That Guy Games': 'Hey nep!\nWhat is your favourite colour?', 'John Southam': 'Get depay', 'Daragh Foy': "Only started watching your videos again and wow I'm addicted lol watched you back when ksi and you where pals but keep it up man really love the feeling of waiting on a YouTuber to upload again and you've done that cheers man !!", 'Anthony_ _': "I think it's fair to say nep is in the conversation for greatest FIFA YouTuber of all time", 'Karl Savage': "Hi Nep, I've been doing some of the UCL upgrade CBCs and haven't had very much luck, was wondering if you think it's worth continuing trying to do them, also love the vids keep up the good work. This question also goes out to everyone, wanna hear peoples opinions.", 'Cameron Connor': 'Can anyone help me, is there a new no loss glitch I’ve been playing rivals and when I’ve went in front my opponents have paused it and it’s froze for about 10 seconds then I get kicked off fut, when trying to go back on it says there’s an error downloading current squad updates but I’ve already downloaded them, my internets fine during this', 'Jorge Peacock': "dont think I've ever been so committed to a series on youtube, thanks nep the community loves you <3", 'LedZepFAN': '12:43 walkout', 'ss 22': 'nep is the goat', 'Mohammed Brais': 'Am I the only one that thinks ea should let u choose both the 90 stats on ur scream card And be able to change it whenever u want?', 'Osmail Ali': 'Nep, 20 ucl packs on your fortg acc? Could get some sick upgrades!', 'Louis Hayes': 'Hey nep when you are defending do you ever use second player jockey or should you stay far from it?', 'HNorcross': '0:09', 'harry Baxter': 'Very poor video', 'Noah Lovell': 'Is it viable/practical to switch between defending/balanced/attack etc. as possesion changes in a game? Basically defending in one formation and then once winning the ball back swithcing to a different formation to attack in.', 'Badou Me': 'Happy for you man', 'NOT ME': 'Hi', 'Andrei Dochia': 'What stadium is this pls?', 'Danjal Poulsen': 'Always liking the vid before it starts', 'ross eade': 'Nep ur pack luck is dumb', 'Tesco is Cool': 'How does this vid have 48 views but 118 likes?', 'Ivaylo Vasilev': 'What do you think of Stoichkov.\nAgree if he is OP', 'Sha Thine': 'LUKAKU OUT he cost us the match', 'Josh Woodward': 'Lol Pamphlet dude is 30s like me', 'EmAyEx45': 'How are your packs so good wtf?', 'ibrahim malik': "Hey nep thanks for everything you've shared and thought us. I wanted to ask if you think this week is it best to take the untradeable sb rewards. Becuase even if u get worse packs you can still do the ucl sbcs. Wanted to know your opinion. Again thanks keep up the good work", 'Aadil Mohmed': '40th', 'Hugo Rake': 'whotsop goys nepenthas heare', 'Pierce Morgan': 'Bro ur the best', 'Jack Savage': 'Nice CDM neppo...', 'DCM': 'Neppo baby', 'Philip Lyons': 'Are you going to get depay?', 'LHS FILMS': 'Love the new profile pic', 'Jk Jack': 'Hi', 'Ulrik Rime Aavik': 'sap', 'Theo Whittaker': 'Second', 'juggernaut.strength': 'Yes', 'Matthew Marinella': 'Yett', 'David skills': 'First'}{'JD Gaming': 'Can you do a custom tactics video please for your 4-1-2-1-2 and 4-1-3-2 formations', 'Raided': 'Hey Nep I wanted to address something said in the last episode. You mentioned that in 2 weeks if you haven’t packed a proper defende that suits fut champs you would transition into a normal RTG. I think this would ruin a series you have come so far on I propose you buy the defenders and then continue pack only. I just don’t want something ruined love the vids and keep up the great work Nep', 'Paul Cook': "Huge?  He's only 5'5”\n😉", 'Uncl3nched': 'I’d like to ask, do we still get the pass where, say, you have the ball and there are 2 players forward but one is offside, the ball still gets passed to the offside player?\n\nAlso, offside, one of your players is in an offside position from a previous play. The ball then gets passed back by the opponent and you intercept, hence shouldn’t be offside but in Fifa does it still count as offside? Because it used to.', 'Drew Jeffery': 'Anybody think it’s too easy to get these UCL cards everyone’s gonna have super teams just like neps', 'Elliot Marsh': 'Hi Nep, do you think ea should have an upgrade sbc for unwanted champions league cards?', 'Foul Dragon': 'Why do you discard healing cards?', 'Param Hirani': 'Well fifa is messed. I did about 10-15 UCL packs didn’t get one board. Then I had some coins and just wanted see who I can get from the packs, I bought 2 mega packs and got no board shit players. I haven’t even got one walkout yet and I have opened so many packs. I done lots of SBCs and can’t get anyone. I haven’t spent money on the games. It’s just stupid.', 'sport for life': 'hey nep\n i acheived gold 2 for the first time ever in fifa, i have mastered the timed finess shot but i was wondering how u are so easily able ti smack your shots in top coner just wondering would help my game alot\nkeep up the good work will always support you', 'James Mernagh': 'How many fut swap tokens have been available so far?', 'Kyle Taylor': 'I took oscar. He is average', 'Lindsay Van Gusling': "Hey neppo, don't you think it's crazy how you got viewers around the world. I'm personally from South and have been watching you since 2015👍 keep up the great work", 'ZaddyWill': 'Do you stream on Facebook? And if so how come ?', 'Mika Schäfer': 'Now he is missing his verthongen', 'Altjos': "You're account is rigged", 'Jack Docherty': 'Plz choose Oscar nep 1 of my favourite players in football and love to see him in a future team', 'Marco Cortes': 'i got pepe on a two player pack pretty dope', 'Arjan Bijral': "On the discussion on team rating affecting matchmaking, I have an 81 rated team with my best players being son and red if King. I came against lots of teams with icons, ronaldo, Messi and mega teams. I went 11-17 and last week I went 8-20. I am not a great player or even a decent player but I don't see how while I'm negative 15 I can still come across mega squads who beat me convincingly. Thoughts would be appreciated.", 'Josh 1013': 'How have you packed UCL bale!!!', 'BABYFACE0895': "Hey Nep, first let me say im a huge fan, been with you since fifa 14, and thanks to you I've improved my gameplay so much. My qs is, I've seen in your last few episodes especially today's, that you try and guess where your opponent will shoot by moving your goalkeeper, and majority of those times you've left an open goal to concede. Just wondering do you actually think moving your goalkeeper works or is it best to play it safe and let the keeper save shots normally?", 'Troy Davies': 'I got a walkout earlier today got excited until I saw it was scream ochoa', 'Mellberg 19': 'USE KIMPEMBE!!!!', 'James Fuller': "As a solution to some players becoming extinct on the market during certain sbcs, I think that every player should be able to be purchased directly from an EA catalogue in game at all times for either their maximum price range price or a little over... For example if a player's price range is 2,000 to 35,000 coins, you should be able to buy that player from a catalogue for 40,000 coins. This would not affect the transfer market at all but prevent players from ever becoming extinct.", 'Adam Verdensmesteren': 'Great video!', 'That Guy Games': 'Hey nep!\nWhat is your favourite colour?', 'John Southam': 'Get depay', 'Daragh Foy': "Only started watching your videos again and wow I'm addicted lol watched you back when ksi and you where pals but keep it up man really love the feeling of waiting on a YouTuber to upload again and you've done that cheers man !!", 'Anthony_ _': "I think it's fair to say nep is in the conversation for greatest FIFA YouTuber of all time", 'Karl Savage': "Hi Nep, I've been doing some of the UCL upgrade CBCs and haven't had very much luck, was wondering if you think it's worth continuing trying to do them, also love the vids keep up the good work. This question also goes out to everyone, wanna hear peoples opinions.", 'Cameron Connor': 'Can anyone help me, is there a new no loss glitch I’ve been playing rivals and when I’ve went in front my opponents have paused it and it’s froze for about 10 seconds then I get kicked off fut, when trying to go back on it says there’s an error downloading current squad updates but I’ve already downloaded them, my internets fine during this', 'Jorge Peacock': "dont think I've ever been so committed to a series on youtube, thanks nep the community loves you <3", 'LedZepFAN': '12:43 walkout', 'ss 22': 'nep is the goat', 'Mohammed Brais': 'Am I the only one that thinks ea should let u choose both the 90 stats on ur scream card And be able to change it whenever u want?', 'Osmail Ali': 'Nep, 20 ucl packs on your fortg acc? Could get some sick upgrades!', 'Louis Hayes': 'Hey nep when you are defending do you ever use second player jockey or should you stay far from it?', 'HNorcross': '0:09', 'harry Baxter': 'Very poor video', 'Noah Lovell': 'Is it viable/practical to switch between defending/balanced/attack etc. as possesion changes in a game? Basically defending in one formation and then once winning the ball back swithcing to a different formation to attack in.', 'Badou Me': 'Happy for you man', 'NOT ME': 'Hi', 'Andrei Dochia': 'What stadium is this pls?', 'Danjal Poulsen': 'Always liking the vid before it starts', 'ross eade': 'Nep ur pack luck is dumb', 'Tesco is Cool': 'How does this vid have 48 views but 118 likes?', 'Ivaylo Vasilev': 'What do you think of Stoichkov.\nAgree if he is OP', 'Sha Thine': 'LUKAKU OUT he cost us the match', 'Josh Woodward': 'Lol Pamphlet dude is 30s like me', 'EmAyEx45': 'How are your packs so good wtf?', 'ibrahim malik': "Hey nep thanks for everything you've shared and thought us. I wanted to ask if you think this week is it best to take the untradeable sb rewards. Becuase even if u get worse packs you can still do the ucl sbcs. Wanted to know your opinion. Again thanks keep up the good work", 'Aadil Mohmed': '40th', 'Hugo Rake': 'whotsop goys nepenthas heare', 'Pierce Morgan': 'Bro ur the best', 'Jack Savage': 'Nice CDM neppo...', 'DCM': 'Neppo baby'}