{'huyton traveller': "I can't imagine my grandad being very impressed he was all for forgiving but just couldn't forgive the Japanese which was his own choice", 'Alika Cripe': 'NIPPON BANZAI!', 'Andrew Ngo': "Japan just a puppet, been like that after world war 2 and before that even the emperor of Japan wasn't the true ruler and had very little control to stop the war and the barbaric behavior of the Japanese military", 'The Doc': "couldn't you have gotten a translator to ask questions to the locals? seriously, its like asking people in the UK to speak Spanish  for an interview, your answers aren't going to be clear.", 'Edgy Cat': 'Banzaiiiiiiiiii', 'Sezar Dd': 'It seems to me that the time has come for the United States to pull out of Japan and let Japan decide for itself. I think we all know that the greatest danger to any country is the United States itself. Why ? Because America is always thinking of its own interests, rather than the rest.', 'tamago tamago': '日英同盟か懐かしいのう\n日英共にロシアを倒したあの頃が', 'aclock2': 'Having foreign armies stay permanently in your land is the sign of being a little bitch. They could overthrow your Government in a matter of hours if they felt like it. So every political decision you make with them, you have to make with the mindset that they have an army in your land.', '北山怜央': '富国強兵や', 'h s': '自衛隊がL85を借りてる☆', "Team Magma's Maxie": 'Though they are Philippines lol', 'Andy D': 'The Japanese are racists!! LOL 2:39', 'Samuel Gurung': 'British army have gurkhas', 'joe8075': 'UK wants another Asian operational enclave for the Ghurka Brigade.', 'indeed': 'ah... Australia also does exercises with Japan...', 'Successful heart': 'Tell me that you guys are making a military base in Japan?', 'World President Putin': 'Operation Manga schoolgirl.', 'atsp18': 'Anglo-Japanese Alliance again !', 'Pierre S': '3:54 cool shot', 'Steeljaw XXI': 'This is a really good thing. Both the UK and Japan suffer from the same restriction of them being small Island power-houses. While the threats they face will be different, I feel some of the strategies, techniques, and technologies that work for one will work for the other. As neither can amass million personnel armies nor can they supply them for long, having shared and proven tactics for protection will be key for their survival, IMHO.\n\nNot saying both nations need armed forces great enough to become invasive elements to their neighbors, but increasing their defenses against growing threats is not a bad thing.', 'Dueng Design': 'The 2 countries where cars driven on the left side. LOL', 'cheowyong lee': 'british have forgotten how the japanese defeated them!!!', 'Eric Mowrey': 'North Korea could have a military four times the size of Japan but until it has a viable, blue water navy North Korea remains an empty threat. China is the real threat, with ever growing power projection capabilities, including the ever expanding amphibious attack vessel fleet.  If China manages to build two additional aircraft carriers it may signal the beginning of serious concerns.', 'ジョンジョンキムキム': '🇯🇵🤝🇬🇧⚔️🇰🇵', 'ali Al sahhaf': 'I expected something better than this 🤔', 'No Name': 'Satanic governments', 'ForAmerican': 'Make sure they learn how to use the chopstick, and Morning Radio exercise like the Toyota factory.', 'Fuhan Zhou': 'Brats are trying desperately to be relevant', 'Fetaiai Uta': 'Still waiting for Japan to build Gundams and take over the world.', 'Adam Tib': 'Knights and samurai not a bad combo', 'Daryl Solis': '17:40 *Sergeant Slick Hair Style*', 'The_Satisfied_ EightBall': '17:00, I was at Yokota Airbase doing Track and Field lol.', 'zzzzzsleeping': "When the fights heated up, none of these forces (UK-Japan- france-China-Russia) can match a country that are battle hardened in the jungle or rain forest. And who are they?  Thailand, Vietnam, Indonesia & Philippines. You can have all the bombs you have  but if you don't have boot on the jungle ground you are nothing.", 'オフロスキー': 'サムネの左の人先輩', 'youngsta Young': 'Back to training for traditional warfare conventional warfare. With China/Russia. Matter of time. They need to change to defence chinas building islands that are nothing but military bases. China/Russia are the agressors', 'San Arturo': 'more like British Army trains Japanese Army in English lessons.', 'SENANDUNG SURALAYA MALAYSIA REBORN!': 'Tenno Heika Banzai', 'Cutie Marxist': 'TENNO HEIKA BANZAI!!!!!!!!!!!!!', 'User name': "Where's the giant robot?", 'Hulagu Mongke': "How ironic? In WW2, IJN sunk 22 British warships( unsinkable Hermes, Prince of Wales, Repulse) and 100 American warships(  included best fleet of Lexington, Wasps, Arizona) and massacred allied POW.  And now they're Friendly Nations? or Anglo - Saxon -Norman French simply wants to dominated the global trade, the same way British/ French dominated the Suez Canal in middle east back in the 60's. Used Japanese as a tool.", 'SR71ABCD - BETA TYSON': 'Japan has Godzilla send him to China to stop all this.', 'Simon says:': "Im so happy Japan is starting to expand it's military even with their constitution restrictions.", 'Eri Silvester': 'jajaja jajaja jajaja jajaja you lous', 'Alvin chang': 'Bring back the British-Japanese Alliance! lol', 'I agree': '13:46 おいおい、イギリスの国旗が逆じゃねーか。しっかりしろよ日本。適当だなー。\n「おもてなし」って口で言うのは結構だけど、行動でしっかり示さないと。', 'RmacNet': 'Forces TV videos and Russian Bots go hand in hand.', 'jay dubbs': 'Warmongers', 'Dura Keith': 'Japan-UK alliance 🇯🇵🇬🇧', 'Dr. Conflict': 'This is a good thing. The Japanese are by far the strongest allies in the East!', 'Hertog van Brabant': 'the atomic bomb story is a lie. Part of a perpetual propaganda campaign. They dropped incendiaries on Hiroshima, and not a "nuke". There is no such thing. The nuclear scam\'s purpose is to control the world\'s conflicts through fear, and so far it worked, because everyone believes this pseudo scientific story. The building you see here, on 1:28 would have been completely flattened if this "nuke" was for real, but it isn\'t. People were cleaning up the streets from day 1, like after any normal bomb attack. Scare stories about radiation were spread by media. But no US soldier could identify any kind of radiation in september 1945. Photos of victims show burn wounds, simply because it was a fire bomb attack. If "ground zero" really had become as hot as the sun, as propaganda would make us believe, then streets would have been completely clean and turned into glass, and nothing of the kind ever happened. It was the normal rubble just like after any bombing campaign. World war 3 will be conventional and elites know this. That is why no one of them is afraid of ww3.', 'Leonard Wong': 'Brits are tough! Good to see them in japan!!', 'Brian James Tobia': 'so the knights and samurai unite', 'Birkang Boro': 'Nice', 'james ohara': 'The Japanese soldiers behaviour in WW2 was no accident nor was it natural, they did what they were trained to do, but if you train them to fight with a human conscience then they will behave with true world view honor.', 'Weaver': 'COMPLETELY WRONG ALL THE WAY, JAPAN DOES NOT NEED ANY TRAINING AT ALL.  PERIOD', 'トメコ': 'I love UK as one of Japanese.', 'Tyynymyy': "North-Korea attacking Japan? What a joke, they barely have the means to defend themselves without nuclear missiles. It doesn't matter if the army has googolplex soldiers if they can't be supplied effectively and lack the offensive capabilities. In it's current state North-Korea is not a military threat to anyone at least when it comes to traditional warfare.", 'ArchesBro': 'Japanese people dont know English other than the little grammar they learned in school, why not use a translator because clearly they are having a hard time responding', 'Michael Jon': 'Thanks you United Kingdom!  \nJapanese people would like to build a more effective relationship is thought.\n                        🇬🇧♡🇯🇵', 'Jadran Ahlstrom': "Japan's first treaty with a foreign power, on equal alliance terms, was in 1902 with England in the Anglo-Japanese alliance. It really helped solidify Japan's reputation as a power and it showed the world that Japan joined the world stage and is here to stay. This alliance helped improve the Japanese navy until it became 3rd largest in world by 1920 and also win the 1904-1905 war vs. Russia. The alliance soured during the Versailles peace round and eventually the two nations were on opposite sides in the second world war. Long may the friendship last, old vengeances never forgotten but never allowing them to tie us down in the name of progress.", 'G V': '🇯🇵🤝🇬🇧', 'Nathan Remix': 'Waifu awaiting S.A.S .', 'læzy lozer 2600': "It's stupid the atomic bombs get the blame,pretty sure the firebombing killed more", 'Sean Shultze': 'Train the Brits of how to start a Coup against their Merciless government\nIts not right for a Soldier leaving his own country get abolished by a puppet Regime\nAnd Japan *knows* it', 'Francis Narciso': 'Omg its really happen, code gease', 'Fun Update': 'British Have Gurkha Rifle..\nNever Give UP\nfrom.NEP🇳🇵', 'Daniel Alcantarilla': "Correct me is I'm wrong but did I see Sherman's an M5,s on the Japanese arsenal? I would rub my eyes to see again, Sherman's and M 5,s ?", 'Julian Cate': '22 minutes to talk about 50 British troops who trained a bit in Japan. The idea that this needs a mini-documentary is laughable, but even more laughable is the British military. Not only does the UK lack the will to go to war - regardless of party in charge - but lacks the ability to project military power beyond the white cliffs.', 'Karl Bauer': "Why don't You have an translator ? :)", 'NPC Zombie': 'They should train in Saudi Arabia so that they can receive their orders directly face to face from the house or saud instead of having to open an email from the Muslim council of Britainistan.', 'Clee4000': '2 island nations working together!', 'eng joo': "It's been so long ever since WWII ended but I still don't feel sad for Japan whenever I look into history and saw what the Japanese solider have done in WWII", 'tkt tnk': "Yessssssss!!  I'm Japanese and I Iove UK so much!! \nWe are same island country!\nAnglo Japanese alliance again!!!", 'joe 90': "It's all about the Chinese threat", 'dfpguitar': "there is still a culture of admiration of Hitler & nazi Germany within Japanese government. British govt should be mindful of that. I don't think we should ally with a govt that has taro aso as a minister. Same as other fascist leaders in Phillipines & Burma.", 'DednerxD': '2 nukes = anime', 'unknown': 'Hmm!!  Nice anime.', 'Czecher86': 'well UK = USA....', 'Chris Chen': "I'm surprised that the British still has a military force...", 'brian williams': 'Great to see. As an Aussie would love to see our troops train with the Japanese.  Great people, great country even better allies.  If Japan is attacked by North Korea China etc Our country bloody well better go to their aid.', 'DuckiMucky': '11:56 sounds like something from sponge bob', '200 iq rick and morty fan': 'For queen and country *and anime*', 'Hakuru15': 'UK is gonna appreciate some anime waifus', 'alex H': 'Gate season 3 will be interesting', 'Antarctica': 'Imagine playing COD on that simulator.', 'alberich liu': 'What if Chinese PLA trains in Germany？', 'Above TheCrowd': 'Two evil empires training together, what a coincidence.', 'Travis Lively': 'Welcome to JAPAN!\nWe want second aliance Japan and UK', 'Captain Right': "Yo Japanese soldiers. I know Japanese are an endangered species. With 40% of your population self reporting that they have never dated and about a 3rd having no interest in sex atall. If you want to save your country, you'd better start breeding as much and as fast as you can. A fertility rate of 1.4 is sad.\nIn ww2 America dropped 2 nukes on you because of your uniformity in making a harmfull decision. Now you are nuking yourself in population because of the same uniformity.", 'Bhum Brahmavira': 'For you concerned Japanese out there, don\'t be. \n\nI\'m rather certain that 1: colonialism is dead in the Imperial family, and 2: us Gorkhali drove the point home in 1944.\n\nBe more worried about Xi and his greasy fingers groping the South China Sea.\n\nWhat youse ought to do on your part, is bitch slap some sense into the vocal fascist minority. Accept your past mistakes and allow open discussion. That\'s the only way to prevent this fuck up from repeating itself. Shit, we fucked up too. The turn of the millenia wasn\'t to pretty in Nepal to say the least.\n\nOh well, just as youse are always so willing to throw money at us for our infrastructure, many individuals here are also always willing to "persuade" a few ultranationalists in your crib. Hey, you scratched our back as soon as you got off your arse. I\'m certain many "retirees" in Nepal is more than happy to scratch your ultranationalist ulcer with a metaphorical lance...', 'RR PLAN C': 'Squarhean lady in red presenter', 'Kurt H': 'or in otherwords preparing to defend against a chinese invasion', 'BrighT L0rd': 'All hail brittania, Nippon Banzai', 'Phantim3dx': "why can't us Yanks have nice things like intelligent, coherent, and pragmatic elected officials? Oh that's right we can't have nice things because of the derps in office and those who've made the GOP in place.", 'Chocolat-kun': 'That reporters name... HOW DO YOU PRONOUNCE IT?!?!!?', 'Adam Scott': '1488', 'Michael Allen': 'All leave boys your government is against you nothing worth defending'}{'Piper': 'Japan did alot of evil things in the war never forget those jap bastards', 'Shaurya Joshi': 'They should be training to fight extremists on their streets.\n\nSigh..the UK is a dying country.', 'ShAdOwMaN': 'Nice!', 'Dr Wellington': 'Teno hekia banzai', '富澤そら': 'thank you 🇬🇧\nありがとう！新しい日英の始まりだ(*ﾟ▽ﾟ*)', 'Lord Butthole': 'Welcome to the Jungle :)', 'dan forbes': 'i think not', 'Clutch': 'One thing that was missed when the USAF Col. answered "Why does the US have a presence here?" is the fact that the JSDF was never designed to stand alone. From the beginning it was designed to be a defensive buffer to last long enough for US/coalition forces to relieve them.', 'Kai Kawano': '13:40 "this matters" beautiful Queens English.   \nWe welcome all British Forces and Gordon Ramsay.\ni love how Ramsay talk shit to american food', 'Matthew Jerousek': 'I love anime.', "FANBOY Lets' Plays": "British forces in Japan? Well that's something interesting", 'no1reallycaresabout2': '2:59 \nThey couldnt bother to hire a translator to interview the Japanese passerby? The sample is less representative of the population if they only interviewed Japanese people who spoke English.\n\nOtherwise, interesting video.', 'Keith Donald': 'Surrender what do me world war twos over', 'Snake Plissken': 'I am sure the British are proud to come to a country where the people comes first ,and not run by politicians that support extremists and sharia law.', 'Views 22T': "if you can't beat them join them", 'Bullet-Catcher': '#IAmSoldierX', 'Rob Bleeker': 'Saying that NK has 1.2 million active soldiers doent mean anything..... We know how out dated their equipment is....', 'Narahiko': 'British Weeaboos c:', 'John Smith': 'Ohhh tommy tommy\n\ntommy tommy tommy tommy\nROBINSON', 'Chen Lee': 'Can’t possibly the first time, the RM were here in Tokyo 2 years ago. Friendly football match but still here as an official invitation.', 'CBRMoto': '#IAmSoldierX', 'Manu De Man': 'about those nukes\nthe people killed were mostly women, children and old people as the men were off fighting\nthe effectiveness was limited as the mostly wooden Japanese cities had been fire bombed already\nmany generals at the time openly challenged the need to use such a weapon\nand the end of the war shortly after had more to do with the Russians about to invade Japan than the nukes being dropped; or maybe the nukes were used because Russia was about to invade', 'Shawn.K': 'STILL no single apologies to those countries suffered from innocent civilian rapes, Slaughters during WW II. Instead, Those apes are building AAS, Marine corps which clearly is a system made for invasion. Who knows? They could hit your 6 just like the old days. LOL.\n\nTraining with them just to make china calm? Funny joke out there :) You pals should’ve done it with ROK. Not with those trying to break their leashes, dreaming their old empire bull s***.', 'rainbowsixODST': 'British Army? What army? All I saw was a bunch of demoralized soldiers forced to serve a Leftish System who cares nothing for them and who can’t even utilize the freedoms they defend. Japan’s soldiers are more free and open than Britain’s! I support soldierX', 'Gaz 00': '#IAmSoldierX', 'Kelvin Fong': 'Britain helped build the imperial Japanese navy. It’s earliest battleships were built in England. \n\nMany Japanese naval officers were trained in England. Their greatest admiral, Togo was trained at Dartmouth.', 'Jackson Brown': 'The army blabs on about standing up against fascists, then decides to expel someone because they express their opinion...irony.', 'The uncomfortable TRUTH': 'The fact of the matter is that the British Army train our brave young men for combat and once our brave young men have been in combat and end up suffering from PTSD they are thrown out of the Army for a life of homelessness and despair !', 'Lucas Tant': 'British Japanese, what a fusion ! Nice', 'Sukacita Yeremia': "Where's Chris Broad?", 'GollyKun': 'I WOULD LOVE TO TRAIN IN JAPAN', 'Templar Knight': 'The MOD are DESTROYING our British armed forces with political correctness. Allowing " crack " dealing soldiers to remain in the army while dismissing those who have the temerity to take a photo with a journalist who is anti Islamic just shows the type of people who are in charge as vile.', 'wcatholic1': 'The Germans have already altered their constitution in order to allow the Bundeswehr to operate beyond German borders, for example in ISAF. The Germans have accepted their role as a major regional power and Japan seems to be doing the same.', 'John Tressine': 'WOW, sending half our front-line troops just for a photo opp, we will soon be back in the big league.', 'StandSure': "Quite interesting to see this, not many people know but the British actually freed the Japanese POWs after the war, armed them and worked with them to help maintain order in Vietnam and other parts of Asia, we've worked with them ever since.", 'chris1117F': "Big deal you grits send three ships a few planes 16 soldiers and one helicopter. That's supposed to be a valuable asset show of force. U.s. has entire 7th fleet in Japan with a full carrier wing and three assualt carriers and a nuclear powered. Carrier and 100 fighter aircraft. And 50,000 army and marines in Japan. Grow up Britain you're not a global power.", 'liam hawkes': 'Japanese s favourite part of an english breakfast are beans hahaha wtf', 'DrPhilFurry': 'OMG?!?!? WHERE IS THE DIVERSITY IN TOKYO AND THE JAPANESE ARMY?', 'Malcom Canning': "wasn't he called the British tommy. ..............shhhhhh robinson", 'mikeymarmalade': "It's a good idea", 'Kabaka Mwanga': 'People around the world should know that once student president museveni of uganda is dead to gone we are going to chase or kick out all foreigners and migrants hiding in uganda and afrika', 'tentheagle': 'Alana Partridge...', 'Mr Camoron': 'The UK should concentrate on its own borders and stop pretending its a global empire poking its nose with its 16 soldiers and 1 helicopter!', 'Zidaric Helena': 'lep pozdrav iz slovenije', 'exactinmidget92': 'Reporters last name tells me that she is a pole. Its just an explosion of letters.', 'Aaron from England': 'Budget needs to be 3%', 'g2macs': "I would be ok with the British Army defending Japan if once just once, the Emperor stood up and apologised for the Burma Railway, Bataan Death march, the murder and torture of POW's...... the list could go on and on.....", 'William Warren': 'north korea has plastic guns', 'tommyguntom32': "Meanwhile I'm china they are secretly making robots to use instead of soldiers", 'Richard Goode': 'A as good luck, as NATO a point to engage or a defence as a engage.', 'Sky Kubo': 'My great grandfather who was a British Gurkha infantry riffle man, fought with the Japanese imperial army in the Burma’s jungle ( now Myanmar) place called impala near India Burma borders ,lost his 3 fingers and also lost left side ear in the WWII. I heard lot about this chilling British Japanese war stories from my grandfather when I was little, super scary stories tho , but hey those stories are history now for me nothing more , but for him it was a bravery , honor and never forgetting 🎌❤️🇬🇧', 'doczg88': 'Expelling UK soldiers over photo with Tommy Robinson?? What about that?', 'DJJAW11': "... Good article. What's your star sign ? 🤔😁", 'Stephen Cockett': "Keep an eye on your toe-nails and finger-nails lads.\nThese blokes used to pull out POW's toe and finger nails for a bit of a laugh during their naafi breaks.", 'Jayden is great': "If you are in North Korea it's mandatory to go to the Army wish is not fun some people don't get to the passingout Parade after doing the set years of Duty 💂💂", 'Daniel Whyatt': "Just 15? That's a little disappointing.", 'nowgaku': 'Glorious Anglo-Japanese Alliance again', '我是兔子王': 'in  fact , japan army  is  stronger  than  weak  British  army .The US Army is in Japan to prevent the Japanese army from being too strong. Americans do not trust the Japanese.hahahao(∩_∩)o 哈哈', 'Toffee Abroad': "I'm surprised the MOD had enough money to fly the British soldiers to Japan. I was in a taxi last year in Singapore and the driver had not long finished his national service. He told me that he had spent a few weeks in the UK on a joint training exercise between the British Army and the Singapore Armed Forces. The exercise was originally supposed to take place in Singapore but the British couldn't afford to send their troops or equipment over.", 'Anthony Roic': 'Train all you want, the brits have never known how to fight a force of equal moral, technology, or military strength. Must I remember what the legendary blackadder once said??', 'MC': 'Sent 15 soldiers ....lol', 'funkylee2010': 'Both countries come from a strong fighting history born fighters welcome to the future', 'Levi Liberow': '#IAMSOLDIERX', 'Tams80': "That question at the press conference was terribly wordy; almost like a speech.  Also, I didn't quite gather, was this training exercise a historic event?", 'dennytenny': "Your Brits, we're keeping an eye on you.  If you and your pal the Japanese are planning to invade North Korea, you better think again.  The USA is ready to defend North Korea against all foreign liberal fascists incursions.  Trump will not allow his best friend Kim to be replaced by liberal fascist South Korean government.", 'mtnmist1': 'Amend the constitution so the Japanese can militarize.  What could possibly go wrong?', 'SixSixteen Sevens': 'Do they get a Hari-Kiri knife?', 'John Ashtone': "Could people please remember it is 70+ years since WWII.  When I was at school a friend's father had been in Burma, he still had nightmares 25 years after, I have never forgotten this.  But times move on, the people today are not their parents or grand-parents, it is not they we are dealing with.  And it is how they behave in the modern world, and not admitting Muslims who wish to blow them up is hardly a sin?  \n\nIn Afghanistan, they were superb, they were there just doing, none military jobs and back up, but still did everything, to the best Japanese standards and reliability, that you would expect from their electronics and cars?\n\nWe are natural allies and were until 1941, and those saying 3 ships and 150 soldiers is nothing, are just showing how silly they are.  No other Nation is as highly regarded by the Japanese, those saying UK is finished and broke are stupid, UK has 5th largest economy, and if we are so broke and finished why are so many people from other Nations so desperate to live here? \n\nBut hey who did let that flag fly as a distress signal at 13:46 lol", 'No Name': 'The MOD is appearing a little fascist lately...', 'bigdmac33': 'Excellent presentation and interview skill on display. Smooth, safe diplomatic responses flowed forth!!', 'Andyb2379': 'All great & everything but we seriously need to look at our own budget. Maybe up our active personal.', 'koolyman': '2:37 weird target', 'me him': "Stop signing up to fight for the traitor governments that have constantly given more and more sovereignty away to EU gastapo! Stop going to middle east training jahidi Muslims who then infiltrate into the European countries and killing kids! It's plain as day they have no bother sacking your life's just for a fucking photo! Wtf? Let them get the new replacement to do the dirty work stop brits dying for these muppets! See how that goes!.....", 'HDaviator': "The Japanese should be careful, the PC could rub off on them. Don't want that.", 'BulletproofKam': "They didn't include the uk reserves! 35,000 active reserves and over 160,000 ex millitary contracted reserves! They included them in the other nations  figures!... Britain has 210,000 millitary personel they could deploy anywere on earth anytime, and the other 160,000+ millitary personel they can call back up if needed....... get your figures right! And the Active Uzk reserves if 35,000 are just as well trained as normal soldiers..l", 'Phil Staples': "Didn't we build them loads of warships and effectively train their navy, then later as a thank you they starved, tortured and worked to death loads of our and our allies soldiers? I can't remember them ever saying sorry for their terrible actions either....", 'mitsuru yamashita': 'To make things absolutely clear, this kind of relation has made almost for China, not North Korea. China is the only one country who has enough power to scare U.K. who is obviously trying to growth some power themselves in Asia, and China is threatening (or doing regular imperial stuff I say) all over the pacific.\n\nU.K. Is also having relation with India (kinda, though.) to being "British" in Asia just like classic British.\n\nSo this seems like big movement but actually is, just Japan and U.K. both are pretty scared of China and trying to scare them as well as possible. \n\nTo cut a long story short, nothing has been changed so far, now both islands countries having a macho friend who were acutely good friends from long time ago.', 'NoahVlogz': 'Great to see', 'TheSnakeGaming': 'UK army has persecuted its Squaddies for having a selfie with Tommy Robinson. Report on that.', 'FUCK THE FLAG': 'Japan is a puppet of America just like Britain.', 'Josh Rigo': 'As if a handful of ours would make a difference. Rubbish.', 'Kemal': 'i thought japan didnt have an army', 'Ernest Lunezi': 'Us uk australia canada new zealand english the best and the most powerful global power just watch out cause germany france and india its going to betray you in a very  shameful way and enemyes are growing now more than ever the west and democratic world it is in danger whith china russia india brasil and ultimately turkey indonesia iran  pakistan and france and germany working whith them for money and puttin in danger everything they built in decades cause english speaker countries did sacrificed a lot for these two countries and especialy for france and betrayed them and for germany literaly fought after the war and free the east germany from russia for the second time that s why you need to increase military budget imediatly. Japan the asian boss bravo UK', 'Zach Okey': "When you do a video about how good Germany's economy is don't mention the war 😉👍🏻 lol", 'Gar': 'I AM SOLIDER X', 'Not a Russian bot': 'Shame the Uk army doesn’t care about its soldiers and panders to extremists', 'Zack 691': 'I thought North Korea has a peace agreement with South , but not with Japan i guess', 'Andrew Johnston': "@ 13:46 why is the flag upside down?  Didn't anyone there notice it?", 'Daley Wilk': 'Since ww2', 'Square Peg Round Hole': '#IAmSoldierX'}{'Piper': 'Japan did alot of evil things in the war never forget those jap bastards', 'Shaurya Joshi': 'They should be training to fight extremists on their streets.\n\nSigh..the UK is a dying country.', 'ShAdOwMaN': 'Nice!', 'Dr Wellington': 'Teno hekia banzai', '富澤そら': 'thank you 🇬🇧\nありがとう！新しい日英の始まりだ(*ﾟ▽ﾟ*)', 'Lord Butthole': 'Welcome to the Jungle :)', 'dan forbes': 'i think not', 'Clutch': 'One thing that was missed when the USAF Col. answered "Why does the US have a presence here?" is the fact that the JSDF was never designed to stand alone. From the beginning it was designed to be a defensive buffer to last long enough for US/coalition forces to relieve them.', 'Kai Kawano': '13:40 "this matters" beautiful Queens English.   \nWe welcome all British Forces and Gordon Ramsay.\ni love how Ramsay talk shit to american food', 'Matthew Jerousek': 'I love anime.', "FANBOY Lets' Plays": "British forces in Japan? Well that's something interesting", 'no1reallycaresabout2': '2:59 \nThey couldnt bother to hire a translator to interview the Japanese passerby? The sample is less representative of the population if they only interviewed Japanese people who spoke English.\n\nOtherwise, interesting video.', 'Keith Donald': 'Surrender what do me world war twos over', 'Snake Plissken': 'I am sure the British are proud to come to a country where the people comes first ,and not run by politicians that support extremists and sharia law.', 'Views 22T': "if you can't beat them join them", 'Bullet-Catcher': '#IAmSoldierX', 'Rob Bleeker': 'Saying that NK has 1.2 million active soldiers doent mean anything..... We know how out dated their equipment is....', 'Narahiko': 'British Weeaboos c:', 'John Smith': 'Ohhh tommy tommy\n\ntommy tommy tommy tommy\nROBINSON', 'Chen Lee': 'Can’t possibly the first time, the RM were here in Tokyo 2 years ago. Friendly football match but still here as an official invitation.', 'CBRMoto': '#IAmSoldierX', 'Manu De Man': 'about those nukes\nthe people killed were mostly women, children and old people as the men were off fighting\nthe effectiveness was limited as the mostly wooden Japanese cities had been fire bombed already\nmany generals at the time openly challenged the need to use such a weapon\nand the end of the war shortly after had more to do with the Russians about to invade Japan than the nukes being dropped; or maybe the nukes were used because Russia was about to invade', 'Shawn.K': 'STILL no single apologies to those countries suffered from innocent civilian rapes, Slaughters during WW II. Instead, Those apes are building AAS, Marine corps which clearly is a system made for invasion. Who knows? They could hit your 6 just like the old days. LOL.\n\nTraining with them just to make china calm? Funny joke out there :) You pals should’ve done it with ROK. Not with those trying to break their leashes, dreaming their old empire bull s***.', 'rainbowsixODST': 'British Army? What army? All I saw was a bunch of demoralized soldiers forced to serve a Leftish System who cares nothing for them and who can’t even utilize the freedoms they defend. Japan’s soldiers are more free and open than Britain’s! I support soldierX', 'Gaz 00': '#IAmSoldierX', 'Kelvin Fong': 'Britain helped build the imperial Japanese navy. It’s earliest battleships were built in England. \n\nMany Japanese naval officers were trained in England. Their greatest admiral, Togo was trained at Dartmouth.', 'Jackson Brown': 'The army blabs on about standing up against fascists, then decides to expel someone because they express their opinion...irony.', 'The uncomfortable TRUTH': 'The fact of the matter is that the British Army train our brave young men for combat and once our brave young men have been in combat and end up suffering from PTSD they are thrown out of the Army for a life of homelessness and despair !', 'Lucas Tant': 'British Japanese, what a fusion ! Nice', 'Sukacita Yeremia': "Where's Chris Broad?", 'GollyKun': 'I WOULD LOVE TO TRAIN IN JAPAN', 'Templar Knight': 'The MOD are DESTROYING our British armed forces with political correctness. Allowing " crack " dealing soldiers to remain in the army while dismissing those who have the temerity to take a photo with a journalist who is anti Islamic just shows the type of people who are in charge as vile.', 'wcatholic1': 'The Germans have already altered their constitution in order to allow the Bundeswehr to operate beyond German borders, for example in ISAF. The Germans have accepted their role as a major regional power and Japan seems to be doing the same.', 'John Tressine': 'WOW, sending half our front-line troops just for a photo opp, we will soon be back in the big league.', 'StandSure': "Quite interesting to see this, not many people know but the British actually freed the Japanese POWs after the war, armed them and worked with them to help maintain order in Vietnam and other parts of Asia, we've worked with them ever since.", 'chris1117F': "Big deal you grits send three ships a few planes 16 soldiers and one helicopter. That's supposed to be a valuable asset show of force. U.s. has entire 7th fleet in Japan with a full carrier wing and three assualt carriers and a nuclear powered. Carrier and 100 fighter aircraft. And 50,000 army and marines in Japan. Grow up Britain you're not a global power.", 'liam hawkes': 'Japanese s favourite part of an english breakfast are beans hahaha wtf', 'DrPhilFurry': 'OMG?!?!? WHERE IS THE DIVERSITY IN TOKYO AND THE JAPANESE ARMY?', 'Malcom Canning': "wasn't he called the British tommy. ..............shhhhhh robinson", 'mikeymarmalade': "It's a good idea", 'Kabaka Mwanga': 'People around the world should know that once student president museveni of uganda is dead to gone we are going to chase or kick out all foreigners and migrants hiding in uganda and afrika', 'tentheagle': 'Alana Partridge...', 'Mr Camoron': 'The UK should concentrate on its own borders and stop pretending its a global empire poking its nose with its 16 soldiers and 1 helicopter!', 'Zidaric Helena': 'lep pozdrav iz slovenije', 'exactinmidget92': 'Reporters last name tells me that she is a pole. Its just an explosion of letters.', 'Aaron from England': 'Budget needs to be 3%', 'g2macs': "I would be ok with the British Army defending Japan if once just once, the Emperor stood up and apologised for the Burma Railway, Bataan Death march, the murder and torture of POW's...... the list could go on and on.....", 'William Warren': 'north korea has plastic guns', 'tommyguntom32': "Meanwhile I'm china they are secretly making robots to use instead of soldiers", 'Richard Goode': 'A as good luck, as NATO a point to engage or a defence as a engage.', 'Sky Kubo': 'My great grandfather who was a British Gurkha infantry riffle man, fought with the Japanese imperial army in the Burma’s jungle ( now Myanmar) place called impala near India Burma borders ,lost his 3 fingers and also lost left side ear in the WWII. I heard lot about this chilling British Japanese war stories from my grandfather when I was little, super scary stories tho , but hey those stories are history now for me nothing more , but for him it was a bravery , honor and never forgetting 🎌❤️🇬🇧', 'doczg88': 'Expelling UK soldiers over photo with Tommy Robinson?? What about that?', 'DJJAW11': "... Good article. What's your star sign ? 🤔😁", 'Stephen Cockett': "Keep an eye on your toe-nails and finger-nails lads.\nThese blokes used to pull out POW's toe and finger nails for a bit of a laugh during their naafi breaks.", 'Jayden is great': "If you are in North Korea it's mandatory to go to the Army wish is not fun some people don't get to the passingout Parade after doing the set years of Duty 💂💂", 'Daniel Whyatt': "Just 15? That's a little disappointing.", 'nowgaku': 'Glorious Anglo-Japanese Alliance again', '我是兔子王': 'in  fact , japan army  is  stronger  than  weak  British  army .The US Army is in Japan to prevent the Japanese army from being too strong. Americans do not trust the Japanese.hahahao(∩_∩)o 哈哈', 'Toffee Abroad': "I'm surprised the MOD had enough money to fly the British soldiers to Japan. I was in a taxi last year in Singapore and the driver had not long finished his national service. He told me that he had spent a few weeks in the UK on a joint training exercise between the British Army and the Singapore Armed Forces. The exercise was originally supposed to take place in Singapore but the British couldn't afford to send their troops or equipment over.", 'Anthony Roic': 'Train all you want, the brits have never known how to fight a force of equal moral, technology, or military strength. Must I remember what the legendary blackadder once said??', 'MC': 'Sent 15 soldiers ....lol', 'funkylee2010': 'Both countries come from a strong fighting history born fighters welcome to the future', 'Levi Liberow': '#IAMSOLDIERX', 'Tams80': "That question at the press conference was terribly wordy; almost like a speech.  Also, I didn't quite gather, was this training exercise a historic event?", 'dennytenny': "Your Brits, we're keeping an eye on you.  If you and your pal the Japanese are planning to invade North Korea, you better think again.  The USA is ready to defend North Korea against all foreign liberal fascists incursions.  Trump will not allow his best friend Kim to be replaced by liberal fascist South Korean government.", 'mtnmist1': 'Amend the constitution so the Japanese can militarize.  What could possibly go wrong?', 'SixSixteen Sevens': 'Do they get a Hari-Kiri knife?', 'John Ashtone': "Could people please remember it is 70+ years since WWII.  When I was at school a friend's father had been in Burma, he still had nightmares 25 years after, I have never forgotten this.  But times move on, the people today are not their parents or grand-parents, it is not they we are dealing with.  And it is how they behave in the modern world, and not admitting Muslims who wish to blow them up is hardly a sin?  \n\nIn Afghanistan, they were superb, they were there just doing, none military jobs and back up, but still did everything, to the best Japanese standards and reliability, that you would expect from their electronics and cars?\n\nWe are natural allies and were until 1941, and those saying 3 ships and 150 soldiers is nothing, are just showing how silly they are.  No other Nation is as highly regarded by the Japanese, those saying UK is finished and broke are stupid, UK has 5th largest economy, and if we are so broke and finished why are so many people from other Nations so desperate to live here? \n\nBut hey who did let that flag fly as a distress signal at 13:46 lol", 'No Name': 'The MOD is appearing a little fascist lately...', 'bigdmac33': 'Excellent presentation and interview skill on display. Smooth, safe diplomatic responses flowed forth!!', 'Andyb2379': 'All great & everything but we seriously need to look at our own budget. Maybe up our active personal.', 'koolyman': '2:37 weird target', 'me him': "Stop signing up to fight for the traitor governments that have constantly given more and more sovereignty away to EU gastapo! Stop going to middle east training jahidi Muslims who then infiltrate into the European countries and killing kids! It's plain as day they have no bother sacking your life's just for a fucking photo! Wtf? Let them get the new replacement to do the dirty work stop brits dying for these muppets! See how that goes!.....", 'HDaviator': "The Japanese should be careful, the PC could rub off on them. Don't want that.", 'BulletproofKam': "They didn't include the uk reserves! 35,000 active reserves and over 160,000 ex millitary contracted reserves! They included them in the other nations  figures!... Britain has 210,000 millitary personel they could deploy anywere on earth anytime, and the other 160,000+ millitary personel they can call back up if needed....... get your figures right! And the Active Uzk reserves if 35,000 are just as well trained as normal soldiers..l", 'Phil Staples': "Didn't we build them loads of warships and effectively train their navy, then later as a thank you they starved, tortured and worked to death loads of our and our allies soldiers? I can't remember them ever saying sorry for their terrible actions either....", 'mitsuru yamashita': 'To make things absolutely clear, this kind of relation has made almost for China, not North Korea. China is the only one country who has enough power to scare U.K. who is obviously trying to growth some power themselves in Asia, and China is threatening (or doing regular imperial stuff I say) all over the pacific.\n\nU.K. Is also having relation with India (kinda, though.) to being "British" in Asia just like classic British.\n\nSo this seems like big movement but actually is, just Japan and U.K. both are pretty scared of China and trying to scare them as well as possible. \n\nTo cut a long story short, nothing has been changed so far, now both islands countries having a macho friend who were acutely good friends from long time ago.', 'NoahVlogz': 'Great to see', 'TheSnakeGaming': 'UK army has persecuted its Squaddies for having a selfie with Tommy Robinson. Report on that.', 'FUCK THE FLAG': 'Japan is a puppet of America just like Britain.', 'Josh Rigo': 'As if a handful of ours would make a difference. Rubbish.', 'Kemal': 'i thought japan didnt have an army', 'Ernest Lunezi': 'Us uk australia canada new zealand english the best and the most powerful global power just watch out cause germany france and india its going to betray you in a very  shameful way and enemyes are growing now more than ever the west and democratic world it is in danger whith china russia india brasil and ultimately turkey indonesia iran  pakistan and france and germany working whith them for money and puttin in danger everything they built in decades cause english speaker countries did sacrificed a lot for these two countries and especialy for france and betrayed them and for germany literaly fought after the war and free the east germany from russia for the second time that s why you need to increase military budget imediatly. Japan the asian boss bravo UK', 'Zach Okey': "When you do a video about how good Germany's economy is don't mention the war 😉👍🏻 lol", 'Gar': 'I AM SOLIDER X', 'Not a Russian bot': 'Shame the Uk army doesn’t care about its soldiers and panders to extremists', 'Zack 691': 'I thought North Korea has a peace agreement with South , but not with Japan i guess', 'Andrew Johnston': "@ 13:46 why is the flag upside down?  Didn't anyone there notice it?", 'Daley Wilk': 'Since ww2', 'Square Peg Round Hole': '#IAmSoldierX'}{'Piper': 'Japan did alot of evil things in the war never forget those jap bastards', 'Shaurya Joshi': 'They should be training to fight extremists on their streets.\n\nSigh..the UK is a dying country.', 'ShAdOwMaN': 'Nice!', 'Dr Wellington': 'Teno hekia banzai', '富澤そら': 'thank you 🇬🇧\nありがとう！新しい日英の始まりだ(*ﾟ▽ﾟ*)', 'Lord Butthole': 'Welcome to the Jungle :)', 'dan forbes': 'i think not', 'Clutch': 'One thing that was missed when the USAF Col. answered "Why does the US have a presence here?" is the fact that the JSDF was never designed to stand alone. From the beginning it was designed to be a defensive buffer to last long enough for US/coalition forces to relieve them.', 'Kai Kawano': '13:40 "this matters" beautiful Queens English.   \nWe welcome all British Forces and Gordon Ramsay.\ni love how Ramsay talk shit to american food', 'Matthew Jerousek': 'I love anime.', "FANBOY Lets' Plays": "British forces in Japan? Well that's something interesting", 'no1reallycaresabout2': '2:59 \nThey couldnt bother to hire a translator to interview the Japanese passerby? The sample is less representative of the population if they only interviewed Japanese people who spoke English.\n\nOtherwise, interesting video.', 'Keith Donald': 'Surrender what do me world war twos over', 'Snake Plissken': 'I am sure the British are proud to come to a country where the people comes first ,and not run by politicians that support extremists and sharia law.', 'Views 22T': "if you can't beat them join them", 'Bullet-Catcher': '#IAmSoldierX', 'Rob Bleeker': 'Saying that NK has 1.2 million active soldiers doent mean anything..... We know how out dated their equipment is....', 'Narahiko': 'British Weeaboos c:', 'John Smith': 'Ohhh tommy tommy\n\ntommy tommy tommy tommy\nROBINSON', 'Chen Lee': 'Can’t possibly the first time, the RM were here in Tokyo 2 years ago. Friendly football match but still here as an official invitation.', 'CBRMoto': '#IAmSoldierX', 'Manu De Man': 'about those nukes\nthe people killed were mostly women, children and old people as the men were off fighting\nthe effectiveness was limited as the mostly wooden Japanese cities had been fire bombed already\nmany generals at the time openly challenged the need to use such a weapon\nand the end of the war shortly after had more to do with the Russians about to invade Japan than the nukes being dropped; or maybe the nukes were used because Russia was about to invade', 'Shawn.K': 'STILL no single apologies to those countries suffered from innocent civilian rapes, Slaughters during WW II. Instead, Those apes are building AAS, Marine corps which clearly is a system made for invasion. Who knows? They could hit your 6 just like the old days. LOL.\n\nTraining with them just to make china calm? Funny joke out there :) You pals should’ve done it with ROK. Not with those trying to break their leashes, dreaming their old empire bull s***.', 'rainbowsixODST': 'British Army? What army? All I saw was a bunch of demoralized soldiers forced to serve a Leftish System who cares nothing for them and who can’t even utilize the freedoms they defend. Japan’s soldiers are more free and open than Britain’s! I support soldierX', 'Gaz 00': '#IAmSoldierX', 'Kelvin Fong': 'Britain helped build the imperial Japanese navy. It’s earliest battleships were built in England. \n\nMany Japanese naval officers were trained in England. Their greatest admiral, Togo was trained at Dartmouth.', 'Jackson Brown': 'The army blabs on about standing up against fascists, then decides to expel someone because they express their opinion...irony.', 'The uncomfortable TRUTH': 'The fact of the matter is that the British Army train our brave young men for combat and once our brave young men have been in combat and end up suffering from PTSD they are thrown out of the Army for a life of homelessness and despair !', 'Lucas Tant': 'British Japanese, what a fusion ! Nice', 'Sukacita Yeremia': "Where's Chris Broad?", 'GollyKun': 'I WOULD LOVE TO TRAIN IN JAPAN', 'Templar Knight': 'The MOD are DESTROYING our British armed forces with political correctness. Allowing " crack " dealing soldiers to remain in the army while dismissing those who have the temerity to take a photo with a journalist who is anti Islamic just shows the type of people who are in charge as vile.', 'wcatholic1': 'The Germans have already altered their constitution in order to allow the Bundeswehr to operate beyond German borders, for example in ISAF. The Germans have accepted their role as a major regional power and Japan seems to be doing the same.', 'John Tressine': 'WOW, sending half our front-line troops just for a photo opp, we will soon be back in the big league.', 'StandSure': "Quite interesting to see this, not many people know but the British actually freed the Japanese POWs after the war, armed them and worked with them to help maintain order in Vietnam and other parts of Asia, we've worked with them ever since.", 'chris1117F': "Big deal you grits send three ships a few planes 16 soldiers and one helicopter. That's supposed to be a valuable asset show of force. U.s. has entire 7th fleet in Japan with a full carrier wing and three assualt carriers and a nuclear powered. Carrier and 100 fighter aircraft. And 50,000 army and marines in Japan. Grow up Britain you're not a global power.", 'liam hawkes': 'Japanese s favourite part of an english breakfast are beans hahaha wtf', 'DrPhilFurry': 'OMG?!?!? WHERE IS THE DIVERSITY IN TOKYO AND THE JAPANESE ARMY?', 'Malcom Canning': "wasn't he called the British tommy. ..............shhhhhh robinson", 'mikeymarmalade': "It's a good idea", 'Kabaka Mwanga': 'People around the world should know that once student president museveni of uganda is dead to gone we are going to chase or kick out all foreigners and migrants hiding in uganda and afrika', 'tentheagle': 'Alana Partridge...', 'Mr Camoron': 'The UK should concentrate on its own borders and stop pretending its a global empire poking its nose with its 16 soldiers and 1 helicopter!', 'Zidaric Helena': 'lep pozdrav iz slovenije', 'exactinmidget92': 'Reporters last name tells me that she is a pole. Its just an explosion of letters.', 'Aaron from England': 'Budget needs to be 3%', 'g2macs': "I would be ok with the British Army defending Japan if once just once, the Emperor stood up and apologised for the Burma Railway, Bataan Death march, the murder and torture of POW's...... the list could go on and on.....", 'William Warren': 'north korea has plastic guns', 'tommyguntom32': "Meanwhile I'm china they are secretly making robots to use instead of soldiers", 'Richard Goode': 'A as good luck, as NATO a point to engage or a defence as a engage.', 'Sky Kubo': 'My great grandfather who was a British Gurkha infantry riffle man, fought with the Japanese imperial army in the Burma’s jungle ( now Myanmar) place called impala near India Burma borders ,lost his 3 fingers and also lost left side ear in the WWII. I heard lot about this chilling British Japanese war stories from my grandfather when I was little, super scary stories tho , but hey those stories are history now for me nothing more , but for him it was a bravery , honor and never forgetting 🎌❤️🇬🇧', 'doczg88': 'Expelling UK soldiers over photo with Tommy Robinson?? What about that?', 'DJJAW11': "... Good article. What's your star sign ? 🤔😁", 'Stephen Cockett': "Keep an eye on your toe-nails and finger-nails lads.\nThese blokes used to pull out POW's toe and finger nails for a bit of a laugh during their naafi breaks.", 'Jayden is great': "If you are in North Korea it's mandatory to go to the Army wish is not fun some people don't get to the passingout Parade after doing the set years of Duty 💂💂", 'Daniel Whyatt': "Just 15? That's a little disappointing.", 'nowgaku': 'Glorious Anglo-Japanese Alliance again', '我是兔子王': 'in  fact , japan army  is  stronger  than  weak  British  army .The US Army is in Japan to prevent the Japanese army from being too strong. Americans do not trust the Japanese.hahahao(∩_∩)o 哈哈', 'Toffee Abroad': "I'm surprised the MOD had enough money to fly the British soldiers to Japan. I was in a taxi last year in Singapore and the driver had not long finished his national service. He told me that he had spent a few weeks in the UK on a joint training exercise between the British Army and the Singapore Armed Forces. The exercise was originally supposed to take place in Singapore but the British couldn't afford to send their troops or equipment over.", 'Anthony Roic': 'Train all you want, the brits have never known how to fight a force of equal moral, technology, or military strength. Must I remember what the legendary blackadder once said??', 'MC': 'Sent 15 soldiers ....lol', 'funkylee2010': 'Both countries come from a strong fighting history born fighters welcome to the future', 'Levi Liberow': '#IAMSOLDIERX', 'Tams80': "That question at the press conference was terribly wordy; almost like a speech.  Also, I didn't quite gather, was this training exercise a historic event?", 'dennytenny': "Your Brits, we're keeping an eye on you.  If you and your pal the Japanese are planning to invade North Korea, you better think again.  The USA is ready to defend North Korea against all foreign liberal fascists incursions.  Trump will not allow his best friend Kim to be replaced by liberal fascist South Korean government.", 'mtnmist1': 'Amend the constitution so the Japanese can militarize.  What could possibly go wrong?', 'SixSixteen Sevens': 'Do they get a Hari-Kiri knife?', 'John Ashtone': "Could people please remember it is 70+ years since WWII.  When I was at school a friend's father had been in Burma, he still had nightmares 25 years after, I have never forgotten this.  But times move on, the people today are not their parents or grand-parents, it is not they we are dealing with.  And it is how they behave in the modern world, and not admitting Muslims who wish to blow them up is hardly a sin?  \n\nIn Afghanistan, they were superb, they were there just doing, none military jobs and back up, but still did everything, to the best Japanese standards and reliability, that you would expect from their electronics and cars?\n\nWe are natural allies and were until 1941, and those saying 3 ships and 150 soldiers is nothing, are just showing how silly they are.  No other Nation is as highly regarded by the Japanese, those saying UK is finished and broke are stupid, UK has 5th largest economy, and if we are so broke and finished why are so many people from other Nations so desperate to live here? \n\nBut hey who did let that flag fly as a distress signal at 13:46 lol", 'No Name': 'The MOD is appearing a little fascist lately...', 'bigdmac33': 'Excellent presentation and interview skill on display. Smooth, safe diplomatic responses flowed forth!!', 'Andyb2379': 'All great & everything but we seriously need to look at our own budget. Maybe up our active personal.', 'koolyman': '2:37 weird target', 'me him': "Stop signing up to fight for the traitor governments that have constantly given more and more sovereignty away to EU gastapo! Stop going to middle east training jahidi Muslims who then infiltrate into the European countries and killing kids! It's plain as day they have no bother sacking your life's just for a fucking photo! Wtf? Let them get the new replacement to do the dirty work stop brits dying for these muppets! See how that goes!.....", 'HDaviator': "The Japanese should be careful, the PC could rub off on them. Don't want that.", 'BulletproofKam': "They didn't include the uk reserves! 35,000 active reserves and over 160,000 ex millitary contracted reserves! They included them in the other nations  figures!... Britain has 210,000 millitary personel they could deploy anywere on earth anytime, and the other 160,000+ millitary personel they can call back up if needed....... get your figures right! And the Active Uzk reserves if 35,000 are just as well trained as normal soldiers..l", 'Phil Staples': "Didn't we build them loads of warships and effectively train their navy, then later as a thank you they starved, tortured and worked to death loads of our and our allies soldiers? I can't remember them ever saying sorry for their terrible actions either....", 'mitsuru yamashita': 'To make things absolutely clear, this kind of relation has made almost for China, not North Korea. China is the only one country who has enough power to scare U.K. who is obviously trying to growth some power themselves in Asia, and China is threatening (or doing regular imperial stuff I say) all over the pacific.\n\nU.K. Is also having relation with India (kinda, though.) to being "British" in Asia just like classic British.\n\nSo this seems like big movement but actually is, just Japan and U.K. both are pretty scared of China and trying to scare them as well as possible. \n\nTo cut a long story short, nothing has been changed so far, now both islands countries having a macho friend who were acutely good friends from long time ago.', 'NoahVlogz': 'Great to see', 'TheSnakeGaming': 'UK army has persecuted its Squaddies for having a selfie with Tommy Robinson. Report on that.', 'FUCK THE FLAG': 'Japan is a puppet of America just like Britain.', 'Josh Rigo': 'As if a handful of ours would make a difference. Rubbish.', 'Kemal': 'i thought japan didnt have an army', 'Ernest Lunezi': 'Us uk australia canada new zealand english the best and the most powerful global power just watch out cause germany france and india its going to betray you in a very  shameful way and enemyes are growing now more than ever the west and democratic world it is in danger whith china russia india brasil and ultimately turkey indonesia iran  pakistan and france and germany working whith them for money and puttin in danger everything they built in decades cause english speaker countries did sacrificed a lot for these two countries and especialy for france and betrayed them and for germany literaly fought after the war and free the east germany from russia for the second time that s why you need to increase military budget imediatly. Japan the asian boss bravo UK', 'Zach Okey': "When you do a video about how good Germany's economy is don't mention the war 😉👍🏻 lol", 'Gar': 'I AM SOLIDER X', 'Not a Russian bot': 'Shame the Uk army doesn’t care about its soldiers and panders to extremists', 'Zack 691': 'I thought North Korea has a peace agreement with South , but not with Japan i guess', 'Andrew Johnston': "@ 13:46 why is the flag upside down?  Didn't anyone there notice it?", 'Daley Wilk': 'Since ww2', 'Square Peg Round Hole': '#IAmSoldierX'}{'Piper': 'Japan did alot of evil things in the war never forget those jap bastards', 'Shaurya Joshi': 'They should be training to fight extremists on their streets.\n\nSigh..the UK is a dying country.', 'ShAdOwMaN': 'Nice!', 'Dr Wellington': 'Teno hekia banzai', '富澤そら': 'thank you 🇬🇧\nありがとう！新しい日英の始まりだ(*ﾟ▽ﾟ*)', 'Lord Butthole': 'Welcome to the Jungle :)', 'dan forbes': 'i think not', 'Clutch': 'One thing that was missed when the USAF Col. answered "Why does the US have a presence here?" is the fact that the JSDF was never designed to stand alone. From the beginning it was designed to be a defensive buffer to last long enough for US/coalition forces to relieve them.', 'Kai Kawano': '13:40 "this matters" beautiful Queens English.   \nWe welcome all British Forces and Gordon Ramsay.\ni love how Ramsay talk shit to american food', 'Matthew Jerousek': 'I love anime.', "FANBOY Lets' Plays": "British forces in Japan? Well that's something interesting", 'no1reallycaresabout2': '2:59 \nThey couldnt bother to hire a translator to interview the Japanese passerby? The sample is less representative of the population if they only interviewed Japanese people who spoke English.\n\nOtherwise, interesting video.', 'Keith Donald': 'Surrender what do me world war twos over', 'Snake Plissken': 'I am sure the British are proud to come to a country where the people comes first ,and not run by politicians that support extremists and sharia law.', 'Views 22T': "if you can't beat them join them", 'Bullet-Catcher': '#IAmSoldierX', 'Rob Bleeker': 'Saying that NK has 1.2 million active soldiers doent mean anything..... We know how out dated their equipment is....', 'Narahiko': 'British Weeaboos c:', 'John Smith': 'Ohhh tommy tommy\n\ntommy tommy tommy tommy\nROBINSON', 'Chen Lee': 'Can’t possibly the first time, the RM were here in Tokyo 2 years ago. Friendly football match but still here as an official invitation.', 'CBRMoto': '#IAmSoldierX', 'Manu De Man': 'about those nukes\nthe people killed were mostly women, children and old people as the men were off fighting\nthe effectiveness was limited as the mostly wooden Japanese cities had been fire bombed already\nmany generals at the time openly challenged the need to use such a weapon\nand the end of the war shortly after had more to do with the Russians about to invade Japan than the nukes being dropped; or maybe the nukes were used because Russia was about to invade', 'Shawn.K': 'STILL no single apologies to those countries suffered from innocent civilian rapes, Slaughters during WW II. Instead, Those apes are building AAS, Marine corps which clearly is a system made for invasion. Who knows? They could hit your 6 just like the old days. LOL.\n\nTraining with them just to make china calm? Funny joke out there :) You pals should’ve done it with ROK. Not with those trying to break their leashes, dreaming their old empire bull s***.', 'rainbowsixODST': 'British Army? What army? All I saw was a bunch of demoralized soldiers forced to serve a Leftish System who cares nothing for them and who can’t even utilize the freedoms they defend. Japan’s soldiers are more free and open than Britain’s! I support soldierX', 'Gaz 00': '#IAmSoldierX', 'Kelvin Fong': 'Britain helped build the imperial Japanese navy. It’s earliest battleships were built in England. \n\nMany Japanese naval officers were trained in England. Their greatest admiral, Togo was trained at Dartmouth.', 'Jackson Brown': 'The army blabs on about standing up against fascists, then decides to expel someone because they express their opinion...irony.', 'The uncomfortable TRUTH': 'The fact of the matter is that the British Army train our brave young men for combat and once our brave young men have been in combat and end up suffering from PTSD they are thrown out of the Army for a life of homelessness and despair !', 'Lucas Tant': 'British Japanese, what a fusion ! Nice', 'Sukacita Yeremia': "Where's Chris Broad?", 'GollyKun': 'I WOULD LOVE TO TRAIN IN JAPAN', 'Templar Knight': 'The MOD are DESTROYING our British armed forces with political correctness. Allowing " crack " dealing soldiers to remain in the army while dismissing those who have the temerity to take a photo with a journalist who is anti Islamic just shows the type of people who are in charge as vile.', 'wcatholic1': 'The Germans have already altered their constitution in order to allow the Bundeswehr to operate beyond German borders, for example in ISAF. The Germans have accepted their role as a major regional power and Japan seems to be doing the same.', 'John Tressine': 'WOW, sending half our front-line troops just for a photo opp, we will soon be back in the big league.', 'StandSure': "Quite interesting to see this, not many people know but the British actually freed the Japanese POWs after the war, armed them and worked with them to help maintain order in Vietnam and other parts of Asia, we've worked with them ever since.", 'chris1117F': "Big deal you grits send three ships a few planes 16 soldiers and one helicopter. That's supposed to be a valuable asset show of force. U.s. has entire 7th fleet in Japan with a full carrier wing and three assualt carriers and a nuclear powered. Carrier and 100 fighter aircraft. And 50,000 army and marines in Japan. Grow up Britain you're not a global power.", 'liam hawkes': 'Japanese s favourite part of an english breakfast are beans hahaha wtf', 'DrPhilFurry': 'OMG?!?!? WHERE IS THE DIVERSITY IN TOKYO AND THE JAPANESE ARMY?', 'Malcom Canning': "wasn't he called the British tommy. ..............shhhhhh robinson", 'mikeymarmalade': "It's a good idea", 'Kabaka Mwanga': 'People around the world should know that once student president museveni of uganda is dead to gone we are going to chase or kick out all foreigners and migrants hiding in uganda and afrika', 'tentheagle': 'Alana Partridge...', 'Mr Camoron': 'The UK should concentrate on its own borders and stop pretending its a global empire poking its nose with its 16 soldiers and 1 helicopter!', 'Zidaric Helena': 'lep pozdrav iz slovenije', 'exactinmidget92': 'Reporters last name tells me that she is a pole. Its just an explosion of letters.', 'Aaron from England': 'Budget needs to be 3%', 'g2macs': "I would be ok with the British Army defending Japan if once just once, the Emperor stood up and apologised for the Burma Railway, Bataan Death march, the murder and torture of POW's...... the list could go on and on.....", 'William Warren': 'north korea has plastic guns', 'tommyguntom32': "Meanwhile I'm china they are secretly making robots to use instead of soldiers", 'Richard Goode': 'A as good luck, as NATO a point to engage or a defence as a engage.', 'Sky Kubo': 'My great grandfather who was a British Gurkha infantry riffle man, fought with the Japanese imperial army in the Burma’s jungle ( now Myanmar) place called impala near India Burma borders ,lost his 3 fingers and also lost left side ear in the WWII. I heard lot about this chilling British Japanese war stories from my grandfather when I was little, super scary stories tho , but hey those stories are history now for me nothing more , but for him it was a bravery , honor and never forgetting 🎌❤️🇬🇧', 'doczg88': 'Expelling UK soldiers over photo with Tommy Robinson?? What about that?', 'DJJAW11': "... Good article. What's your star sign ? 🤔😁", 'Stephen Cockett': "Keep an eye on your toe-nails and finger-nails lads.\nThese blokes used to pull out POW's toe and finger nails for a bit of a laugh during their naafi breaks.", 'Jayden is great': "If you are in North Korea it's mandatory to go to the Army wish is not fun some people don't get to the passingout Parade after doing the set years of Duty 💂💂", 'Daniel Whyatt': "Just 15? That's a little disappointing.", 'nowgaku': 'Glorious Anglo-Japanese Alliance again', '我是兔子王': 'in  fact , japan army  is  stronger  than  weak  British  army .The US Army is in Japan to prevent the Japanese army from being too strong. Americans do not trust the Japanese.hahahao(∩_∩)o 哈哈', 'Toffee Abroad': "I'm surprised the MOD had enough money to fly the British soldiers to Japan. I was in a taxi last year in Singapore and the driver had not long finished his national service. He told me that he had spent a few weeks in the UK on a joint training exercise between the British Army and the Singapore Armed Forces. The exercise was originally supposed to take place in Singapore but the British couldn't afford to send their troops or equipment over.", 'Anthony Roic': 'Train all you want, the brits have never known how to fight a force of equal moral, technology, or military strength. Must I remember what the legendary blackadder once said??', 'MC': 'Sent 15 soldiers ....lol', 'funkylee2010': 'Both countries come from a strong fighting history born fighters welcome to the future', 'Levi Liberow': '#IAMSOLDIERX', 'Tams80': "That question at the press conference was terribly wordy; almost like a speech.  Also, I didn't quite gather, was this training exercise a historic event?", 'dennytenny': "Your Brits, we're keeping an eye on you.  If you and your pal the Japanese are planning to invade North Korea, you better think again.  The USA is ready to defend North Korea against all foreign liberal fascists incursions.  Trump will not allow his best friend Kim to be replaced by liberal fascist South Korean government.", 'mtnmist1': 'Amend the constitution so the Japanese can militarize.  What could possibly go wrong?', 'SixSixteen Sevens': 'Do they get a Hari-Kiri knife?', 'John Ashtone': "Could people please remember it is 70+ years since WWII.  When I was at school a friend's father had been in Burma, he still had nightmares 25 years after, I have never forgotten this.  But times move on, the people today are not their parents or grand-parents, it is not they we are dealing with.  And it is how they behave in the modern world, and not admitting Muslims who wish to blow them up is hardly a sin?  \n\nIn Afghanistan, they were superb, they were there just doing, none military jobs and back up, but still did everything, to the best Japanese standards and reliability, that you would expect from their electronics and cars?\n\nWe are natural allies and were until 1941, and those saying 3 ships and 150 soldiers is nothing, are just showing how silly they are.  No other Nation is as highly regarded by the Japanese, those saying UK is finished and broke are stupid, UK has 5th largest economy, and if we are so broke and finished why are so many people from other Nations so desperate to live here? \n\nBut hey who did let that flag fly as a distress signal at 13:46 lol", 'No Name': 'The MOD is appearing a little fascist lately...', 'bigdmac33': 'Excellent presentation and interview skill on display. Smooth, safe diplomatic responses flowed forth!!', 'Andyb2379': 'All great & everything but we seriously need to look at our own budget. Maybe up our active personal.', 'koolyman': '2:37 weird target', 'me him': "Stop signing up to fight for the traitor governments that have constantly given more and more sovereignty away to EU gastapo! Stop going to middle east training jahidi Muslims who then infiltrate into the European countries and killing kids! It's plain as day they have no bother sacking your life's just for a fucking photo! Wtf? Let them get the new replacement to do the dirty work stop brits dying for these muppets! See how that goes!.....", 'HDaviator': "The Japanese should be careful, the PC could rub off on them. Don't want that.", 'BulletproofKam': "They didn't include the uk reserves! 35,000 active reserves and over 160,000 ex millitary contracted reserves! They included them in the other nations  figures!... Britain has 210,000 millitary personel they could deploy anywere on earth anytime, and the other 160,000+ millitary personel they can call back up if needed....... get your figures right! And the Active Uzk reserves if 35,000 are just as well trained as normal soldiers..l", 'Phil Staples': "Didn't we build them loads of warships and effectively train their navy, then later as a thank you they starved, tortured and worked to death loads of our and our allies soldiers? I can't remember them ever saying sorry for their terrible actions either....", 'mitsuru yamashita': 'To make things absolutely clear, this kind of relation has made almost for China, not North Korea. China is the only one country who has enough power to scare U.K. who is obviously trying to growth some power themselves in Asia, and China is threatening (or doing regular imperial stuff I say) all over the pacific.\n\nU.K. Is also having relation with India (kinda, though.) to being "British" in Asia just like classic British.\n\nSo this seems like big movement but actually is, just Japan and U.K. both are pretty scared of China and trying to scare them as well as possible. \n\nTo cut a long story short, nothing has been changed so far, now both islands countries having a macho friend who were acutely good friends from long time ago.', 'NoahVlogz': 'Great to see', 'TheSnakeGaming': 'UK army has persecuted its Squaddies for having a selfie with Tommy Robinson. Report on that.', 'FUCK THE FLAG': 'Japan is a puppet of America just like Britain.', 'Josh Rigo': 'As if a handful of ours would make a difference. Rubbish.', 'Kemal': 'i thought japan didnt have an army', 'Ernest Lunezi': 'Us uk australia canada new zealand english the best and the most powerful global power just watch out cause germany france and india its going to betray you in a very  shameful way and enemyes are growing now more than ever the west and democratic world it is in danger whith china russia india brasil and ultimately turkey indonesia iran  pakistan and france and germany working whith them for money and puttin in danger everything they built in decades cause english speaker countries did sacrificed a lot for these two countries and especialy for france and betrayed them and for germany literaly fought after the war and free the east germany from russia for the second time that s why you need to increase military budget imediatly. Japan the asian boss bravo UK', 'Zach Okey': "When you do a video about how good Germany's economy is don't mention the war 😉👍🏻 lol", 'Gar': 'I AM SOLIDER X', 'Not a Russian bot': 'Shame the Uk army doesn’t care about its soldiers and panders to extremists', 'Zack 691': 'I thought North Korea has a peace agreement with South , but not with Japan i guess', 'Andrew Johnston': "@ 13:46 why is the flag upside down?  Didn't anyone there notice it?", 'Daley Wilk': 'Since ww2', 'Square Peg Round Hole': '#IAmSoldierX'}{'Piper': 'Japan did alot of evil things in the war never forget those jap bastards', 'Shaurya Joshi': 'They should be training to fight extremists on their streets.\n\nSigh..the UK is a dying country.', 'ShAdOwMaN': 'Nice!', 'Dr Wellington': 'Teno hekia banzai', '富澤そら': 'thank you 🇬🇧\nありがとう！新しい日英の始まりだ(*ﾟ▽ﾟ*)', 'Lord Butthole': 'Welcome to the Jungle :)', 'dan forbes': 'i think not', 'Clutch': 'One thing that was missed when the USAF Col. answered "Why does the US have a presence here?" is the fact that the JSDF was never designed to stand alone. From the beginning it was designed to be a defensive buffer to last long enough for US/coalition forces to relieve them.', 'Kai Kawano': '13:40 "this matters" beautiful Queens English.   \nWe welcome all British Forces and Gordon Ramsay.\ni love how Ramsay talk shit to american food', 'Matthew Jerousek': 'I love anime.', "FANBOY Lets' Plays": "British forces in Japan? Well that's something interesting", 'no1reallycaresabout2': '2:59 \nThey couldnt bother to hire a translator to interview the Japanese passerby? The sample is less representative of the population if they only interviewed Japanese people who spoke English.\n\nOtherwise, interesting video.', 'Keith Donald': 'Surrender what do me world war twos over', 'Snake Plissken': 'I am sure the British are proud to come to a country where the people comes first ,and not run by politicians that support extremists and sharia law.', 'Views 22T': "if you can't beat them join them", 'Bullet-Catcher': '#IAmSoldierX', 'Rob Bleeker': 'Saying that NK has 1.2 million active soldiers doent mean anything..... We know how out dated their equipment is....', 'Narahiko': 'British Weeaboos c:', 'John Smith': 'Ohhh tommy tommy\n\ntommy tommy tommy tommy\nROBINSON', 'Chen Lee': 'Can’t possibly the first time, the RM were here in Tokyo 2 years ago. Friendly football match but still here as an official invitation.', 'CBRMoto': '#IAmSoldierX', 'Manu De Man': 'about those nukes\nthe people killed were mostly women, children and old people as the men were off fighting\nthe effectiveness was limited as the mostly wooden Japanese cities had been fire bombed already\nmany generals at the time openly challenged the need to use such a weapon\nand the end of the war shortly after had more to do with the Russians about to invade Japan than the nukes being dropped; or maybe the nukes were used because Russia was about to invade', 'Shawn.K': 'STILL no single apologies to those countries suffered from innocent civilian rapes, Slaughters during WW II. Instead, Those apes are building AAS, Marine corps which clearly is a system made for invasion. Who knows? They could hit your 6 just like the old days. LOL.\n\nTraining with them just to make china calm? Funny joke out there :) You pals should’ve done it with ROK. Not with those trying to break their leashes, dreaming their old empire bull s***.', 'rainbowsixODST': 'British Army? What army? All I saw was a bunch of demoralized soldiers forced to serve a Leftish System who cares nothing for them and who can’t even utilize the freedoms they defend. Japan’s soldiers are more free and open than Britain’s! I support soldierX', 'Gaz 00': '#IAmSoldierX', 'Kelvin Fong': 'Britain helped build the imperial Japanese navy. It’s earliest battleships were built in England. \n\nMany Japanese naval officers were trained in England. Their greatest admiral, Togo was trained at Dartmouth.', 'Jackson Brown': 'The army blabs on about standing up against fascists, then decides to expel someone because they express their opinion...irony.', 'The uncomfortable TRUTH': 'The fact of the matter is that the British Army train our brave young men for combat and once our brave young men have been in combat and end up suffering from PTSD they are thrown out of the Army for a life of homelessness and despair !', 'Lucas Tant': 'British Japanese, what a fusion ! Nice', 'Sukacita Yeremia': "Where's Chris Broad?", 'GollyKun': 'I WOULD LOVE TO TRAIN IN JAPAN', 'Templar Knight': 'The MOD are DESTROYING our British armed forces with political correctness. Allowing " crack " dealing soldiers to remain in the army while dismissing those who have the temerity to take a photo with a journalist who is anti Islamic just shows the type of people who are in charge as vile.', 'wcatholic1': 'The Germans have already altered their constitution in order to allow the Bundeswehr to operate beyond German borders, for example in ISAF. The Germans have accepted their role as a major regional power and Japan seems to be doing the same.', 'John Tressine': 'WOW, sending half our front-line troops just for a photo opp, we will soon be back in the big league.', 'StandSure': "Quite interesting to see this, not many people know but the British actually freed the Japanese POWs after the war, armed them and worked with them to help maintain order in Vietnam and other parts of Asia, we've worked with them ever since.", 'chris1117F': "Big deal you grits send three ships a few planes 16 soldiers and one helicopter. That's supposed to be a valuable asset show of force. U.s. has entire 7th fleet in Japan with a full carrier wing and three assualt carriers and a nuclear powered. Carrier and 100 fighter aircraft. And 50,000 army and marines in Japan. Grow up Britain you're not a global power.", 'liam hawkes': 'Japanese s favourite part of an english breakfast are beans hahaha wtf', 'DrPhilFurry': 'OMG?!?!? WHERE IS THE DIVERSITY IN TOKYO AND THE JAPANESE ARMY?', 'Malcom Canning': "wasn't he called the British tommy. ..............shhhhhh robinson", 'mikeymarmalade': "It's a good idea", 'Kabaka Mwanga': 'People around the world should know that once student president museveni of uganda is dead to gone we are going to chase or kick out all foreigners and migrants hiding in uganda and afrika', 'tentheagle': 'Alana Partridge...', 'Mr Camoron': 'The UK should concentrate on its own borders and stop pretending its a global empire poking its nose with its 16 soldiers and 1 helicopter!', 'Zidaric Helena': 'lep pozdrav iz slovenije', 'exactinmidget92': 'Reporters last name tells me that she is a pole. Its just an explosion of letters.', 'Aaron from England': 'Budget needs to be 3%', 'g2macs': "I would be ok with the British Army defending Japan if once just once, the Emperor stood up and apologised for the Burma Railway, Bataan Death march, the murder and torture of POW's...... the list could go on and on.....", 'William Warren': 'north korea has plastic guns', 'tommyguntom32': "Meanwhile I'm china they are secretly making robots to use instead of soldiers", 'Richard Goode': 'A as good luck, as NATO a point to engage or a defence as a engage.', 'Sky Kubo': 'My great grandfather who was a British Gurkha infantry riffle man, fought with the Japanese imperial army in the Burma’s jungle ( now Myanmar) place called impala near India Burma borders ,lost his 3 fingers and also lost left side ear in the WWII. I heard lot about this chilling British Japanese war stories from my grandfather when I was little, super scary stories tho , but hey those stories are history now for me nothing more , but for him it was a bravery , honor and never forgetting 🎌❤️🇬🇧', 'doczg88': 'Expelling UK soldiers over photo with Tommy Robinson?? What about that?', 'DJJAW11': "... Good article. What's your star sign ? 🤔😁", 'Stephen Cockett': "Keep an eye on your toe-nails and finger-nails lads.\nThese blokes used to pull out POW's toe and finger nails for a bit of a laugh during their naafi breaks.", 'Jayden is great': "If you are in North Korea it's mandatory to go to the Army wish is not fun some people don't get to the passingout Parade after doing the set years of Duty 💂💂", 'Daniel Whyatt': "Just 15? That's a little disappointing.", 'nowgaku': 'Glorious Anglo-Japanese Alliance again', '我是兔子王': 'in  fact , japan army  is  stronger  than  weak  British  army .The US Army is in Japan to prevent the Japanese army from being too strong. Americans do not trust the Japanese.hahahao(∩_∩)o 哈哈', 'Toffee Abroad': "I'm surprised the MOD had enough money to fly the British soldiers to Japan. I was in a taxi last year in Singapore and the driver had not long finished his national service. He told me that he had spent a few weeks in the UK on a joint training exercise between the British Army and the Singapore Armed Forces. The exercise was originally supposed to take place in Singapore but the British couldn't afford to send their troops or equipment over.", 'Anthony Roic': 'Train all you want, the brits have never known how to fight a force of equal moral, technology, or military strength. Must I remember what the legendary blackadder once said??', 'MC': 'Sent 15 soldiers ....lol', 'funkylee2010': 'Both countries come from a strong fighting history born fighters welcome to the future', 'Levi Liberow': '#IAMSOLDIERX', 'Tams80': "That question at the press conference was terribly wordy; almost like a speech.  Also, I didn't quite gather, was this training exercise a historic event?", 'dennytenny': "Your Brits, we're keeping an eye on you.  If you and your pal the Japanese are planning to invade North Korea, you better think again.  The USA is ready to defend North Korea against all foreign liberal fascists incursions.  Trump will not allow his best friend Kim to be replaced by liberal fascist South Korean government.", 'mtnmist1': 'Amend the constitution so the Japanese can militarize.  What could possibly go wrong?', 'SixSixteen Sevens': 'Do they get a Hari-Kiri knife?', 'John Ashtone': "Could people please remember it is 70+ years since WWII.  When I was at school a friend's father had been in Burma, he still had nightmares 25 years after, I have never forgotten this.  But times move on, the people today are not their parents or grand-parents, it is not they we are dealing with.  And it is how they behave in the modern world, and not admitting Muslims who wish to blow them up is hardly a sin?  \n\nIn Afghanistan, they were superb, they were there just doing, none military jobs and back up, but still did everything, to the best Japanese standards and reliability, that you would expect from their electronics and cars?\n\nWe are natural allies and were until 1941, and those saying 3 ships and 150 soldiers is nothing, are just showing how silly they are.  No other Nation is as highly regarded by the Japanese, those saying UK is finished and broke are stupid, UK has 5th largest economy, and if we are so broke and finished why are so many people from other Nations so desperate to live here? \n\nBut hey who did let that flag fly as a distress signal at 13:46 lol", 'No Name': 'The MOD is appearing a little fascist lately...', 'bigdmac33': 'Excellent presentation and interview skill on display. Smooth, safe diplomatic responses flowed forth!!', 'Andyb2379': 'All great & everything but we seriously need to look at our own budget. Maybe up our active personal.', 'koolyman': '2:37 weird target', 'me him': "Stop signing up to fight for the traitor governments that have constantly given more and more sovereignty away to EU gastapo! Stop going to middle east training jahidi Muslims who then infiltrate into the European countries and killing kids! It's plain as day they have no bother sacking your life's just for a fucking photo! Wtf? Let them get the new replacement to do the dirty work stop brits dying for these muppets! See how that goes!.....", 'HDaviator': "The Japanese should be careful, the PC could rub off on them. Don't want that.", 'BulletproofKam': "They didn't include the uk reserves! 35,000 active reserves and over 160,000 ex millitary contracted reserves! They included them in the other nations  figures!... Britain has 210,000 millitary personel they could deploy anywere on earth anytime, and the other 160,000+ millitary personel they can call back up if needed....... get your figures right! And the Active Uzk reserves if 35,000 are just as well trained as normal soldiers..l", 'Phil Staples': "Didn't we build them loads of warships and effectively train their navy, then later as a thank you they starved, tortured and worked to death loads of our and our allies soldiers? I can't remember them ever saying sorry for their terrible actions either....", 'mitsuru yamashita': 'To make things absolutely clear, this kind of relation has made almost for China, not North Korea. China is the only one country who has enough power to scare U.K. who is obviously trying to growth some power themselves in Asia, and China is threatening (or doing regular imperial stuff I say) all over the pacific.\n\nU.K. Is also having relation with India (kinda, though.) to being "British" in Asia just like classic British.\n\nSo this seems like big movement but actually is, just Japan and U.K. both are pretty scared of China and trying to scare them as well as possible. \n\nTo cut a long story short, nothing has been changed so far, now both islands countries having a macho friend who were acutely good friends from long time ago.', 'NoahVlogz': 'Great to see', 'TheSnakeGaming': 'UK army has persecuted its Squaddies for having a selfie with Tommy Robinson. Report on that.', 'FUCK THE FLAG': 'Japan is a puppet of America just like Britain.', 'Josh Rigo': 'As if a handful of ours would make a difference. Rubbish.', 'Kemal': 'i thought japan didnt have an army', 'Ernest Lunezi': 'Us uk australia canada new zealand english the best and the most powerful global power just watch out cause germany france and india its going to betray you in a very  shameful way and enemyes are growing now more than ever the west and democratic world it is in danger whith china russia india brasil and ultimately turkey indonesia iran  pakistan and france and germany working whith them for money and puttin in danger everything they built in decades cause english speaker countries did sacrificed a lot for these two countries and especialy for france and betrayed them and for germany literaly fought after the war and free the east germany from russia for the second time that s why you need to increase military budget imediatly. Japan the asian boss bravo UK', 'Zach Okey': "When you do a video about how good Germany's economy is don't mention the war 😉👍🏻 lol", 'Gar': 'I AM SOLIDER X', 'Not a Russian bot': 'Shame the Uk army doesn’t care about its soldiers and panders to extremists', 'Zack 691': 'I thought North Korea has a peace agreement with South , but not with Japan i guess', 'Andrew Johnston': "@ 13:46 why is the flag upside down?  Didn't anyone there notice it?", 'Daley Wilk': 'Since ww2', 'Square Peg Round Hole': '#IAmSoldierX'}{'Piper': 'Japan did alot of evil things in the war never forget those jap bastards', 'Shaurya Joshi': 'They should be training to fight extremists on their streets.\n\nSigh..the UK is a dying country.', 'ShAdOwMaN': 'Nice!', 'Dr Wellington': 'Teno hekia banzai', '富澤そら': 'thank you 🇬🇧\nありがとう！新しい日英の始まりだ(*ﾟ▽ﾟ*)', 'Lord Butthole': 'Welcome to the Jungle :)', 'dan forbes': 'i think not'}