{'jock the dog song production': "You should visit blessyahowah.com Yah wants to walk with us upright and hold his hand. He wishes a conversation with us, a Father Son relationship. Dowd mistranslated David was his beloved child. Think about this Dowd continually expressed his love for Yahowah, man continually removed Yahowahs name from the Torah.  Psalm/Mizmowr 19:7 Yahowah's Towrah is complete and entirely perfect, returning and restoring the soul. Yahowah's testimony is trustworthy and reliable, making understanding and obtaining wisdom simple for the open - minded and receptive. Bless Yahowah and his wonderful son Yahowsha . David ben Gurion was an alleged historian he said that the Palestinians where in actual fact farming Jews of old who converted to Islam because they could not pay the jihad tax. I heard a wonderful message recently called. The untimely death of Yahowsha (Jesus) I was astounded at this message. It was given by Torah To The Tribes.", 'Zach Waddill': 'Lei hoaka today', 'twodogs716': 'I agree about the POSSESSED EYES! (new subscriber - Messianic) \nYah bless! \nSW417USA', 'sharoni maroni': 'Had a good laugh when you said "I\'ve lost it"😂 love your humor, this also, next to everything else is a God-given gift!', 'Catherine White': "It is good to point out the overuse of words like 'game changer' and other words/phrases can diminish our message. I'll just leave that there.", 'Williem & Rebekah MaClutchie-Evans': 'Amen Jesus Christ is in The Throne Room With The Father on Our Behalf Amen Shalom.', 'destination Leyte Island': 'folks this could be huge.  President Macron of France has a "peace plan" ready if President Trump doesn\'t come forward in next few weeks with his version of the peace plan.  Check this article link:\n\nhttps://www.newsweek.com/france-lead-middle-east-peace-if-trump-kushner-plan-not-released-soon-israeli-1185860', 'james hollis': 'God is all. And he gave all through his son our Lord and Savior. Through you the Word reminds us  that His Glory is our path to Him in such a world we live in.', 'Natalie Ogg': 'Thank you for the message and sharing the word of our Lord!!! Praise God, the ONLY GOD, who was and is and is to come♡♡♡', 'Bruce Eggleston': 'Hilarious. My wife always told me can\'t you dress nicer for church.\xa0 I told her "Do you think God is up there says. "Oh myself" because He can\'t say Oh my God because He is god.\xa0 Do you think he is saying "Oh myself.\xa0 Look at what Bruce wore to church today. Can you believe he wore Levi\'s."', 'Will Schmidt': 'Not much can happen till Libya is stabilized and can then become part of the Ezekiel 38 confederacy.', 'Evan Journey': 'There’s no such thing as a “game changer” nothing has changed God is still in control.  It’s ALL part of his plan....', 'Colleen Davis': 'You BLOW my speakers out, man...and I really wanna hear you...that MIKE is WAY TOO HOT for your voluminous voice...and YES< my volume is turned way down...but I do NOT wish to sit raising and lowering every time you change volume', 'Eric Kramer': 'Was God surprised at the election results? Well, what does Scripture say?\n\n“Daniel answered and said:\n\nBlessed be the name of God forever and ever, to whom belong wisdom and might. He changes times and seasons; he removes kings and sets up kings;” - Daniel 2:20–21a ESV', 'Josh Mcgehee': 'France to US: Release your peace plan or we’ll release ours https://www.jpost.com/Arab-Israeli-Conflict/Foreign-Ministry-rep-If-Trump-delays-Macron-to-present-peace-plan-570114', 'Inuksuk Builder': 'Still listening every week from Canada', 'Vera Guillory': "We need to pray for Trump as well, he is Satanist as well as Kavanavaugh, they are all connected. There is no democrat or republican, they are playing us, to separate us. They are all together, republican n democrat, Trump is helping Israel for the religion and money, he's for the Satanic Catholic church, he is a Mason, when the time comes they are coming for us.The Trumpence is blowing literally, Trump and Pence, God is so amazing and loves us so much, look how he put them together to open our eyes. The trumpets are about to blow, come to Jesus, repent, be born again, before time is up.", 'Alfred Emerson': "Amen, the most important election ever. G-D put Trump in and Now we can vote to keep G-D's graces on our nation or let the end of America will proceed.", 'Pammie Doodle': 'Thank you, JD for your updates and teachings!\nI sometimes forget to “look up”, when seeing this out-of-control world!\nGod Bless and Maranatha 🙏✝️👆❤️', 'Mayim Hayim': 'Michelle Bachmann would be great in the UN too. She is my pick.', 'Victoria Andersson': "Dear Pastor. I am so thankful for the ABC's of Salvation and your weekly updates.  I just got back from Amir's last tour in Israel and I am more on fire to be an ambassador.   I wonder if you would be so kind as to send me your bulletin to Sweden?  That way I can use my copier to copy the ABC's on the back and hand them out.  It would just be nice to have something that is formatted nicely like you have done.  If it works out for you to do that, my name and address is: \n Victoria Andersson \nSnapphanegatan 12B\n28372 Lönsboda\nSWEDEN\n\nPeace in Jesus Name,\nVictoria", 'LISA*R': 'I love you to pieces pastor farag. your sermons excite me, uplift me and give me so much hope in these perilous times. may god continually bless you dear brother to spread the word of god. jesus Christ/yeshua I love you and thank you for the precious gift of salvation. come quickly. never soon enough', 'Diana Van Es': 'LOVE THIS MINISTRY!', 'David Melvin': 'Thank you again Brother Farag.  Your insights are both informative and comforting.  May God continue to richly bless your ministry to reach those who need to hear the Good News!', 'Katie JCMercyGrace': 'While Rahm Emanuel may have quoted the saying, "Never let a good crisis go to waste." I think it was their \'friend\' Saul Alinsky who actually first said it.', 'MrMatt1138': 'Tucker is my daily source too. Why anyone who opposed his point of would go on his show is just crazy.', 'Northern Thai Garden Guy': 'Thank you so very much, Pastor JD, for once again confirming just how simple it is (not complicated) to ask Jesus to become your Savior.  :)', 'Tina Carrion': 'Love it keep being you. Thank you Lord for this ministry amen', 'Max C': "It has suddenly occurred to me that the absence of any aid from any nation toward Israel when the Gog and Magog invasion happens could be an overturn of the Trump balance. If we had another liberal, like Obama, come into power, we would stand idly by while it happens. It wouldn't have to be our destruction but the overturn by a liberal Israel hating population that is growing worse by the moment . What is seen on the news, of late, is beyond anything seen before in the  mob violence. There seems nothing that is out of bounds for them to achieve their agenda.", 'Gail Knop': 'I wish.Niki wouldn’t retire from this position', 'Louis76': 'I am so glad to be a part of this online Church.', 'Joseph B': 'https://www.axios.com/trump-pressure-netanyahu-middle-east-peace-deal-50dcb4a8-a8ba-49ab-8541-ffbb5febb125.html', 'cam larson': 'What the heck is around his neck?', 'Denarrdo Fontenot': "John 3:16  , the truth you know shall set you free  , JESUS IS LORD. I can't say anything that is above that.", 'Lisa C': 'Praise our mighty King! Soon and very soon we are going to see the King...\\●/', 'Iscah994': "The UN is causing nothing more than distraction at this point- using something they know would be inflammatory and ridiculous enough to spark a response only to distract. \nWatching an update from The Superior Word, Charlie the pastor always provides the latest in worldwide news with their sources- Russia is in Libya. I'm sure Putin (as many Russians) is no stranger to the game of chess, positioning his rooks, bishops, and knights to try for a checkmate. I would not be surprised if he were to try for Gaza or Yemen as he's also aware that the enemy of an enemy is always a friend.", 'Frank Cooper': 'the tribulation is knocking on the worlds door.', 'Roger Dat': 'Thank you Father God for Pastor JD and the bold shepards serving like him.  Thank you Holy Spirit for the needed righteous anger from your elect. Thank you Jesus for our salvation and everlasting life. Eph 4:26-27!', 'Duwayne Waipa': 'Mahalo Kahu JD, you are definitely the salt and the light of the earth.', 'Bruce Askin': 'God bless', 'Marcin Leśniewicz': 'Thank You God for J.D.Farag!', 'Vickie Shelton': 'Every politician in history as said “never let a good disease go to waste” (Joseph governor Egypt 7 years) Lord God Almighty come soon', 'Philip Hughes': 'Gaza must be burned to the ground in response to the fire terror.', 'My interest': 'https://youtu.be/T8emrOsHSpY what do you think of this study?', 'Jody Wolfe': '(((INSANITY)))', 'Yvonne Dohoney': 'Talk about spiritual warfare\nUS having invasion...Israel losing peace treaty with Jordan...Saudi Arabia involved with Karassiggi in Turkey...\nNow Russia and China threatening to devalue  dollar...\n\nPray as we never have before...look up..Amen', 'Jesusfreak': 'God bless you J.D, from Nova Scotia Canada :)', 'Dawn Crafts': 'Good work my faithful servant . Our Lord will be telling this to you. God bless you and your family. .', 'Oscar Ballard': 'We should pray for all the inhabitants in Israel. Christians, Jews, Muslims and others.', 'WildOlive 700': 'Jesus❤', 'Martin Brennan': 'Khashoggi was against Israel  and fully for Palestine, and the Muslim Brotherhood..\nIran hates the Saudis..Some years ago I looked at an old Walid Shoebat video and he predicted the war in Yemen. And also would be a trigger for all out war between Iran and the Saudis. Mecca and Medina would be destroyed..\nThanks Pastor J.D. God bless you, your family and all brothers and sisters in Christ!!', 'irie a': 'true pastor - looking up', 'Sans Leister': "I like the pastor in Wisconsin's bulletin idea with the tract... then I notice on the front of the bulletin they depict an angel as a woman???", 'Dayumat Mane': 'look up Saul alinskys rules for radicals and that’s the Democrats guide to the shit you are seeing today', 'Steven Austin': 'TRUMP WON? HALLALIIA.', 'Mollie Joy Napuat': 'Amen Pastor, Bless you and this ministry!', 'Cathy Kaplan': "If the democrats win I think things will get much worse. But that's ok because I think that would bring the rapture much closer. For.the Christion it's a win win", 'Aletheia Lange': 'Hello Pastor JD. Time is getting so short. Just saw this article today:\nhttps://apple.news/AMNiqPpdkQpuojyufwahkfg', 'Kevin Hunt': 'ABC its easy as 1,2,3! Amen! Come quickly lord Jesus!', 'my fountain': "There is a fountain filled with blood drawn from Immanuel's veins.\nAnd sinners plunged beneath that  flood,\nlose all their guilty stains.\nLose all their guilty stains, lose all their guilty stains.\nAnd sinners plunged beneath that flood lose all their guilty stains \n\nThe dying thief rejoiced to see that fountain in his day,\nAnd their may I, as vile as he,\nWash all my sins away.\nWash all my sins away,wash all my sins away,\nAnd there may I ,as vile as he  , wash all my sins away.\n\nDear dying Lamb, thy precious blood ,\nshall never lose it's power,\nTill  all the ransomed Church of God ,\nBe saved to sin  no more,\nBe saved to sin no more, be saved to sin no more,\nTill all the ransomed Church Of God be saved to sin no more!\n\nE'er since by faith , I saw the stream,\nthy flowing wounds supply,\nRedeeming love  has been my theme and shall be tiil I die!\nAnd shall be till I die, and shall be till I die,\nRedeeming love has been my theme and shall be till I die.\n\nWhen this poor lisping stamm'ring tongue,\nLies silent in the grave,\nThen a nobler, sweeter song\nI'll sing Thy pow'r to save,\nI'll sing Thy pow'r to save, I'll sing Thy pow'r to save,\nThen a nobler ,sweeter song,I'll sing,\nThy pow'r to save!!!\n\n\nWilliam Couper.   \n\nColossians 3;16   'Let the word of God dwell in you richly in ALL wisdom;teaching and admonishing one another in psalms and hymns and spiritual songs, singing with grace in your hearts unto the Lord.\n,", 'Lawrence Mckenzie Pieterse': 'Thanks JD for great  message stay blessed, Cape Town South Africa', 'lovelywrld': 'Why not send all these people some leaflets?......', 'Kevinator': 'PAstor Farag....I love JESUS!!!! and I love you also....you are a warrior buddy!', 'Michelle Costea': 'I love your passion for Jesus and for Israel and for His coming', 'Stephen Jelinek': 'Demon position is real. During my 2013 hike of the Appalachian Trail. I encountered a man in Vermont who had taken on the trail name Hail Satan, my trail name was SonDriven. There was a war within the spirits with in us. And the power in the spirit within SonDriven over whelmed the spirit within Hail Satan.', 'Becky Smith': 'I love that she’s (Haley’s) on good terms with the administration and plans to help on the campaign.', 'Robert Curtis': 'The United Nations which should be changed to the United Nothing\'s.nothing would give me greater joy then to see this world"JOKE" organization get swept into the Atlantic ocean.', 'Floyd Porter': '✔', 'Nancy Anderson': 'Haley may be doing a wonderful job when it comes to Israel over the past almost 2 years, but at the Al Smith dinner a few nights ago, she said that (speaking about the political Democrat rhetoric of late) "our opponents aren\'t evil."  She very naively contrasted how in other countries people are poisoned, starved (as in Venezuela), jailed without a fair trial, etc. But said we don\'t do any of those things to our political opponents here in the U S.  Listen to this Christian man\'s channel Many Fish to get a better idea of what he\'s trying to say. https://youtu.be/Inpa7xU8Oe0', 'Jeffrey Smallwood': 'Every week I enjoy the truth you speak and information you give. Bless you brother', 'Cooleemeeedd': 'We need to throw the UN out of the USA immediately and quit the UN.  Let them support themselves with their phony "international" organization, that does nothing but pollute the world with "stuff."', 'mark reemtsma': 'I enjoyed your comments about loving this country,but this is not your final destination.  Our redemption draws nearer! The final destination is with our heavenly father and all the saints.', 'King of Hearts': 'Check out what God is saying about the 2 Billion $“mega millions \nlottery Jackpot”@ King of Hearts', 'Joni Deputy': 'And please vote via tangible methods. Amen', 'Tango Foxtrot': "Terry Malone.. has put up a vid, the indicates Trump's Peace Plan will be announced today or next day or two..\nhttps://www.youtube.com/watch?v=FQb_ODnkoSI", 'John Murphy': 'The Japanese did the same thing in WW ll , they took hot-air balloons and figured the Jetstream and time frame for them to release fire bombs into the woods of the Pacific Northwest ...a hiker stumbled upon one about thirty-five years ago and got himself blown up .', 'Tom David': 'Thank you Pastor JD for your passion for the Truth in our Lord Jesus Christ. Thanks for your updates and fearless message in these last of the last days. Love in Jesus name. Tom David', 'auhseylij J': "Before you even said it, I was going to say that this is truly demonic and purely spiritual warfare! Pray for the election,  against violence at the borde, and vote . We really do need to pray for all these lost people. Even those who are on fisa list require prayer. \nPlease fast, repent, and pray for Israel, America, and the world. We need to warn people and win souls. Our home is Heaven!  God can give us a little more time. So many aren't ready;  even among believers. \nThank you and the Lord bless you all!!!", 'Polly Wog': 'Pastor J.D. if u get a chance check out a utube channel called Manyfish...this man is very connected w The Holy Spirit...when u get to his channel then go to 10/19 about Haley...pretty amazing...I follow him...he will blow ur mind w what he sees...God Bless💕', 'Anglena Waller': 'The Bulletin idea is sooooo awesome...instant witnessing tool!', 'Laura Gittins': 'Spot on! Love your updates ALWAYS! Bless you J.D. !', 'Carmen Leeson': 'Brilliant bulletin idea, yes it is. God is good.', 'reality check': "The ABC's of salvation on the bulletin. Will you post a link to a printout of it we can use, with the building blocks images? Brilliant idea, yes!", 'Cheryl b': 'God bless you, thank you.', 'Thomas Robinson': "Honestly now if I ever visit Hawaii one of my stops would have to take part of J.D.s sermons. It's like a bucket list thing now. But it would have to be soon, because I'm much younger and we are not always promised the next day....so here's hope and prayer I can meet him face to face. I love his sermons.", 'D.J. Konrad': 'Dear Pastor, it looks like there may not be enough time for you to pick up and move to Ohio. Nevertheless, the Ohio door remains wide open to MY pastor... J.D. Farag!', 'sabdy bradley': 'I agree with you 100%.  Thank you for telling the truth. May God bless you and the work He has called you to do.', 'Anne Marie Fisher': 'Love it❣️❣️❣️❣️❣️❣️❣️❣️❣️❣️❣️', 'Gary Showalter': 'The Gospel of Salvation. 1 Corinthians15:1-4 KJV Trust in the precious shed Blood Atonement of Jesus Christ our Lord and Savior.https://youtu.be/w0ZH2cObK9U', 'Rand Jooe': 'Great Report Pastor JD..... Thanks For our Presentation    Keep Looking UP!', 'Gerardo Sanchez': 'Brother can it be that the UN is laying the red carpet for that man of the bible?', 'Ope Akinwande': 'This is greatly edifying...Glory to God!', 'Robin Crabtree': 'Amen! Lord, come quickly!!!', 'daniel6 victory': 'thank you for the brief written inserts. helps to concentrate. maybe leave them 1-2 sec longer.'}{'Huw Hodges': 'Hello from South Wales, UK, Pastor JD. I simply want you to know how much I value your online teachings and Bible prophecy updates, they really are blessings to me in my ongoing quest to bring family and friends to The Lord. Sadly with no local Church to attend, meaning the lukewarmness of local churches, I consider myself to be an online member of your church, with you as my pastor. \nGod bless you Pastor JD, and thanks for your teachings and for blessing me, In Jesus name.', 'K.A. Boncon': "Pastor J.D. you hit the nail square on the head when you mentioned demonic/demon possession. It is exactly what I see in the eyes of these people who are so vile, rabid, screaming, wild-eyed and full of hatred. You can just see it in their eyes and their behavior. I truly believe the Holy Spirit that lives in us can discern this. Like you said, it's not trying to be super spiritual it's just a fact. To me there IS no other explanation because normal people don't behave that way. Satan is doubling down because he knows his time is short. It is so apparent. But we know God has ultimate control and HIS will is being accomplished. I am not afraid I fully trust in the Lord. Praying daily for his soon return for HIS  Bride! I'm ready!", 'Snow Fox': 'So true:  THIS WORLD IS NOT OUR HOME!!!   Come quickly Lord Jesus!!!!!!!!!!!', 'Edward Wilson': 'Thank you so very much for your work to bring these events together in truth. I listen to you every week ( plus your sermons!) to get the honest and true picture of Middle East realities', 'David G': 'Amen brother!', 'LifesAjourney': '"We are living in exciting times where Bible prophecy is leaping off the pages!!" Knowing Jesus is my LORD & Savior is the ONLY thing that gives my mind & heart any peace... A quiet still peace that only Jesus can give us.', 'kim m': 'All I can say is this . . . \n       Spot on!', 'Bernie Sully': "Thank you Pastor J.D for bringing so many God's word.", 'SassyBashir': "I liked the track that was created out of the ABC's, good idea.. could you post a copy on your fb page so we can download it, make copies and give them to our neighbours... thank you JD..", 'bertotools': 'God is still on His Throne! Amen! God bless you Pastor!', 'Mike Smith': 'Always pray for the peace of Jerusalem', 'Tom Irr': 'I was praying to the Lord and he showed me that this is the eye of the storm. The calm before the wreck. May we all be found praying without ceasing, come Lord come.', 'Sylvie Pelletier': "PRAYER FOR YOUR “PROTECTION” GOD, ON TRUE AMERICA, OUR UNITED STATES CONSTITUTION, JUDGE BRETT KAVANAUGH, PRESIDENT DONALD TRUMP AND ALL YOUR SUPPORTERS, IN THE NAME OF JESUS CHRIST OUR LORD AND SAVIOR: HOLY SPIRIT RULES IN TRUE AMERICA! ALLMIGHTY, FATHER GOD IN THE NAME OF JESUS CHRIST, WHO LOVES ALL PEOPLE, AND IS THE HOPE FOR ALL HUMANITY: WE PRAY THAT YOU INTERVENE IN THIS WHOLE WORLD; YOUR WILL BE DONE ON EARTH AS IT IS IN HEAVEN;\xa0 WE LOVE YOU, PRESIDENT DONALD TRUMP, BRETT KAVANAUGH, and ALL YOUR SUPPORTERS; BE ABUNDANTLY FILLED, OVERFLOWED, OVERPOWERED, “UNITED” WITH GOD'S HOLY SPIRIT, WHO WILL GUIDE US ALL TO THE BETTER LIFE;\xa0 OUR FATHER GOD CAME ON EARTH, IN THE NAME OF JESUS CHRIST, NOT TO MAKE PEACE WITH “EVIL (who is only out to steal, kill and destroy souls)”, BUT TO SAVE AND FREE US “ALL” FROM EVIL; WE THANK YOU FATHER GOD, IN THE NAME OF JESUS CHRIST, FOR YOUR PROMISE AND PROTECTION, ON YOUR PEOPLE: Isaiah 54:17 No weapon formed against you shall prosper, And every tongue which rises against you in judgment You shall condemn. This is the heritage of the servants of the LORD, And their righteousness is from Me,” Says the LORD.", 'Robin Kirk': "Pastor, I woke up this morning feeling uneasy about the world. Then I grabbed my phone and immediately watched your update this week. Now I know what it was about...we need to be rich in prayer right now! Thank you so much for doing this each week! Please don't stop.", 'Barrie Smith': 'The people get the leaders they deserve to bless or destroy its good to have a teacher that is willing to speak up for the Lord Messiah Jesus', 'Flo Float': 'Thank you Pastor JD. God bless!', 'Nathan Dunning': "Here's a Game Changer. Donald Trump will declare Jerusalem the Capitol of Palestine..... That will be a betrayal of the Israeli nation. Which caused Nikki Haley to quit.", 'Rita': 'Be strong in faith because satin is waiting for us to fumble that ball.', 'PraiseToJesus7 ONLY': 'pastor JD...love your passion  for OUR LORD JESUS....\nlove watching n listening to your mid east updates....\nNOTHING HAPPENS BY CHANCE......NOTHING IS A COINCIDENCE.....OUR ALMIGHTY GOD YAHWEH IS IN FULL CONTROL OF EVERYTHING.....\nOUR LORD JESUS PUT THAT EVIL MUSLIM OBAMA TO TEACH AMERICA A LESSON...\nTHEY BECAME MORE N MORE GODLESS....LAWLESS....OBAMA COULD BE THE ANTICHRIST..\nBUT OUR LORD JESUS ALSO BY DIVINE INTERVENTION PUT THE BEST OF ALL PRESIDENTS THERE FOR AMERICA TO REPENT N REPENT N REPENT FROM THEIR EVIL WAYS....\nLORD JESUS PLEASE HAVE MERCY ON US ALL.....', 'john greenwood': 'thank you jesus that you are returning soon', 'Deborrah Dutra': 'I want a ABC track Great idea', 'Caroline Kirkpatrick': 'I am not so sure Satanists have no effect on Christians in the short term.  Look at what Satan did to Job.  Satanists can’t prosper, nor can their master, in the end of this story, though.', 'Pat Stauffer': 'Thank You JD And Everyone Watch Newnews Who follows JD,s Words...in the Name Of Our Heavenly Father For Such A Time As This!!!Hallelujah! Amen! 🔯⏳⌛️🔚🔜✝️🙏🕊❤️😇', 'lou starnley': 'I really like your videos and God is using you for sure you can count on that', 'Watching Waiting': 'Right on Brother!', 'Teresa Horner chase': 'Im so happy to hear you  i always look forward  to hear you. GBY and family. Love n angel hugs. Im excited  i think home  awaits us soon', 'Four-Corners-Foto': "The reason we are here. To resolve the Angelic Conflict or spiritual battle (video 16:20). We are here (the faithful believers in God and the Church aged Jesus believers) to prove that God's plan is superior to satan who revolted in eternity past and felt/proclaimed he could do a better job than God. Before God could cast satan and his group of fallen angles into hell, satan told God that if man was given the chance to choose who they wanted to follow that they would choose him. God being a just God allowed satan a specific amount of time to make his case. This time is the time of man 6,000 years (4K O.T. and 2K N.T.) Each dispensation within this 6,000 years deals with more specific debates that satan raised to God were in God couldn't send him to hell. The reason why the rules set forth by God changed from age to age, example: old testament to new testament, Hebrews 9:16, Leviticus 4, Romans 3:25 (Jesus's blood verses animal blood for sin). Adam and Eve age, Noah age, Abraham's age, Moses Age, Church age, tribulation age, Millennium age. (scripture dispensations/ages Hebrews 1:1, Eph. 3:5, 1 Cor. 9:17, Eph 1:10, Col. 1:25, Luke 18:30, Acts 3:21).", "The Watchman's Midnight Hour": 'ALL the signs ARE here!  Jesus is coming any day now!    \nYou are right!  Thanks for your powerful message!', 'sifu jedi': 'Thank you for your update, may the Lord continue to give you clarity to preach and inform us', 'Shari Whipple': 'JD keep on keeping on! Thank you for all that you do!', 'MrHotbulldozer': 'How do one understand the crazyness in the world today?\nWith the bible, Romans 1:28\nFurthermore, just as they did not think it worthwhile to retain the knowledge of God, so God gave them over\xa0to a depraved mind, so that they do what ought not to be done.', 'Linda Crossno': 'Evertime Isee these looney  liberals I see demon posseed ppl who ñeed JESUS CHRIST in their lives. They are so full of hate and violence and it shows through their  facial expressins and actions! They are truly demon possessed!...They do not realize JESUS CHRIST IS IN TOTAL CONTROL!..GOD BLESS AMERICA!....Look up ppl. Our redemption  draw th neaŕ !!! HALLELUJAH! ⛪⛪⛪', 'Jess DinDoNuffin': "why do all these pastors feel that yelling adds credibility to what they're saying? It makes the video very hard to watch! Goes from a whisper to yelling to back to a whisper. Why can't you just be like Hal Lindsey and respectfully make your point? Had to bail on this video...", 'Music Lover': "Ariel Sharon's decision to vacate Gaza -\xa0worst decision ever made by Israel in my lifetime.\xa0 Such a travesty...........Russia, Turkey and Iran were about to have a stranglehold on\xa0the world's energy via pipelines they could\xa0use to blackmail Europe,\xa0until US began to gain energy independence, became an energy exporter\xa0and began to take a tougher stance toward all three, including sanctions and tariffs, etc.\xa0 That NEVER would have happened with Pres. Obama.\xa0 They all would have been laughing at us, if HRC had become pres.........Demons and witches?\xa0 Their holy day, Halloween, is coming up right before the election.\xa0 The whole American left has been going into an hysterical frenzy.\xa0 Yes, of course it's demonic.\xa0 It has built to such an extreme pitch, it's as though the hot air balloon is about to burst.\xa0 God might be letting their entire movement commit suicide.", 'Dianna Shand': 'Prayers for them all. My God is still in Control. Jesus is coming back soon. Republican all the way. Again I say. God is still in Control. I’m just passing through this world.', 'Momma G': "Wow, yours and that pastors ABC tear out brought me to tears.  I also made brochures for an up-coming class that my pastor and his wife are letting me do on Jesus' return (PRAISE GOD! and prayers needed).  I put the ABCs on it as well!!!!!!", 'grace sue': 'un is Darkness!!', 'TyGreen': 'God Bless You Pastor JD Farag😊', 'Daniel': 'REV 3:8 8 I know your deeds. See, I have placed before you an open door that no one can shut. I know that you have little strength, yet you have kept my word and have not denied my name. LOVE for Jesus from Silicon Valley!', 'joe Long': 'At the time back about 3 or 4 years ago . I heard something . I could not believe it . It sound like a trumpet blowing . It did it several times . I dismiss it sound of a strong wind that day blowing against tin roof . To my knowledge There was no tin roof in my area . Couple months later I watch a utube thing about a women asking for help over in sweden . She was rape ; beaten and piss on while five old daughter watch on by two muslin men . I started to search for more stories . I found you J. D. Farag and more . Later found a utube explain what is going on . Oh boy ! This one person I did not believe him until started talking about the chaos that is coming the united states . He did not know I did a prophecy reading of me . In the reading that united states will be in chaos . But my life will be doing good .\n Brother to let you know you have reach me many ways . I plan to keep you for a while . I like listening to you .\nJoe Long salem iowa', 'Tara Carroll': "Thank You so much for THIS update!! I look forward to each one of your updates.  I really needed this reminder of GOD IS ON THE THRONE IN TOTAL CONTROL!!! \nPLEASE, PLEASE be praying for FLORIDA'S MID-TERM ELECTIONS!!! It is down right scary!!!! Speaking of these people under demonic possession... one of them is leading the polls in our Governor election!!! IT IS SCARY!!! \nPlease Pray!!! 🙏🙏🙏🙏", 'Jim Bob': 'I love you pastor JD you are such a wonderful creature that God has created God bless you and your family.', 'M T Corner': '👏👏👏clapping to you for saying, pray for these people, when you talk about them, instead of just talking about them!  I love Tucker’s personality and gestures too! You’re just like him!❤️', 'JESUS. MY CHOICE': 'Thank you sooo much for posting on you tube. Your Church is my Church also. Thank you for being YOU... You are a wonderful and truly a anointed Teacher of GOD... Thank you again... Love You Brother... Holy Spirit Filled   ❤❤❤', 'GODS GIFTS': 'May the Lord be looking upon us all in these last days.\nGOD BLESS YOU ALL!', 'Lenore Cline': 'God placed pastor Farag in the pulpit for this exact time. God Bless him.', 'Renee Roth': 'Looking Up, Come Lord Jesus, Come. 🔥🌈🕊🙏💛', 'Russ Bell': 'The end of the ✝ age approaches with ramming speed...\nThe chronos and the kairos\nMaranatha❗\n🕛🔜📯', 'Brenda Crockett': 'Thank you Pastor J D for always being willing to speak what God has laid on your heart.', 'remnant warrior': "Tucker reminds me of a turtle. If he was a cartoon character, he'd be a turtle.", 'Ms. Sonshine': "I too love this country.  My parents fled communist Cuba with us children in '62, and as a result we all became born-again Christians.  Our God is good!", 'Lori kornel': 'Do we know without a doubt that Trump and Kavanaugh are believers? I pray for them all the time also Bibi.', 'Sandi Wicks': "Thank you again, Pastor JD... your honesty and faithfulness to bring us these important updates! I'm praying for you and your precious family!! ☝️🙏🏼😊🇺🇸🇮🇱❤", 'J R': 'What a blessing,listening to this sermon.\nThe turmoil of this world,diminishes,knowing ,our Lord is Sovereign, over all peoples.', 'zaxu James': 'Palestinians are formerly aka philistines', 'Debra McCoy': "TRUST GOD.  REPENT DAILY, AND REMEMBER GOD IS SOVEREIGN.  JESUS'S BRIDE WILL NOT BE BRUTALIZED BY the devil. Pray without ceasing that you are found worthy as Jesus said.  Lord have mercy on the lost especially family members. In JESUS NAME!", 'Maria Hodge': 'Brother, I see your broken heart...I pray God fills your heart with His JOY!, even as I  write this...I know you" get it ". Millions of us "get it " because OF YOU!! It\'s also time to REJOICE!!!! THANK YOU BROTHER, WE LOVE YOU!', 'Sandie Sandersfeld': 'Thank you pastor for your messages. I’m so thankful that I found you on YouTube. Praying for you in South Dakota.', 'Mark Poirier': 'Acts 2:38 says; Then Peter said unto them repent and be baptized everyone of you in the name of Jesus Christ for the remission of sins and you shall receive the gift of the Holy Ghost!    Just believing in Jesus is not enough.....I hope it is but why would anyone want to take that chance .....this is the only way to apply the death burial and resurrection to a persons life', 'kj': "Love the ABC's on the bulletin!!!", 'SUZANNE BYRNE': 'May I ask for your prayers for my son.  I’ve seen in grief how he has been slipping down a. Very black path,  toward the devil himself.  I did NOT raise him to be lik3 this.  He will not acknowledge that he follows God at all.  He rarely speaks to me.  I do not want him to be lost for eternity. I have warned him what will happen.  He doesn’t respond.  This is my last hope.   God knows what to do.. He knows what will work.  Please pray for us.  Thank you. Rapture ready.', 'Shirley Zuber': 'I THANK GOD FOR YOU, listen every Sunday.', 'Virginia Vieu': 'Oh  Lord Jesus fill us with your HOLY GHOST POWER afresh over following,  give us wisdom, and discernment to speak life into others, touching them with grace that brings salvation .Lord use us your children in this hour of darkness  for your glory . Lord that souls will receive freedom and life through the blood and mercy that you provide.  In Jesus name amen.  Thank you pastor', 'Patricia P': 'Thank you, Thank You for preaching the TRUTH...i so appreciate you tell the TRUTH...i was beginning to lose hope.', '7stars': 'Yay God!', 'Waiting for His return': '❤️', 'Jill Maroney': 'Brothers and sister in Christ, I need your help.\nI want to know what to say to my grandson who is 7 years old.\nHe is afraid to go to Heaven. \nHe doesn’t want Jesus to come back yet. \n“Not yet,” he always says to me. I don’t want to go yet. \nI’ve spent many occasions sharing the Gospel with him.\nHe has excepted Jesus as his savior.\nMy concern is to know what to say to help my grandson, so he is not afraid to go to Heaven. \nHis parents don’t even want me to talk to him about Heaven. He’s to young, they say.\nPlease pray for my family. \nThank you all. \nGod Bless us all as we wait on His return.', 'karen turner': 'If that peace treaty is designed to take land from Israel God has told us what would happen to us....taking land from Israel will take away their ability to protect themselves....trump says it is time for the Palestinians to get their turn....all bets off for the u.s. and Gods plan is perfect...His timing is perfect! So yes praise the Lord!', 'Darlene Maul': 'Love your updates. So excited for the Rapture. This world is falling apart. My family is so under attack like never before. God help us in these last days.', 'Francois Major': 'Tank you brother and sister God bless you from Quebec Canada déliverance comming', 'Jody Davidson': 'Amen,  pray for our Lord and Savior to reveal Himself and the truth', 'Mr Wisdom': 'Evil people are mean because they need Jesus! 🙏🏽❤️', '333grace': 'Thank you for noting the demon possession.  Have been seeing it for years.  Lights on no one of sound mind home.  The house was swept clean when they got their position and 7 demons came in because they had no foundation with Christ, no compass point, no direction of where they should have been going, just did what they were told. (I know that is not a direct teaching on that passage, but it reflects what happens when so many are placed in power)', 'Little One': 'Psalm 14:3', 'Diana Moody': 'I have seen demon possession, too.  Satan is alive and well.', 'Vannessa Ledbetter': 'GOD BLESS YOU, YOUR FAMILY AND THIS MINISTRY.', 'Clark Freese': 'The Ashoggi disappearance or "accidental death," murder makes little sense. I say that because who profited or would profit the most from his demise. It would not be Saudi Arabia although they may foolishly be or have taken responsibility.', 'Judith Grubicy': 'Preach it Pastor. Amen', 'Max C': "Absolutely fantastic!!! Agreed 100% with everything and was blessed. Also agree about Tucker; the shining star of fox news. Love \nhis expressions and the way he doesn't let them get away with anything.Thank you so much and look forward to your weekly talk with great anticipation.", 'RAJAN VAIRAWANATHAN': 'VERY GOOD PASTOR. THE TRUTH AND NOTHING BUT THE TRUTH.', "D. O'D": 'Pastor; I believe your analytical mind has mined the depths of the Book of Revelation to its utmost! How many expert prophecy-minded Christians have put this together, regarding the economic condition of those three primary invaders of Israel and thought of the consequences thereof? Excellent! All I can add to this is "Come quickly, Lord Jesus"! Amen!', 'Karen Huebner': 'I said that just the other day....look at their eyes..so full of evil.', 'Servando Villarreal': 'God sent 7000 Hondurans a God sent for Trump it a plus for Trump . Democrats will have to justify on their position and the truth will come out .', 'Monte & Meridith': 'Monte and I appreciate the updates you share. By the way, we would love to have the same shirt your wearing. Very stylish. How do we get one? God bless you, your family, and your church.', 'nina wade': 'Amen!', 'Christopher-tipstrum Leslie-Stanley': "Oh no, another frigging Christian?\nHow can they be allowed? They must tell you before hand, by Illuminati rules. The deep core has a message for you, YOU'RE, ALREADY, DEAD.. IRRADIATION IS DONE, already, we,re all, Well Done. But no one knows, and no one tells. Except these truthers.\nCHRISTIAN, you WILL lose your physical body, how many heads have already been cut off? For the saints? Myrters must pay dividend.", 'Theresa Gilbert': 'Right on Pastor J. D.  We all need to be bold for Christ!', 'HwoarangtheBoomerang': "Amen! That pastor's bulletin idea is absolutely brilliant!"}{'truthisdivine': 'Rumor has it Trump and company will propose a 2 state solution.  God does not want Israel divided and will never allow it!  If someone would sit down with President Trump and explain biblically why this would be the worst and most dangerous thing he could possibly do having  worldwide ramifications I ask you, would he reconsider?', 'Christopher-tipstrum Leslie-Stanley': "Don't even try to get it on YouTube. \nYou will be baffled in B.S. You must mind their footwork. You , can not say what you want here.\nOnly what, THEY want. FRACK THEM! Say what you want, but you'll be edited if you're not liked.", 'Exile 311': 'The ABC’s on the bulletin...so awesome!!!!!  You can even leave it on random car windows', 'Vickie McIlroy': 'Come Lord Jesus!!!', 'Not Backing Down': 'Is there any way to get a copy of your bulletin in order to use it as an example?', 'william van dyke': 'please pray for my brother Bob who does not know the Lord and is in bad shape do to drinking', 'T Nelson': 'Excellent Pastor,', 'Marilyn Derochie': '🙏🏻Amen💚', 'Paul Peterson': 'His info of the firebombs in Israel goes hand in hand with the fires in Cal. wine country started with DEW weapons.', 'Richard Rogers': 'Tyvm Pastor JD for great update. Maranatha!', 'Rodney Fowler': 'Red tide in Florida  Hurricane Michael. Flooding   Catastrophe after Catastrophe', 'Andy Menchaca': "Dude, Paster,  my brother.  At 36 minuites in or around.....regarding the church flyer/ABC's. I love it. I'm telling my Paster and church elders. Awesome.", 'Henry Werth': 'I enjoy and look forward to these messages each week.  They feel spiritually soothing and substantial...if that makes sense to anyone....', 'Gwen Hoang': 'God is on the throne!  And he’s hearing our prayers.  So only things God ordain will happen.  He’s in control as Pastor Farag is saying!!!  Please be truth to yourself and have a relationship with Jesus.  Because that’s the only to be holy!  We can claim to be a believer but without the relationship we’re deceiving ourselves.  God blessed.', 'Samuel Spatafore': 'Hi Pastor Farag..............thank you so much for having passion and fire when you talk about these things.  There are pastors that do talk about end times, yet they are very timid (wimps) about the issues.', 'jj foster': "Always a blessing to hear from you JD. I'm looking up and will continue to do so until our redemption draws in and up we go. Amen and Amen!!! God bless you brother JD!", 'Peter Sz': "With all due respect Pastor JD. \nYou ask who cares about the dead Journalist? Why is it a big deal?\nI ask who cared about Pastor Brunson? Did we have a problem with his imprisonment being a big deal? Did we scream that it was a political game to sanction Turkey?\nNo we didn't.\nI'll tell you, both cases matter. Both are important. I don't care about the political games, we should care about injustice and suffering.\nI'm not that great with words, but we shouldn't dismiss a death just like that. \nAnd yes Tucker is wrong, he is always quick to mock his interviewers, I know they are often misguided , but it's not the Christian way to mock and scoff \n\nGod bless you Pastor JD. Apologies for the strong words. I am no one important, but your words hurt I had to write", 'S Nelson': "Haley recommends Michelle Bachmann for a replacement.  She's already involved in the UN.", 'Kathreen Margaret': 'Thank you, Pastor JD Farag, and sharing on Facebook etc.', 'marsack7': "Here in .CA they have not sent me my mail in ballot. I have phoned them twice. If I don't get it it will be a 3 to 4 hour drive to vote at the polling place. There is not enough time to get ballots to our armed forces in time for them to return them in time. I think this is on purpose so the conservative votes can't be counted. If I don't get one by the end of next week, I will have to report this. To whom? Anybody? Anyway I'll have to look it up. The airmen in Afghanistan cannot come home to vote. So typically .CA.", 'madammim': 'from here on out, every election will be just as important as nov 6th, we have to stay vigilant', 'Pam Kemnitz': 'Praise Jesus!    Excellent, excellent, love you JD.', 'Sherriden Keogh': 'JD. I would love to be able to order some ABC tracts to hand out in my own city. I live in Canada. Is there a way we can order them online for the cost of printing and shipping? Or perhaps post a printable version on your website?', 'Steve edinger': 'Remember God is in control stand strong stay alert and may the Lord be with you. God bless', 'Donna Diesburg': "You can see they're possessed.  We pray for them and pray they're agenda doesn't prosper", 'Susan Bone': 'God is STILL onn the throne, indeed!  Praise God, and thank you for your only begotten son who you sent to save and redeem us!  My redeemer, my savior, my beloved father in heaven!  Thank you Pastor JD for bringing us the truth.  My church does not speak of Revelations.  It is very sad...so many have no idea where we are on the Holy Calendar of our Perfect Creator!', 'Jennifer P': "I'm confused on the one yard line thing JD is talking about that go along with the 4 things he was talking about. Can someone explain it please? Thanks", 'Teresa Norman': 'Powerful message.\xa0 Thank You Jesus for Pastor J.D. Farag.\xa0\xa0 I am from Gulfport, MS\xa0\xa0\xa0 AMEN.', 'Norilyn Carpio': 'Why the outrage of the death of this journalist who is not an american citizen but there was no outrage by the msm media about the US ambassador and 3 other US  citizen soldiers at bengazi during obama era? This is propesterous and hypocracy by the democrats and the msm lying media!', 'Cherri Blackmore': 'God bless you Pastor J.D. and your church.', 'Shelly L. Snow': 'Amen Brother!! I agree, we’re sit’in on a powder keg!', 'Chris Ian Angelo Hermosilla': 'Amen!!!', 'The Truth': 'HOW ABOUT ---PUT IT (TRACT) ONLINE HERE SO WE CAN PRINT AND USE!!!  THANK YOU FOR YOUR WONDERFUL TEACHING!!', 'Caren  Willaby-Moore': "I recently noticed that Tucker wears a red string bracelet, left wrist. You can see it if you look closely. It came out in full view not long ago when he was debating someone..that's how I saw it.", 'Linda Pell': "JD I use the ABC's on my Facebook page. Thank you. Lots of Love from poughkeepsie Ny.", 'My interest': 'Can you share a printable version for us to print out and share of the ABC’s and scriptures?', 'Simply, Follow Me TM Christian Ministries': 'May Our GOD Almighty Bless And Protect YOU (and your family), Pastor JD, IN His Mighty Way, today, and every day.  Amen.', 'K B': "Tucker is good..I've noticed his face..pretty good man", 'Horse woman2000': "Please provide a link for the ABC's so we can print these out and pass them along.", 'Threek2d': 'I Love Pastor JD !! I must however speak for scripture ! Read Ezekiel carefully as I may be wrong, but it seems to say that the armies will Already be gathering , Before the Evil thought comes into play about the Spoil ???', 'Ros Rowe': 'Re the curses being pronounced over Kavanaugh: Proverbs 26:2', 'Shari McLaughlin': "I am waiting and so longing to come home!!  Thank you for my salvation and your plan of redemption Father God in the mighty Name of Jesus.  I can't wait to bow down and lay a crown at your feet.  Forever grateful and filled with joyful hope!!! xox", 'Louis Smith': 'THANK YOU PASTOR.', 'Cassie Thornburg': "Oh pastor my pastor I'm so thankful your parents brought you here to America!", 'patrick riley': 'Cheshvan 22 and 23 = Shemini Atzeret and Simchat Torah , + 30 days.  SA and ST are the days of assembly.  And what a coincidence!  These days incorporate Hallowe"en!  Can you think of a more appropriated day to bug out?', 'Kim Dalton': "Every Sunday night when I watch your prophecy updates, I always wonder if it'll be your last one.  Come quickly, Lord Jesus.  We want to go Home.", 'Ol cat lady.': '👀', 'Dianne Rogers': 'Great idea with the bulletins! I love that!!', 'Blessed Hope': 'I BELIEVE that TRUMP was brought in by GOD for the greatest spiritual awakening of GODS children.  Trump is going to expose the deep state cabal and when the masses understand the evil that has been perpetrated against this country, people are going to wake up.  News is coming out about the sick, evil disgusting practices that the elite have been doing.  Precious children have been done so wrong.  It is so graphic, so evil, so hateful and depraved.  I am so THANKFUL that we have a PRESIDENT who is BRAVE enough to bring these people to JUSTICE!  We need to keep POTUS, his family and those sworn to protect him in PRAYER constantly!  We need to PRAY that evil is exposed and those who do harm and evil be prosecuted to the fullest extent of the law.  I see Hillary and Obama going down in flames.  I want to see that but what I want to see most is the RAPTURE!  I am so worn out, so beat up, spiritual attacks on me are relentless, BUT GOD!  Love you ALL!  Thank you JD!  Much love to you, yours and your beloved congregation!  Maranatha!', 'Lydia Harvey': 'Pastor JD I look forward every week for your awesome sermons. I pray for people salvation but most of all come Lord Jesus come.', 'Rachel Lynn': 'Praise God! Thank you so very much Pastor JD. I have uploaded some of your videos onto my channel. I love how you share the ABC’s for the lost and I pray more people ask Jesus into their hearts. We could go home anytime, the birth pains keep increasing everyday. Every day is a gift and tomorrow isn’t promised. I love you and all of my brothers and sisters in Jesus name. God bless you all always!', 'Lynda Thompson': 'I agree that ALL these protesters are demon possessed!!  Love Mid East Prophecy updates.  The highlight of my Sunday after my church!!!  I have turned my Pastor onto your updates and at our Wednesday Bible study, we are studying current events as prophecy pertains to it and he has been showing some of your videos!!!  Church of the First Born,  Hailiimaile Maui, Hawaii!!!', 'Chris C': 'Good for you Pastor JD. Tell it like it is! God Bless.', 'Betsy Taylor': 'God bless this man and then some :0) great apostle for Christ.', 'Thomas Wilson': 'Pastor Farag,  I notice you never say anything about voter suppression. Why is that?', 'Sally  Idol': 'We are going home! Ready?', 'marcie harris': 'We love you Pastor J.D.✝️\nWe believe Jesus is coming for His Bride soon! ❤️Luke 21. Praying for the peace of Israel 🇮🇱 & America🇺🇸', 'Sherry Sterling': 'Thank you for yet another wonderful update! PLEASE my brothers and sisters PLEASE.. VOTE!', 'Stive Rosen': 'In might be just due to more time having passed by but every day trump in office israel in more and more danger.', 'bradenevans514': 'I saw Jesus when I was 15 years old. I was very defiant and refused to believe in Him unless I saw His face. He showed me his beautiful face one night in a very colorful, vivid vision. I have never been the same.', 'denbehar2010': "I don't miss any of your messages... I feel parte of your church! And since I feel part Calvary Chapel I was very excited to find this in my country!!!! Calvary Chapel Antigua in Antigua Guatemala", 'lori0319': 'Please pray for 11 yr. old Evan, parent alienation syndrome, he is so hurt and angry, Lord please help him🙏', 'anne mott': "can you put a copy of that bulletin on the web page so I can make copies?    I think it's a great idea.", 'Sharon Andrews': "My family just lost a beloved member who loved Jesus with all her heart and always talked to others about Him. I am not sad, (although, I will miss her while I'm here) as I know she is in the love of Jesus right now and ecstatically happy! I am SO happy for her and can't wait to see her soon, as soon, we will meet Jesus!\nMaranatha!", 'Joanie Elmore': 'https://qmap.pub/', 'maggie ann': 'HalleluYAH. Maranatha, Amen 😊', '1johnmthompson': 'Pastor a Saudi national died on Saudi soil at the hands of Saudis why is this an issue for America', 'Lawrence Foster': 'black swooon.', 'Betty Hensley': 'Who is ur favorite Pastor an Thank you Pastor JD...', 'riffraffrd': "Heather heather heather........ even he say's he needs to stop yelling....... every time he starts yelling he says, okay, I need to stop yelling..... since when has the truth ever needed to be yelled at someone? does it have more effect that way for you? Remember God's voice is in the still small voice. In other words I don't need someone to yell at me to have it get through to me.", 'Toni Olson': "It's always about the money with Donald Trump. People just have to remember that. Donald Trump would start a civil war if it would guarantee his re-election in 2020. \nGod had to use Pilate to fulfill prophecy, what will be will be. I just pray for our Leader's salvation , discernment and wisdom. God have Mercy on the United States of America.", 'Toncor12': 'Psalm 83 war very soon then rapture shortly after, then Ezekiel 38 event; then peace treaty and rise of A/C....guaranteed by 2025', 'Duane Kent': 'Just nuke the Gaza strip, problem solved', 'Collette Blanchard': "The Satanist's have no power over us!  They're a joke!", 'sedentaryire': 'tucker is the best', 'ATrustedAuthority': 'Romans 3:10 As it is written, There is none righteous, *no, not one* :\nPsalms 53:3 Every one of them is gone back: they are altogether become filthy; there is none that doeth good, *no, not one* .\nPsalms 14:3 They are all gone aside, they are all together become filthy: there is none that doeth good, *no, not one* .', 'John Arruzza': 'The group of 77 is doomed . they are out of their minds', 'John Skee': 'Thumbs up, JD!', 'Ginai Doma': 'Christians need to understand this to understand the Bible. The New Testament did not start till the death of Jesus Christ. The life of Jesus Christ before His crucifixion was part of the Old Testament. Jesus Christ came to fulfill the law and the Old Testament.\n\nGal 4:4-5 But when the fulness of the time was come, God sent forth his Son, made of a woman, *made under the law,*\n*To redeem them that were under the law,* that we might receive the adoption of sons.\n\nHebrews 9:11-18 But Christ being come an high priest of good things to come, by a greater and more perfect tabernacle, not made with hands, that is to say, not of this building;\nNeither by the blood of goats and calves, but by his own blood he entered in once into the holy place, having obtained eternal redemption for us.\nFor if the blood of bulls and of goats, and the ashes of an heifer sprinkling the unclean, sanctifieth to the purifying of the flesh:\nHow much more shall the blood of Christ, who through the eternal Spirit offered himself without spot to God, purge your conscience from dead works to serve the living God?\n\nAnd *for this cause he is the mediator of the new testament, that by means of death,* for the redemption of the transgressions that were under the first testament, they which are called might receive the promise of eternal inheritance.\nFor *where a testament is, there must also of necessity be the death of the testator.*\n\n*For a testament is of force after men are dead:* otherwise it is of no strength at all while the testator liveth.\nWhereupon neither the first testament was dedicated without blood.\n\nSo you have to understand that *the New Testament did not start until the death of Jesus Christ.* That being the case, the testimony/ministry of Jesus Christ was directed to the Jews and the Nation of Israel.\n\nMatt 15:24 But he answered and said, I am not sent but unto the lost sheep of the house of Israel.\nMatt 10:5-6 These twelve Jesus sent forth, and commanded them, saying, Go not into the way of the Gentiles, and into any city of the Samaritans enter ye not:\nBut go rather to the lost sheep of the house of Israel.\n\nThe parables Jesus spoke were directed towards Israel. The parable of the 10 Virgins were for Israel during the Tribulation Period. Failure to understand this is failure to rightly divide scriptures.\n\nThe Church is not under the law:\nRomans 6:14 For sin shall not have dominion over you: for ye are not under the law, but under grace.\nGalatians 5:18 But if you are led by the Spirit, you are not under the law.\nJames 2:10 For whoever keeps the whole law but fails in one point has become accountable for all of it.\nGalatians 3:10 For all who rely on works of the law are under a curse; for it is written, “Cursed be everyone who does not abide by all things written in the Book of the Law, and do them.”\nGalatians 2:16 Yet we know that a person is not justified by works of the law but through faith in Jesus Christ, so we also have believed in Christ Jesus, in order to be justified by faith in Christ and not by works of the law, because by works of the law no one will be justified.\nRomans 4:15 For the law brings wrath, but where there is no law there is no transgression.\nRomans 3:20 For by works of the law no human being will be justified in his sight, since through the law comes knowledge of sin.\nGalatians 3:24 So then, the law was our guardian until Christ came, in order that we might be justified by faith.\nGalatians 3:11 Now it is evident that no one is justified before God by the law, for “The righteous shall live by faith.”\nGalatians 2:21 I do not nullify the grace of God, for if righteousness were through the law, then Christ died for no purpose.', 'JesusSaves RunningRaven': 'Love Tucker', 'XspeedXracerX': "Thank you, JD!  These updates are very much appreciated. God bless/protect you, ministry teams and families in Jesus' name. Amen.", 'karen putteet': 'I tell you pastor J.D. your spot on it God bless you thank you for your videos an the information that you give to us the kingdom is coming let us prepare in Jesus name keep us in the shadows of your wings an in the palm of your hand amen keep the updates coming brother', 'Helen Maicoo': 'Thank you Pastor for your updates and teachings. God bless you and your family!', 'virgil dolph': 'I was talking with my Lord Jesus this past week.  I laid out all of the hate, violence, deception, murders,  rapes, persecution etc that I see world wide.  When I paused the Lord said "The people will look upon THIS time as the calm before the storm".  I had just laid out a very ugly picture of the state of the world whike praying against the darkness and evil and God said "The people will look upon this time as the calm before the storm".  This day is calm, compared to what is coming.  People have no idea of what is coming.  "It is coming".  We can read about it in the bible but reading about it is not being in it.  Just like salvation, until our souls are cleansed by His blood, our souls given life and changed by the touch of the Father by His Holy Spirit, we can not know.  We can read about salvation and listen to people talk about their salvation but we can not know until we are touched and made alive by God.  We had best be as prayed up and obedient as we can possibly be.  The unsaved and luke warm have even less understanding.  Repent, repent, repent and STAY at the feet of Jesus, like Mary, Martha\'s sister.  The "needful things will not be taken from her" (us).  Work while we still have light, darkness is coming.\n\nGod bless you in your service to Him.\n\nJoe', 'JR Christlove': 'Hallelujah!', 'S D': "UNTIL THEN IT'S GAME ON,...PRAYING FOR THE LOST TO BE FOUND AND COME TO JESUS. I LOVE YOU JD. GOD BLESS.", 'yola mari': 'Thank you for this update Pastor J.D.  May God bless you all...Maranatha!', 'George Alifrangis': 'Love you brother ...peace 🇬🇷🙏🏼👍🏼🇮🇱.\nThank you', 'Karen Arnold': 'AMEN!!! GOD IS STILL IN CONTROL REGARDING AMERICA, AND ALWAYS WILL BE!! NO FEAR... NO ANXIETY... FOR JESUS IS  COMING... AND SOON!!!', 'Peggy': 'Thank you for being upfront and not politically correct. Thank you for preaching what needs to be heard and not being afraid of saying the wrong thing. Those democrat leaders do need Jesus. The whole Democrat platform is anti-God. What I want to know is how a Christian can vote Democrat? Do they not know what the Democrat platform is?'}{'Denny T': 'TO ALL WHO ARE HURTING AND DESPERATE - This is for you\nIt has been said that when you have lost all hope, and all you see is darkness, always remember,” the darkest hour is just before dawn”. Don’t let your life be defined by desperation and hopelessness, Reach out to Jesus, He does His best work in dark places. Let the light of Christ shine within you. The very fact that you exist is God’s testimony of His love for you. Never Give Up. Receive Christ now, He is the caretaker of your soul. The Gospel message was created for you. The simplicity of the Gospel, - Here it is   A=Admit you are a sinner (Repent)   B=Believe Jesus is Lord   C=Call upon His name.  God Bless You Today.    AMEN', 'mary poppins': 'Thank you Pastor. Great update!.Awaiting HIS return \\o/...watchman from California. I think “never let a good crisis go to waste” is from Saul Alinsky’s Rules for Radicals, (book dedicated to Lucifer)Obama’s Bible. Obama is the best straight A student of this sick philosophy.\nPraying born again believers are going to VOTE for biblical values. Republicans are closest to our values, LIFE marriage and freedom.', 'Doty !': "Realized I've been watching your prophecy updates for over a year now. They've truly helped me get more close to Jesus our Lord and savior. bless you JD and thank you!", 'ANNA LUCAS': 'The slain journalist a friend of Bin-laden and a member of  Alkyd,  employed by Washington post?  A big loss?  He was probably in on 9/11.', 'Faith Koch': 'Excellent Pastor J.D.!  Soon, the King will come & bring His Children HOME!  Marathana!', 'Darlene Halton-Maple': 'That is soooo Cool JD!!!  Thank you!  Can we Download and print a copy of your Bulletin and print it to pass out around here?!?  Restaurants, etc...\nAnd.... Btw, thank you for YELLING, sometimes it’s good to get a lil Spiritual Justifiable Anger Going...  \n    Jesus did!  \nHe flipped tables over!?!  Yet he never sinned, so I don’t believe it’s  wrong!  \nIt was totally justified by Holy Frustration!!    \n   We humans sure know how to get ones Dander up sometimes!!', 'Juan Botero': 'May The Almighty God bless you, greetings from Holland', 'Donna Phoenix': 'Amir mentioned that USA&ISRAEL May attack IRAN, what say you! It wouldn’t surprise me considering IRAN’s threats to annihilate Israel and death to USA', 'Rebecca Cremo': 'I love your point of how the government was not exactly pro-Christian when Paul was turning the world upside down for Christ. Great reminder of how God’s plans do not center on or depend on the ever-changing geopolitical landscapes of our various countries.', 'Mar Jo': 'Thank You JD for your love of the LORD ❤️ and always giving HIM all the glory! Godspeed and see you in the air very soon!', 'Iknownothing !': "How strange, JD I'm 3hrs into the screwtape letters myself... A very clever book. How bazar is that 😊🙏", 'Rhonda J': 'I know these ABC’s by heart.  I became a believer in 1995.  But hearing it still makes my eyes water and my heart race.  It never gets old.  Thank you, Pastor.', 'VikingKitsune': "Hey, Pastor! Do you have an image of that that we coud use online? or print out? I'd love to use something like that!", 'Lisa777 There is a better way': 'Thank you Lord for healing my body through prayer, fasting, and detoxing my Temple. Feeling blessed. Great message. Hugs', 'Belinda Edenfield': 'Kamalla Harris, Maxine Waters, Diane Feinstein ... too.', 'Daughter of the King of Kings': "Thank you Pastor JD, I wait for your updates each week, online,  here in the UK.  They are such a blessing to us and so helpful to understand what is happening in the Middle East as shown through bible prophecy.  Please don't stop ! ......Watching and longing for our Lord to come and take us home.....See you in heaven .....Maranatha ! ♥", 'Andrew Smetana': 'Does anyone think Obama was President by accident? God allowed him to be in that position because it served His purpose in bible prophecy.  Just as Trump is in there now God is in control!!', 'Carol King': 'WOW!  Such a timely message!  I find myself being worried/scared thinking about the elections. What if the other side wins...what will happen?  Will all of the good be overturned?  What good news to remember God is in control....even if the other side wins!  Your update was exciting when you said we are maybe just 1 move away from Him coming for us.  Oh, I can’t wait!  Thank you again JD for your faithfulness to our Lord.  Can’t wait to meet you someday and say thank you!', 'WatchmanOn TheWall': 'It is true, God was not surprised that Trump was elected president. It occurred to me many years ago that nothing ( and I mean *NOTHING* ) ever “occurs” to God!', 'Hope Howard': 'Kashogi is the cousin of Dodi Fayed and this was a failed coup money was brought to the table so it is no longer an assassination. And since both King Salmon and Prince Salmon were shot and killed in April who is really running the show???', 'Keith Ehredt': 'Prayed for Ned Mandingo. GOD WILL answer.', 'Sharon Montgomery': 'Hugs...love and prayers from Northern Ireland 🙏🙏❤', 'truthmatters': "When these things begin to happen our redemption is nigh...doesn't it seem like they began a long time ago...where are You Lord...I know, You will come in Your time.\xa0 We must be patient..", 'Eric Henry': 'Pastor J.D. - At least you are not an NPC. \nKeep up the good work.', 'Butch Rishel': 'I attend a very loud,and lively church.l like the way you arent scared to get loud to get your message accross.keep being loud,brother.luv ur sermons.', 'barnum99': 'Thank you Jesus!', 'Dawn Crafts': "JD the Lord led me to you months ago, end of last year. Your sermons on Bible Prophecy are amazing . You are blessed , thank you for all your words. I'm ready to go home , that trumpet will sound   and we will meet the Lord in the air. Come quickly Lord.", 'SuZEQ': 'God bless you Pastor JD. We love you and we love America. It hurts to see what is happening to my country now but I take comfort in knowing God is in control! This is not our home. Our home is with Him. I am so ready to be called home. God bless you. Always in my prayers ❤️', 'Nona Baker': 'Pastor Farad, I love your comments every week, but I disagree that it was America that brought you to the Lord!  You were chosen before the foundation of the world by God Himself and are secure in Him forever!  Please give Him the credit.........He brought you here and made sure you became His.  God Bless you forever!', 'Albert Gunter': "I've heard it said Kashaoggi was a member of al-queda....a terrorist or if you prefer a terrorism supporter, was murdered and dismembered...so where is the loss?", 'Jada Parks/Villanueva': 'I vote via absentee ballot too...already Voted.  Yes, my brother, there’s so much going on in our world but, GOD is in control of everything. Even so, Come, LORD JESUS.  Our whole world needs prayer and JESUSy, pastor.  Our LORD will one day deal a headache to this world that no painkiller can get rid of.  The RAPTURE is soon enough.  Just be READY TO GO, saints.  Have a HOLY SPIRIT filled week.', 'Lynn Carpenter': "I sat on my bed and cried in 2006 when they-Bush threw everybody out of their houses (the jewish settlements) in Gaza and look at it today. What does that tell you? These Arabs don't know how to run anything. They're worse than the Democrats or big govt running anything well. Only Egypt, Lebanon, and Iran, who for the most part educated in US, and their protegies. They were fighting and killing each other before the US got involved and they created OPEC, our death sentence on peace in the Middle East. Thank-you HW & GW Bush for 9-1-1, globalism, money laundering, and OPEC, and then out-of-control paid Deep State militants everywhere since JFK, Malcolm X and Dr MLK, including south of the border marching caravan over the Mexico Bridge. There are paid assassins in this group and they are going to kill people and blame the US; just ask the dead and injured Mexican officials from two days ago. All the ones with full face black masks and hiding behind pregnant women carrying guns. Women make up about 1% of this entire population of 5k+. And there are some Big Guns not just sticks. Some are Mercenaries (Russia, UK, Aussies, S African, Canadian), white, brown & black. The leaders speak about 5 languages each. Watch Black Conservative Patriot. He never was political, and now cannot help himself, and very well educated/intelligent, well traveled, and USA Hispanic Patriot.", 'Marlene Hager': 'Thank you Pastor J.D. for your uplifting words.  I always feel certain that the rapture is coming any minute after watching you.  God bless you and your family.', 'riffraffrd': 'J.D.  Please stop yelling!', 'glenn goodale': 'Terrific update', 'Benji Mange': "Game Changers happen all of the time, especially as things are\xa0accelerating. It's like reaching all new highs. With all new highs it resets the previous standard or bar. What once was\xa0anticipated is no longer acceptable. So you can use game changer over and over again!", 'Karen Walton': 'God bless you, your family and church members. I look forward with great anticipation to your weekly sermon and prophecy updates.', 'Heather F': 'Amen JD no weapon formed against us will stand no curse will hold because God is greater than the evil in the world. GOD WINS everytime.  Hopefully these santanic people will wake up and turn to Christ.  Love you JD thank you for your truth and thank you for these updates.', 'Time  Keeper': 'Shaping up to be a strange world ,most all world leaders and corporations have no empathy they are planning or plotting world domination through deceit and lies the masses follow , God holds Us in all truth we see through their propaganda ..I can understand why they will wage war on the Saints in the last days.  All being revealed', 'Sylvia Rivera': 'Soon, we will bow down with tears of joy streaming down our faces to the Lamb of God, who is worthy and shed His Blood for us..', 'Sister Liberty': 'Yes, Tucker is loved. However, we love you even more dear pastor.  We are family!  Blessings!', 'Warrior4Jesus71': 'Hi If I may Suggest, Lets tell others about Jesus Christ while We can before the Rapture to further the Kingdom on all Social Site/Platforms Amen.', 'Joanne Moore': 'Best part of my week 😀', 'Alan Graveen': 'God Bless you JD thank you for your weekly updates getting us ready for the Rapture!', 'Denise Fetter': 'Thank you Pastor Jd!!', 'N, Rob': 'Great update. Please pray for 27 y/o Charli who just had open heart surgery Mon so she can stay alive till the Lord comes for us & that the Lord would use this ordeal to ripen us. 💨', 'Mike': "God bless you all and please pray for me and my family, Don't want me and my family to be evicted. Thanks and rapture ready", 'scoffers & Mockers,make me laugh': 'Bless the Lord Jesus', 'Dano S': 'Terrific update Pastor JD', 'Gary Gothlin': '2nd to comment.   The Lord Jesus Christ Saves....How To Be Simply Saved.\xa0\n\n1. The bad News. We are sinners. (Romans\xa03:23.)\xa0\nWe deserve to be punished in hell for our sins.\xa0\n\n2. The Good News. Jesus Christ who is God’s Son died on the cross for all of your sins. He was buried & rose again to give you eternal life in heaven as a free gift. (1 Corinthians 15:3-4. Romans\xa06:23.)\n\n3. How am I saved? Believe on the Lord Jesus Christ and thou shalt be saved. (Acts\xa016:31.)\xa0\n\n4. Once saved, always saved.\xa0\nJesus said in John\xa06:47. Verily, verily, I say unto you, He that believeth on me hath everlasting life.', 'Emerald Gate': "CE (Christian Era) 1/1/0001 through 11/1/2018 is 737,000 days. Strong's G737 means NOW. Strong's H737 means DINNER.", 'Ghost Pepper': 'First!!! 😂👍'}{'Denny T': 'TO ALL WHO ARE HURTING AND DESPERATE - This is for you\nIt has been said that when you have lost all hope, and all you see is darkness, always remember,” the darkest hour is just before dawn”. Don’t let your life be defined by desperation and hopelessness, Reach out to Jesus, He does His best work in dark places. Let the light of Christ shine within you. The very fact that you exist is God’s testimony of His love for you. Never Give Up. Receive Christ now, He is the caretaker of your soul. The Gospel message was created for you. The simplicity of the Gospel, - Here it is   A=Admit you are a sinner (Repent)   B=Believe Jesus is Lord   C=Call upon His name.  God Bless You Today.    AMEN', 'mary poppins': 'Thank you Pastor. Great update!.Awaiting HIS return \\o/...watchman from California. I think “never let a good crisis go to waste” is from Saul Alinsky’s Rules for Radicals, (book dedicated to Lucifer)Obama’s Bible. Obama is the best straight A student of this sick philosophy.\nPraying born again believers are going to VOTE for biblical values. Republicans are closest to our values, LIFE marriage and freedom.', 'Doty !': "Realized I've been watching your prophecy updates for over a year now. They've truly helped me get more close to Jesus our Lord and savior. bless you JD and thank you!", 'ANNA LUCAS': 'The slain journalist a friend of Bin-laden and a member of  Alkyd,  employed by Washington post?  A big loss?  He was probably in on 9/11.', 'Faith Koch': 'Excellent Pastor J.D.!  Soon, the King will come & bring His Children HOME!  Marathana!', 'Darlene Halton-Maple': 'That is soooo Cool JD!!!  Thank you!  Can we Download and print a copy of your Bulletin and print it to pass out around here?!?  Restaurants, etc...\nAnd.... Btw, thank you for YELLING, sometimes it’s good to get a lil Spiritual Justifiable Anger Going...  \n    Jesus did!  \nHe flipped tables over!?!  Yet he never sinned, so I don’t believe it’s  wrong!  \nIt was totally justified by Holy Frustration!!    \n   We humans sure know how to get ones Dander up sometimes!!', 'Juan Botero': 'May The Almighty God bless you, greetings from Holland', 'Donna Phoenix': 'Amir mentioned that USA&ISRAEL May attack IRAN, what say you! It wouldn’t surprise me considering IRAN’s threats to annihilate Israel and death to USA', 'Rebecca Cremo': 'I love your point of how the government was not exactly pro-Christian when Paul was turning the world upside down for Christ. Great reminder of how God’s plans do not center on or depend on the ever-changing geopolitical landscapes of our various countries.', 'Mar Jo': 'Thank You JD for your love of the LORD ❤️ and always giving HIM all the glory! Godspeed and see you in the air very soon!', 'Iknownothing !': "How strange, JD I'm 3hrs into the screwtape letters myself... A very clever book. How bazar is that 😊🙏", 'Rhonda J': 'I know these ABC’s by heart.  I became a believer in 1995.  But hearing it still makes my eyes water and my heart race.  It never gets old.  Thank you, Pastor.', 'VikingKitsune': "Hey, Pastor! Do you have an image of that that we coud use online? or print out? I'd love to use something like that!", 'Lisa777 There is a better way': 'Thank you Lord for healing my body through prayer, fasting, and detoxing my Temple. Feeling blessed. Great message. Hugs', 'Belinda Edenfield': 'Kamalla Harris, Maxine Waters, Diane Feinstein ... too.', 'Daughter of the King of Kings': "Thank you Pastor JD, I wait for your updates each week, online,  here in the UK.  They are such a blessing to us and so helpful to understand what is happening in the Middle East as shown through bible prophecy.  Please don't stop ! ......Watching and longing for our Lord to come and take us home.....See you in heaven .....Maranatha ! ♥", 'Andrew Smetana': 'Does anyone think Obama was President by accident? God allowed him to be in that position because it served His purpose in bible prophecy.  Just as Trump is in there now God is in control!!', 'Carol King': 'WOW!  Such a timely message!  I find myself being worried/scared thinking about the elections. What if the other side wins...what will happen?  Will all of the good be overturned?  What good news to remember God is in control....even if the other side wins!  Your update was exciting when you said we are maybe just 1 move away from Him coming for us.  Oh, I can’t wait!  Thank you again JD for your faithfulness to our Lord.  Can’t wait to meet you someday and say thank you!', 'WatchmanOn TheWall': 'It is true, God was not surprised that Trump was elected president. It occurred to me many years ago that nothing ( and I mean *NOTHING* ) ever “occurs” to God!', 'Hope Howard': 'Kashogi is the cousin of Dodi Fayed and this was a failed coup money was brought to the table so it is no longer an assassination. And since both King Salmon and Prince Salmon were shot and killed in April who is really running the show???', 'Keith Ehredt': 'Prayed for Ned Mandingo. GOD WILL answer.', 'Sharon Montgomery': 'Hugs...love and prayers from Northern Ireland 🙏🙏❤', 'truthmatters': "When these things begin to happen our redemption is nigh...doesn't it seem like they began a long time ago...where are You Lord...I know, You will come in Your time.\xa0 We must be patient..", 'Eric Henry': 'Pastor J.D. - At least you are not an NPC. \nKeep up the good work.', 'Butch Rishel': 'I attend a very loud,and lively church.l like the way you arent scared to get loud to get your message accross.keep being loud,brother.luv ur sermons.', 'barnum99': 'Thank you Jesus!', 'Dawn Crafts': "JD the Lord led me to you months ago, end of last year. Your sermons on Bible Prophecy are amazing . You are blessed , thank you for all your words. I'm ready to go home , that trumpet will sound   and we will meet the Lord in the air. Come quickly Lord.", 'SuZEQ': 'God bless you Pastor JD. We love you and we love America. It hurts to see what is happening to my country now but I take comfort in knowing God is in control! This is not our home. Our home is with Him. I am so ready to be called home. God bless you. Always in my prayers ❤️', 'Nona Baker': 'Pastor Farad, I love your comments every week, but I disagree that it was America that brought you to the Lord!  You were chosen before the foundation of the world by God Himself and are secure in Him forever!  Please give Him the credit.........He brought you here and made sure you became His.  God Bless you forever!', 'Albert Gunter': "I've heard it said Kashaoggi was a member of al-queda....a terrorist or if you prefer a terrorism supporter, was murdered and dismembered...so where is the loss?", 'Jada Parks/Villanueva': 'I vote via absentee ballot too...already Voted.  Yes, my brother, there’s so much going on in our world but, GOD is in control of everything. Even so, Come, LORD JESUS.  Our whole world needs prayer and JESUSy, pastor.  Our LORD will one day deal a headache to this world that no painkiller can get rid of.  The RAPTURE is soon enough.  Just be READY TO GO, saints.  Have a HOLY SPIRIT filled week.', 'Lynn Carpenter': "I sat on my bed and cried in 2006 when they-Bush threw everybody out of their houses (the jewish settlements) in Gaza and look at it today. What does that tell you? These Arabs don't know how to run anything. They're worse than the Democrats or big govt running anything well. Only Egypt, Lebanon, and Iran, who for the most part educated in US, and their protegies. They were fighting and killing each other before the US got involved and they created OPEC, our death sentence on peace in the Middle East. Thank-you HW & GW Bush for 9-1-1, globalism, money laundering, and OPEC, and then out-of-control paid Deep State militants everywhere since JFK, Malcolm X and Dr MLK, including south of the border marching caravan over the Mexico Bridge. There are paid assassins in this group and they are going to kill people and blame the US; just ask the dead and injured Mexican officials from two days ago. All the ones with full face black masks and hiding behind pregnant women carrying guns. Women make up about 1% of this entire population of 5k+. And there are some Big Guns not just sticks. Some are Mercenaries (Russia, UK, Aussies, S African, Canadian), white, brown & black. The leaders speak about 5 languages each. Watch Black Conservative Patriot. He never was political, and now cannot help himself, and very well educated/intelligent, well traveled, and USA Hispanic Patriot.", 'Marlene Hager': 'Thank you Pastor J.D. for your uplifting words.  I always feel certain that the rapture is coming any minute after watching you.  God bless you and your family.', 'riffraffrd': 'J.D.  Please stop yelling!', 'glenn goodale': 'Terrific update', 'Benji Mange': "Game Changers happen all of the time, especially as things are\xa0accelerating. It's like reaching all new highs. With all new highs it resets the previous standard or bar. What once was\xa0anticipated is no longer acceptable. So you can use game changer over and over again!", 'Karen Walton': 'God bless you, your family and church members. I look forward with great anticipation to your weekly sermon and prophecy updates.', 'Heather F': 'Amen JD no weapon formed against us will stand no curse will hold because God is greater than the evil in the world. GOD WINS everytime.  Hopefully these santanic people will wake up and turn to Christ.  Love you JD thank you for your truth and thank you for these updates.', 'Time  Keeper': 'Shaping up to be a strange world ,most all world leaders and corporations have no empathy they are planning or plotting world domination through deceit and lies the masses follow , God holds Us in all truth we see through their propaganda ..I can understand why they will wage war on the Saints in the last days.  All being revealed', 'Sylvia Rivera': 'Soon, we will bow down with tears of joy streaming down our faces to the Lamb of God, who is worthy and shed His Blood for us..', 'Sister Liberty': 'Yes, Tucker is loved. However, we love you even more dear pastor.  We are family!  Blessings!', 'Warrior4Jesus71': 'Hi If I may Suggest, Lets tell others about Jesus Christ while We can before the Rapture to further the Kingdom on all Social Site/Platforms Amen.', 'Joanne Moore': 'Best part of my week 😀', 'Alan Graveen': 'God Bless you JD thank you for your weekly updates getting us ready for the Rapture!', 'Denise Fetter': 'Thank you Pastor Jd!!', 'N, Rob': 'Great update. Please pray for 27 y/o Charli who just had open heart surgery Mon so she can stay alive till the Lord comes for us & that the Lord would use this ordeal to ripen us. 💨', 'Mike': "God bless you all and please pray for me and my family, Don't want me and my family to be evicted. Thanks and rapture ready", 'scoffers & Mockers,make me laugh': 'Bless the Lord Jesus', 'Dano S': 'Terrific update Pastor JD', 'Gary Gothlin': '2nd to comment.   The Lord Jesus Christ Saves....How To Be Simply Saved.\xa0\n\n1. The bad News. We are sinners. (Romans\xa03:23.)\xa0\nWe deserve to be punished in hell for our sins.\xa0\n\n2. The Good News. Jesus Christ who is God’s Son died on the cross for all of your sins. He was buried & rose again to give you eternal life in heaven as a free gift. (1 Corinthians 15:3-4. Romans\xa06:23.)\n\n3. How am I saved? Believe on the Lord Jesus Christ and thou shalt be saved. (Acts\xa016:31.)\xa0\n\n4. Once saved, always saved.\xa0\nJesus said in John\xa06:47. Verily, verily, I say unto you, He that believeth on me hath everlasting life.', 'Emerald Gate': "CE (Christian Era) 1/1/0001 through 11/1/2018 is 737,000 days. Strong's G737 means NOW. Strong's H737 means DINNER.", 'Ghost Pepper': 'First!!! 😂👍'}{'Denny T': 'TO ALL WHO ARE HURTING AND DESPERATE - This is for you\nIt has been said that when you have lost all hope, and all you see is darkness, always remember,” the darkest hour is just before dawn”. Don’t let your life be defined by desperation and hopelessness, Reach out to Jesus, He does His best work in dark places. Let the light of Christ shine within you. The very fact that you exist is God’s testimony of His love for you. Never Give Up. Receive Christ now, He is the caretaker of your soul. The Gospel message was created for you. The simplicity of the Gospel, - Here it is   A=Admit you are a sinner (Repent)   B=Believe Jesus is Lord   C=Call upon His name.  God Bless You Today.    AMEN', 'mary poppins': 'Thank you Pastor. Great update!.Awaiting HIS return \\o/...watchman from California. I think “never let a good crisis go to waste” is from Saul Alinsky’s Rules for Radicals, (book dedicated to Lucifer)Obama’s Bible. Obama is the best straight A student of this sick philosophy.\nPraying born again believers are going to VOTE for biblical values. Republicans are closest to our values, LIFE marriage and freedom.', 'Doty !': "Realized I've been watching your prophecy updates for over a year now. They've truly helped me get more close to Jesus our Lord and savior. bless you JD and thank you!", 'ANNA LUCAS': 'The slain journalist a friend of Bin-laden and a member of  Alkyd,  employed by Washington post?  A big loss?  He was probably in on 9/11.', 'Faith Koch': 'Excellent Pastor J.D.!  Soon, the King will come & bring His Children HOME!  Marathana!', 'Darlene Halton-Maple': 'That is soooo Cool JD!!!  Thank you!  Can we Download and print a copy of your Bulletin and print it to pass out around here?!?  Restaurants, etc...\nAnd.... Btw, thank you for YELLING, sometimes it’s good to get a lil Spiritual Justifiable Anger Going...  \n    Jesus did!  \nHe flipped tables over!?!  Yet he never sinned, so I don’t believe it’s  wrong!  \nIt was totally justified by Holy Frustration!!    \n   We humans sure know how to get ones Dander up sometimes!!', 'Juan Botero': 'May The Almighty God bless you, greetings from Holland', 'Donna Phoenix': 'Amir mentioned that USA&ISRAEL May attack IRAN, what say you! It wouldn’t surprise me considering IRAN’s threats to annihilate Israel and death to USA', 'Rebecca Cremo': 'I love your point of how the government was not exactly pro-Christian when Paul was turning the world upside down for Christ. Great reminder of how God’s plans do not center on or depend on the ever-changing geopolitical landscapes of our various countries.', 'Mar Jo': 'Thank You JD for your love of the LORD ❤️ and always giving HIM all the glory! Godspeed and see you in the air very soon!', 'Iknownothing !': "How strange, JD I'm 3hrs into the screwtape letters myself... A very clever book. How bazar is that 😊🙏", 'Rhonda J': 'I know these ABC’s by heart.  I became a believer in 1995.  But hearing it still makes my eyes water and my heart race.  It never gets old.  Thank you, Pastor.', 'VikingKitsune': "Hey, Pastor! Do you have an image of that that we coud use online? or print out? I'd love to use something like that!", 'Lisa777 There is a better way': 'Thank you Lord for healing my body through prayer, fasting, and detoxing my Temple. Feeling blessed. Great message. Hugs', 'Belinda Edenfield': 'Kamalla Harris, Maxine Waters, Diane Feinstein ... too.', 'Daughter of the King of Kings': "Thank you Pastor JD, I wait for your updates each week, online,  here in the UK.  They are such a blessing to us and so helpful to understand what is happening in the Middle East as shown through bible prophecy.  Please don't stop ! ......Watching and longing for our Lord to come and take us home.....See you in heaven .....Maranatha ! ♥", 'Andrew Smetana': 'Does anyone think Obama was President by accident? God allowed him to be in that position because it served His purpose in bible prophecy.  Just as Trump is in there now God is in control!!', 'Carol King': 'WOW!  Such a timely message!  I find myself being worried/scared thinking about the elections. What if the other side wins...what will happen?  Will all of the good be overturned?  What good news to remember God is in control....even if the other side wins!  Your update was exciting when you said we are maybe just 1 move away from Him coming for us.  Oh, I can’t wait!  Thank you again JD for your faithfulness to our Lord.  Can’t wait to meet you someday and say thank you!', 'WatchmanOn TheWall': 'It is true, God was not surprised that Trump was elected president. It occurred to me many years ago that nothing ( and I mean *NOTHING* ) ever “occurs” to God!', 'Hope Howard': 'Kashogi is the cousin of Dodi Fayed and this was a failed coup money was brought to the table so it is no longer an assassination. And since both King Salmon and Prince Salmon were shot and killed in April who is really running the show???', 'Keith Ehredt': 'Prayed for Ned Mandingo. GOD WILL answer.', 'Sharon Montgomery': 'Hugs...love and prayers from Northern Ireland 🙏🙏❤', 'truthmatters': "When these things begin to happen our redemption is nigh...doesn't it seem like they began a long time ago...where are You Lord...I know, You will come in Your time.\xa0 We must be patient..", 'Eric Henry': 'Pastor J.D. - At least you are not an NPC. \nKeep up the good work.', 'Butch Rishel': 'I attend a very loud,and lively church.l like the way you arent scared to get loud to get your message accross.keep being loud,brother.luv ur sermons.', 'barnum99': 'Thank you Jesus!', 'Dawn Crafts': "JD the Lord led me to you months ago, end of last year. Your sermons on Bible Prophecy are amazing . You are blessed , thank you for all your words. I'm ready to go home , that trumpet will sound   and we will meet the Lord in the air. Come quickly Lord.", 'SuZEQ': 'God bless you Pastor JD. We love you and we love America. It hurts to see what is happening to my country now but I take comfort in knowing God is in control! This is not our home. Our home is with Him. I am so ready to be called home. God bless you. Always in my prayers ❤️', 'Nona Baker': 'Pastor Farad, I love your comments every week, but I disagree that it was America that brought you to the Lord!  You were chosen before the foundation of the world by God Himself and are secure in Him forever!  Please give Him the credit.........He brought you here and made sure you became His.  God Bless you forever!', 'Albert Gunter': "I've heard it said Kashaoggi was a member of al-queda....a terrorist or if you prefer a terrorism supporter, was murdered and dismembered...so where is the loss?", 'Jada Parks/Villanueva': 'I vote via absentee ballot too...already Voted.  Yes, my brother, there’s so much going on in our world but, GOD is in control of everything. Even so, Come, LORD JESUS.  Our whole world needs prayer and JESUSy, pastor.  Our LORD will one day deal a headache to this world that no painkiller can get rid of.  The RAPTURE is soon enough.  Just be READY TO GO, saints.  Have a HOLY SPIRIT filled week.', 'Lynn Carpenter': "I sat on my bed and cried in 2006 when they-Bush threw everybody out of their houses (the jewish settlements) in Gaza and look at it today. What does that tell you? These Arabs don't know how to run anything. They're worse than the Democrats or big govt running anything well. Only Egypt, Lebanon, and Iran, who for the most part educated in US, and their protegies. They were fighting and killing each other before the US got involved and they created OPEC, our death sentence on peace in the Middle East. Thank-you HW & GW Bush for 9-1-1, globalism, money laundering, and OPEC, and then out-of-control paid Deep State militants everywhere since JFK, Malcolm X and Dr MLK, including south of the border marching caravan over the Mexico Bridge. There are paid assassins in this group and they are going to kill people and blame the US; just ask the dead and injured Mexican officials from two days ago. All the ones with full face black masks and hiding behind pregnant women carrying guns. Women make up about 1% of this entire population of 5k+. And there are some Big Guns not just sticks. Some are Mercenaries (Russia, UK, Aussies, S African, Canadian), white, brown & black. The leaders speak about 5 languages each. Watch Black Conservative Patriot. He never was political, and now cannot help himself, and very well educated/intelligent, well traveled, and USA Hispanic Patriot.", 'Marlene Hager': 'Thank you Pastor J.D. for your uplifting words.  I always feel certain that the rapture is coming any minute after watching you.  God bless you and your family.', 'riffraffrd': 'J.D.  Please stop yelling!', 'glenn goodale': 'Terrific update', 'Benji Mange': "Game Changers happen all of the time, especially as things are\xa0accelerating. It's like reaching all new highs. With all new highs it resets the previous standard or bar. What once was\xa0anticipated is no longer acceptable. So you can use game changer over and over again!", 'Karen Walton': 'God bless you, your family and church members. I look forward with great anticipation to your weekly sermon and prophecy updates.', 'Heather F': 'Amen JD no weapon formed against us will stand no curse will hold because God is greater than the evil in the world. GOD WINS everytime.  Hopefully these santanic people will wake up and turn to Christ.  Love you JD thank you for your truth and thank you for these updates.', 'Time  Keeper': 'Shaping up to be a strange world ,most all world leaders and corporations have no empathy they are planning or plotting world domination through deceit and lies the masses follow , God holds Us in all truth we see through their propaganda ..I can understand why they will wage war on the Saints in the last days.  All being revealed', 'Sylvia Rivera': 'Soon, we will bow down with tears of joy streaming down our faces to the Lamb of God, who is worthy and shed His Blood for us..', 'Sister Liberty': 'Yes, Tucker is loved. However, we love you even more dear pastor.  We are family!  Blessings!', 'Warrior4Jesus71': 'Hi If I may Suggest, Lets tell others about Jesus Christ while We can before the Rapture to further the Kingdom on all Social Site/Platforms Amen.', 'Joanne Moore': 'Best part of my week 😀', 'Alan Graveen': 'God Bless you JD thank you for your weekly updates getting us ready for the Rapture!', 'Denise Fetter': 'Thank you Pastor Jd!!', 'N, Rob': 'Great update. Please pray for 27 y/o Charli who just had open heart surgery Mon so she can stay alive till the Lord comes for us & that the Lord would use this ordeal to ripen us. 💨', 'Mike': "God bless you all and please pray for me and my family, Don't want me and my family to be evicted. Thanks and rapture ready", 'scoffers & Mockers,make me laugh': 'Bless the Lord Jesus', 'Dano S': 'Terrific update Pastor JD', 'Gary Gothlin': '2nd to comment.   The Lord Jesus Christ Saves....How To Be Simply Saved.\xa0\n\n1. The bad News. We are sinners. (Romans\xa03:23.)\xa0\nWe deserve to be punished in hell for our sins.\xa0\n\n2. The Good News. Jesus Christ who is God’s Son died on the cross for all of your sins. He was buried & rose again to give you eternal life in heaven as a free gift. (1 Corinthians 15:3-4. Romans\xa06:23.)\n\n3. How am I saved? Believe on the Lord Jesus Christ and thou shalt be saved. (Acts\xa016:31.)\xa0\n\n4. Once saved, always saved.\xa0\nJesus said in John\xa06:47. Verily, verily, I say unto you, He that believeth on me hath everlasting life.', 'Emerald Gate': "CE (Christian Era) 1/1/0001 through 11/1/2018 is 737,000 days. Strong's G737 means NOW. Strong's H737 means DINNER.", 'Ghost Pepper': 'First!!! 😂👍'}{'Denny T': 'TO ALL WHO ARE HURTING AND DESPERATE - This is for you\nIt has been said that when you have lost all hope, and all you see is darkness, always remember,” the darkest hour is just before dawn”. Don’t let your life be defined by desperation and hopelessness, Reach out to Jesus, He does His best work in dark places. Let the light of Christ shine within you. The very fact that you exist is God’s testimony of His love for you. Never Give Up. Receive Christ now, He is the caretaker of your soul. The Gospel message was created for you. The simplicity of the Gospel, - Here it is   A=Admit you are a sinner (Repent)   B=Believe Jesus is Lord   C=Call upon His name.  God Bless You Today.    AMEN', 'mary poppins': 'Thank you Pastor. Great update!.Awaiting HIS return \\o/...watchman from California. I think “never let a good crisis go to waste” is from Saul Alinsky’s Rules for Radicals, (book dedicated to Lucifer)Obama’s Bible. Obama is the best straight A student of this sick philosophy.\nPraying born again believers are going to VOTE for biblical values. Republicans are closest to our values, LIFE marriage and freedom.', 'Doty !': "Realized I've been watching your prophecy updates for over a year now. They've truly helped me get more close to Jesus our Lord and savior. bless you JD and thank you!", 'ANNA LUCAS': 'The slain journalist a friend of Bin-laden and a member of  Alkyd,  employed by Washington post?  A big loss?  He was probably in on 9/11.', 'Faith Koch': 'Excellent Pastor J.D.!  Soon, the King will come & bring His Children HOME!  Marathana!', 'Darlene Halton-Maple': 'That is soooo Cool JD!!!  Thank you!  Can we Download and print a copy of your Bulletin and print it to pass out around here?!?  Restaurants, etc...\nAnd.... Btw, thank you for YELLING, sometimes it’s good to get a lil Spiritual Justifiable Anger Going...  \n    Jesus did!  \nHe flipped tables over!?!  Yet he never sinned, so I don’t believe it’s  wrong!  \nIt was totally justified by Holy Frustration!!    \n   We humans sure know how to get ones Dander up sometimes!!', 'Juan Botero': 'May The Almighty God bless you, greetings from Holland', 'Donna Phoenix': 'Amir mentioned that USA&ISRAEL May attack IRAN, what say you! It wouldn’t surprise me considering IRAN’s threats to annihilate Israel and death to USA', 'Rebecca Cremo': 'I love your point of how the government was not exactly pro-Christian when Paul was turning the world upside down for Christ. Great reminder of how God’s plans do not center on or depend on the ever-changing geopolitical landscapes of our various countries.', 'Mar Jo': 'Thank You JD for your love of the LORD ❤️ and always giving HIM all the glory! Godspeed and see you in the air very soon!', 'Iknownothing !': "How strange, JD I'm 3hrs into the screwtape letters myself... A very clever book. How bazar is that 😊🙏", 'Rhonda J': 'I know these ABC’s by heart.  I became a believer in 1995.  But hearing it still makes my eyes water and my heart race.  It never gets old.  Thank you, Pastor.', 'VikingKitsune': "Hey, Pastor! Do you have an image of that that we coud use online? or print out? I'd love to use something like that!", 'Lisa777 There is a better way': 'Thank you Lord for healing my body through prayer, fasting, and detoxing my Temple. Feeling blessed. Great message. Hugs', 'Belinda Edenfield': 'Kamalla Harris, Maxine Waters, Diane Feinstein ... too.', 'Daughter of the King of Kings': "Thank you Pastor JD, I wait for your updates each week, online,  here in the UK.  They are such a blessing to us and so helpful to understand what is happening in the Middle East as shown through bible prophecy.  Please don't stop ! ......Watching and longing for our Lord to come and take us home.....See you in heaven .....Maranatha ! ♥", 'Andrew Smetana': 'Does anyone think Obama was President by accident? God allowed him to be in that position because it served His purpose in bible prophecy.  Just as Trump is in there now God is in control!!', 'Carol King': 'WOW!  Such a timely message!  I find myself being worried/scared thinking about the elections. What if the other side wins...what will happen?  Will all of the good be overturned?  What good news to remember God is in control....even if the other side wins!  Your update was exciting when you said we are maybe just 1 move away from Him coming for us.  Oh, I can’t wait!  Thank you again JD for your faithfulness to our Lord.  Can’t wait to meet you someday and say thank you!', 'WatchmanOn TheWall': 'It is true, God was not surprised that Trump was elected president. It occurred to me many years ago that nothing ( and I mean *NOTHING* ) ever “occurs” to God!', 'Hope Howard': 'Kashogi is the cousin of Dodi Fayed and this was a failed coup money was brought to the table so it is no longer an assassination. And since both King Salmon and Prince Salmon were shot and killed in April who is really running the show???', 'Keith Ehredt': 'Thank you very much, For taking time out of your very busy schedule, to keep us all up to date on bible prophesy. Excellent job sir. Love you brother J.D.', 'Sharon Montgomery': 'Hugs...love and prayers from Northern Ireland 🙏🙏❤', 'truthmatters': "When these things begin to happen our redemption is nigh...doesn't it seem like they began a long time ago...where are You Lord...I know, You will come in Your time.\xa0 We must be patient..", 'Eric Henry': 'Pastor J.D. - At least you are not an NPC. \nKeep up the good work.', 'Butch Rishel': 'I attend a very loud,and lively church.l like the way you arent scared to get loud to get your message accross.keep being loud,brother.luv ur sermons.', 'barnum99': 'Thank you Jesus!', 'Dawn Crafts': "JD the Lord led me to you months ago, end of last year. Your sermons on Bible Prophecy are amazing . You are blessed , thank you for all your words. I'm ready to go home , that trumpet will sound   and we will meet the Lord in the air. Come quickly Lord."}