{'Peeticek Peet': 'Strange.. i always thought that the speed limit for the initial download is the upload capabilities of 8 public nodes that provide the whole data package to mine node..', 'Aaron Walter': 'Invest in FGC Fantasy Gold A real use case in fantasy and esports.', 'Coin Cabin': 'Forget Bitcoin, get some FGC (Fantasy Gold), real use and way better project!', 'Absilon': "Crypto markets should trade against stablecoins not btc/eth. It makes a lot more sense. By the way, my favorite crypto is FGC. It's one of a very few cryptos with a real world use.", 'Nachannachle': 'Wow, thank you for the explanation. \nBlockchain technology in Bitcoin is REALLY amazing.', 'TeslaKaniv': 'The bandwidth your peers are sending blocks can be a bottleneck too. Another nitpick - it is the latency (in msec) of a hard drive or SSD that matter, not bandwidth (in MB/sec) as such.', 'Присяжный Засидатель': '@sequentialvsion', 'nion456789': 'Smashed the like', 'Michael Jack': 'Wow', 'Nixon Rexzile': 'Wow now i know! I thought I knew everything but Andrea keep feeding me info on Bitcoin :)', 'Joe Miller': "How does a node know to emulate soft forks in the protocol for specific blocks? Is that hard coded into the node implementation? Isn't the definition of a soft fork that it is backwards compatible so why does this have to happen? I assume that the blocks are not marked with a software version because there is no one version of bitcoin software as it is a protocol.", 'Buysome Bitcoin': 'Can it be used for time travel? Sounds cool!', 'Jimmy lee young': "The cryptocurrency market is evolving and those who know how to ride the wave might just be the ones to make the easiest fortunes of our time.  Thanks to Walter Aarav, it’s only because of his guidance I’ve been able to survive the crypto bear market of 2018. Increase your holdings and don’t get REKT out there guys. My funds and fortune dwindled at an alarming rate since the beginning of the year due to the bear market of 2018 until I started trading with Mr. walter, a professional trader. With his help, I’ve been able to grow my BTC holdings from 1.3 to more than 5 BTC now. Talk to him even if you’ve already been REKT or want to make serious gains from crypto, instead of just hodling and wishing for the best in a market manipulated by whales. His consulting email is *(Waltertrading12 @ gmail . com). Then maybe you'll make up for all of the years of just being mediocre and never rich", 'dajosova': 'so... why being a node matters ?', 'Chancellor Crypto': "That's where some forks have their own enhancements. Bitcore has a blockchain size ~950 mb, and a blocksize 10MB/20MB SegWit", 'Cory Kanski': "Are bootstrapped appliance-like machines safe? Isn't that route skipping a lot of what was just mentioned? I'm surprised there's a market for them", 'Lachlan Greenbank': 'Lookup how to write a config file for your node. you can crank up the ram to 8gb+ if you have it available. I wish I knew that the first time. Really speeds it up.', 'FukU2222': "I got into ETH back in early 2017 and had no problem DL'ing/syncing blockchain - I then foolishly thought I had to have my chain sync'd to make a transaction and thought I was SoL (pressed for time) because it wouldn't DL/Sync up.\n\nMake sure you have a decent hard drive, don't want that shit bricking on you//unable to keep up with rest of chain. Solid state(s) is/are a great choice, much cheaper now days too than when I first built this PoS, lmao....\nCheers Andreas.", 'R': 'always a pleasure learning from you @aantonop! thanks'}