{'Donnie Jones': 'Where are those mass arrests Mark? 8 days and counting until another lie by the false prophet.', 'Davey in Maryland': "Sorry, but I don't buy it. As far as I'm concerned, Jeff Sessions has been asleep at the switch for about two years. From where I sit, the guy is derelict in his duties, and he needs to be fired immediately. The corrupt leftist NEVER seems to get held accountable. We need an attorney general who is actually going to honor the oath he or she takes. The evidence is clear to me. Enough time has elapsed. I want to see handcuffs!", 'N M M': 'Looney land will be dealt with in due time. God will deal with looney land in such a way that only God can. Looney land is more looney than looney tunes.', 'john smith': 'yep i tell people about the globalist weather control and i take a beating in responses i got banned off fox news chat for telling the truth about weather warfare and the globalist only for a while lol', 'peter kincaid': 'Trump and his crew are operating in the Spirit.... TOTALLY COMMITTED..... SO THAT THOSE WHO SHOULD BE COMMITTED.... THEY ARE BUILDING THE DRAGNET.... SO THAT THEY WILL NOT MISS THE SMALLEST PAWN IN THE SWAMP.', 'Deborah Baker': 'My husband and I are early voting today. Red all the way.', 'Harmonious Universe': 'I know the hurricane did so much damage and I pray for those who have been affected, If the power will be out that means one positive thing is they will have to be paper ballots for voting.', 'Larry Speakman': 'my old 45 is in control.', 'Lindia Pain': 'I have been thinking the same thing. Remember how Trump has said over and over that he never tells the enemy what his plans are? I see Sessions as a sleeping Tiger waiting for orders to POUNCE.', 'Genesis gmail': 'Session is working with John Huber from Utah to indict many criminals and child sex traffickers pedovores and satanist!!!! Military tribunals are coming!!!', 'Mom Rosen': "Your annoying commercials come by too often., I won't listen to your channel anymore...hopefully Mark can find a better venue.", 'JUST SAYING': "Michael Moore should've said Trump outsmarted not the smartest but the most dangerous person who ever ran for president. More dangerous than Poppy Bush and his son of Satan's spawn, whose grandfather was Allister Crowley! Barbara's paramore.", 'Diane Czir': 'I said they control that weather stroms 30 years ago.....Population control....', 'Brenda Macek': 'I think that lots of these natural disasters are not natural but man driven.', 'Musycian': 'Hatch Act   review this', 'Pete Parker': 'Ask yourself if all this is such a big secret. Why do you know about it. And should you be telling everyone about it.', 'Dennis St.George': 'Jeff Sessions maybe General Patton in disguise.', 'Steven T. Rhinehart': 'Just subscribed! This channel is on the Cutting edge⚡⚡⚡', 'Sharon Malone': "Mark you  didn't  see Session  🔥🔥🔥 BURNING  in  Hell😈🔥🔥☹😈🔥🔥🔥🔥🔥BURN baby  burn.", 'Bobbie Mooser': 'Wake up people!  Make your move!  We are being invaded‼️. What is going on with this problem?  Change from Sessions to our IMMEDIATE problem the CARAVAN is coming.‼️‼️‼️', 'joshua mitchell': 'Violence is never an answer - what is wrong with them????\nWe are praying', 'jijrjdsmom Cooper': 'Who are you "Prophecy World" ?  Implying that this is prophecy from GOD/YHWH -  using Mark Taylor\'s PREVIOUS programs hosted by and recorded by OTHER FOLKS -  and you DO NOT even give them any recognition! ! !  That is like THEFT !   You should at least give the original video/recording credit ! ! !  This is from Shelia Zilinsky\'s channel,  name and date the program!', 'Terence Darby': "Americans are sick and tired of the globalist bullshit and their liberal agenda, that's why non elite Republicans are winning.", 'Vickie Reynolds': 'Put the criminals in the closed Walmart that has fence around them', 'Walter Whitener': 'Mark, I really would like to believe your words but earlier you were telling me that Jeff Sessions is in Hillary Clinton’s pocket and that Trump was going to Fire sessions after the Mid Term Elections. So which is it, Is he doing what Trump wants? Or is he protecting the Clintons? Please answer this!!!', 'bmjjjja': "Is there one shred of EVIDENCE that Sessions is doing what is claimed in this video?  Yes, I get it.  We would all like it to be true.  We would all like to think that what is supposed here is actually going to happen.  But wanting it to be true and it being true are two different things.  Where is the evidence?  Sessions himself, said he's not interested in investigating Hilary Clinton.  He doesn't even support the oversight responsibilities of the legislative branch which is the very thing we are talking about restoring....RULE OF LAW.  To restore the rule of law and the constitution, oversight of the DOJ has to happen by Congress.  It's the checks and balances we are supposed to all support, love and protect.  Yet there is defiance at every turn.", 'Nelson Toondrawer': 'Lower Judges have to be changed. Corruption in the DOJ, FBI, and 17 different 3 letter agencies has to be reduced. Midterms have to take place first. Money for Military Tribunals is available Jan 1 2019. So Patriots be patient. Weather Wars are being used by Cabal. Red patriots area have been hit. Keep praying. Use sordrescue. Org prayers. 😁🙂😘😎', 'some body': 'Mueller announced he is releasing his report after November. Could be thevwhole time working for Trump and wants to wait til they win the house in November and bam indictments of all deep staters.....probably.', 'ipmala': 'Sorry Mark.... I will believe it when I see it----regarding Jeff Sessions.', 'K Johns': 'Just got married on Saturday .. and now the wife and I have delayed our honeymoon so that we can go cast our early vote on day 1 of early voting here in TX. For those here in the Lonestar state..."You BETO vote for CRUZ!" \n\n#VetoBeto\n#NeverLoseWithCruz', 'mary garcia': 'PLS VOTE REPUBLICAN Nov 6, 2018', 'Jim Bethel': 'Mark, in this video, your face is longer and less wide than the sessions video, which appears rounder and fuller. any reason why they are so different? love you, and your work.GOD BLESS YOU, AND YOURS.', 'reg profant': 'This storm was created by harp', 'John Farley': 'I think now that The President has a 5/4 advantage in the supreme court, things will start to happen. Plus of course all the other judicial appointments that will not be corrupted will help.', 'D Maq': 'Another old recording. Unsubbed.', 'Dan Bohan': "Q says that it's happening.  Arrests coming soon.  He doesn't need Congress to drain the swamp.   He only need the Supreme Court.  He's got that now.  Why wait.  Why is Q saying soon if it's not happening until next year?   The longer this goes on the more children are at risk.", 'Hal Kranz': 'Psalm 46:1 God is our refuge and strength, a very present help in trouble.          Psalm 60:12 Through God we shall do valiantly; for he it is that shall tread down our enemies. KJV', 'Bob Farrell': "Moore thinks Hillary was the smartest person to EVER run for President?!?. Even God is laughing at that. I guess I've lost all respect for Moore. He is now classified as an idiot. As a research nut, he obviously didn't research her background at all. She broke the law. You wanted a law breaking American to run for President. Again....Idiot.", 'Eunice Bryan': 'Arrest all the Cabal.  The deep state are corrupt SEDITIONISTS, and Treasonists!', 'tgwoolshire': 'so...is this guy saying the hurricane was planned?', 'JJ QCHomes': "Does anyone realize that Trump is not only handling this massive routing of the enemy AND the midterm elections AND Kavanaugh insanity AND \n4 MAJOR destruction HURRICANES since he was elected.\nIts too much for me to imagine everything he's doing, without Trustable people all around. Plus assassination attempts.\nI wish we could have prayer assignment pages for everything that needs covering.", 'Gregg Jackson': 'Taylor is a total scam artist false prophet...', 'Robert Bachelor': 'Sessions is a piece of shit,and he needs to gtfo.', 'mark steward': "(( THEY ALREADY REOPENED Guatemala Bay PRISON HAS\nBEEN REOPENED ( 2 ) WEEKS AGO AND OVER A THOUSAND MILITARY\nPERSONNEL HAVE ALREADY LANDED AND MORE TO COME THEY ARE \nEXPANDING THIS FACILITY AS WELL / SHAME ON THOSE'S WHO ARE\nPUT THERE / THEY DESERVE WHAT'S COMING TOO THEM ......", 'Warren Lightning': 'Does anyone still believe what this guy speaks?', 'WiredMonk': 'This is where crazy lives.  Anyone subscribed to this channel, please, get help.', 'Harold Smith': "If you believe Sessions will do the right thing, I have beach front property in Arizona to sell you. Will Trump shut down the southern border? I sure hope so but it doesn't look like he has the nerve. I HOPE I AM WRONG!", 'cleo b': '🙏🏼🙏🏾🙏🙏🏻🙏🏽🙏🏿', 'William Jones': 'What if  ( Catholic observatory website )  https://www.vofoundation.org/blog/biblical-signs-sky-september-23-2017/    The stars alignment in the heavens Revelation 12:1  September 23 2017 the End Time alignment. The book of Daniel sealed (Daniel 12:4) till the End Time) September 23rd 2017 Revelation 12:14, Daniel 7:25  the  3 1/2 years (time times and dividing of time) in context with Daniel 7:12 & Daniel 7:26 of their dominion being taken away. Interestingly the beast judgment (Daniel 7:11) & (Revelation 19:20)different timing due (Daniel 7:12) the rest of the beasts (plural) 1 year (time) 3 months (a season) from September 23rd 2017 puts the draining of the swamp Dec 23rd 2018.  The Jewish need a red heifer without blemish before the temple can be built.  The word from the temple institute is one was born in Israel August 28th  2018 it needs to be 2 years old from conception the earliest date to dedicate and rebuild  the temple November 29th 2019 putting the earliest possibility to the second coming Nov 29th 2026. This is based the final seven years start from the order to rebuild Jerusalem Daniel 9:25 from those interpreting in middle of week (Daniel 9:27) are seven years due 3 1/2 years (Daniel 12:11) If the the second coming November 29th 2026 then the earliest for the Marriage feast of the Lamb 45 days later (Daniel 12:12) January 13th 2027', 'Paula Dupree': 'Do you think Obama has his Police that he had sign papers that they would back the government when he was in power, and  army he had been training to take us over, may rise up against our troops here when we are declared Marshall Law?  Just a thought.', 'Peaches Mcbee': 'Why so many commercials', 'John Revere': 'THANK YOU JESUS! THANK YOU JESUS! \nTHANK YOU JESUS! THANK YOU JESUS!\n\nThe places that are being attached like Portland Organ, they have allowed Sodomy to go on... \npedophilia to go on, \neating children, \nsacrificing and torturing children \nand murdering hundreds of little infants... \nThey are not taking a stand like they should as a church body and Christians!! Sorry to say this, the truth hurts! \nGet rid of the hidden child trafficking fronts like Voodoo Donuts... \nyou know it’s true! \nDo your homework and find that it’s true! Then take a stand in Jesus name to come against it, \nthat foul evil spirit... \nhorrifying treasonous acts towards humanity! \nThen in prayer and fasting coming against this the Jehovah God will start to heal your land. \nTake a stand, \nBe bold in Jesus name!', 'Redeyed Jedi': 'Oops, valley gurl is talking...Cant stand to listen...Her and her 20 minute prayers. Thinking she will be heard for her longwindedness. Pray with your HEART people, alone in your closet, not on the corner as the hippocrites do~Jesus.', 'Tonya Whitten': 'Dane Whittington has great info, but I quit watching him because he kept saying that Trump was just another puppet.', 'GrayEagle48': 'The walls are closing in on the swamp critters, I can feel it in my bones. Swamp critters your TIME IS UP, there is no where to hide. Witty, commentary.\nhttp://freesites.ourchurch.com/a/AncientHebrewScriptures/?page_id=96', 'BLANCHE JONES': 'Can you all be RESPECTFUL and not call the President Trump?  He is the President.', 'Ken Semotiuk': 'Jeff sessions the southrrm boy hillbilly lawyer turned politician', 'Calvin Dement': 'I hope you are right about Sessions.', 'Edwin Rodriguez': 'I don’t believe Michael Moore believed what he said. He was just trying to make us think we did not have to vote on Nov. 6. Wrong! We are voting to drain the swamp on Tuesday, Nov. 6. #DrainTheSwampOnNov6', 'Alan Stordal': "Rats are sensing the ship is leaking/sinking and are clamoring to get off.it's become everyone for themselves as they flee in seven different directions", 'Linda Marzucco': "Michael Moore said at the end you need to operate like you're going to get your ass kicked. What does he mean by operate govern yourself accordingly? That means violence? Obstruction excetera excetera", 'Georgiana Hurlbert': 'I am thankful to have this information, but, am so sick of the repetition of the information, the interviewers constantly drolling on, and the wandering off topic. It gets old.', 'Tom Andrejko': 'JESUS IS THE LORD  !', 'LaRee Weatherman': 'I told my family that Michael hit the panhandle of Florida ON PURPOSE! Manmade storm to affect the Republican vote in Florida.', 'rohag735': '“Extremes to the right and to the left of any political dispute are always wrong.” \n― Dwight D. Eisenhower', 'Debbie  Hamilton': 'Gitmo Girl = Hillary Clinton', 'Kathy Mitchell': 'Mr. Taylor! How come a few months back you said Sessions was NOT to be trusted? Why did you change your mind?', 'Nestor Alegre': "Jeff sessions is a big disappointment he's part of the deep State he will not help us... this fantasy of 50,000 indictments or more is starting to get really stupid ..let's not fall for this stupidity... pull your heads out of your asses and go vote for Trump .Sessions ain't going to save nobody but himself...we don'tneed him..get rid of him and put someone else", 'sweet tea dee': 'Got any pop corn! Enjoy the show.because God judgement is here.', 'Temporary Billy': 'So this Mark Taylor has "prophecies" every day now ?? Sorry I have faith but, don\'t believe it ..anyone making $ off of God is a fraud sorry my opinion', 'Aurthor Hogan': "Relax!!  Wait until after the midterm elections.  Wait until January 2019!  Wait until February!!!! It's OK!!!", 'GetReady4LiftOff': 'you &me living in most exciting time! on spot  healings coming to earth, Thy kingdom Come, thy will be done, on earth as it is in Heaven!', 'Andrea Visconti': 'It was done by the HAARP weather machine. Hurricane Michael. Also there are fake Christians who worship Satan. I have one where I live.', 'Cookie Sweikert': 'Thank you both.. passing this on! Been following GEO STOrMS-CHEMTRAILS AND MAN MADE STORMS! PRAY✝️🛡🗡 Stand! Prayer closet should be home to us all! Florida here... in agreement with you both!!!🇺🇸✝️🇺🇸✝️🇺🇸✝️🇺🇸✝️🇺🇸', 'Laci224': "We have to have a game plan. Our enemies are now increasingly operating outside of the law. We have to be 'tricky' to win. Trump's admonishing Sessions may be a clever distraction. I hope I am right.", 'Pam Johnson': 'We know not what the Q cult says has validity.  If our President said yesterday "where is my AG" why do you have trust on an anonymous writer? Where did Jesus use an anonymous apostle?  It is disappointing to hear Mark believe in the Q cult, will he tell us His told him to trust Q. Please!', 'Josh Pfeiffer': 'Any of these prophecies come to past ? Or is this guy blowing smoke?', 'The Watcher Chronicles': 'Question: if the deep state has the technology to weaponize weather, set off earthquakes and tornados,   etc.,(and they do) then they can easily take down AF-1, ala TWA-800.(another deep state false flag event). Trump needs about 20 doubles!', 'Michael Lynch': 'Sessions Announced that he is sending 500 federal judges to help with gun violence in Chicago. BTW just happens to be Obama\'s "Home Town".', 'Al Capone': 'No storm increased when nearing n hitting land', 'Dee Bennett': "Thank you for talking real time events. It's helps to know what god wants today. Not in the past. Thank you so much", 'Pop Scott': 'Declass now', 'Madeleine Gilvey': 'The President would have gotten rid of Him along time ago. If he was doing his job. 🇺🇸🇺🇸🇺🇸', 'James Beckwith': 'Using the term " false flag" for tragic events is a major misnomer and should never be used. May people understand that false flag doesn\'t mean it never happened, but was a deep state setup. But many others think this phrase means it "never happened" Such as Alex Jones thought Sandy Hook never happened and was sued for saying the kids were never killed by the nutball shooting up the school. Even tho Alex Jones never per say it never happened, he used the term "false flag" and it was misinterpreted to believe by others that the shooting never happened.', 'Sydney Smith': 'I\'m telling you people - get the evil out of your hearts Now!  Search it out and do righteous by Jesus of Nazareth.  I fell in a ditch too and I made amends.  It is not too heavy of a yoke to bear.  I know the Lord but he surely is coming and I am trembling.  I do not want to see what is to come but I will endure.  Lord hear my payer  - In God we Trust.  You are the most high no doubt.  Deliver me once more to the bosom of Abraham.  So many so lost and deceived.  I have felt your coming for some time now.  There is horrific wickedness on the earth.  I pray as many as possible can see so that your plan is fulfilled.  We want peace and not strife.  Father God, you have seen me molested, you have seen the Movie the Griswolds where they have mocked one of your great ones, You have seen a layer tell me "your Father is not here to help you now".  They know not what the do.  I fear not anyone but you Sir.  Please help them with love and kindness.  Amen.  PS I threw my ancestors sword in the river today and any free mason should too.  Father God through Jesus,  You have done Magic to purify my spirit.  I mean no one any harm only righteousness in the sight of You and I will vote for you.  We are just spirits and anything else are mere trinkets.  Bring on your Power and let them know forever more that you are the Lord our God. AMEN!', 'Tracy Goad': 'Our Father in heaven please help our president. In Jesus name I pray amen.', 'Randy Leffler': 'Trump is a.genius, he is getting dems  to defend Sessions, then he will bring the hammer down on the deepstate', 'dirigoelectric': 'I’m watching and praying that God allows justice on these people.', 'eyeOOsee': '6 commercials in an 11 minute video?  !! I need to change devices so I can use Adblocker.', 'louis mcclendon': "This guy spouts more opinion then the heart of God appealing more to the heart of man then God , heaping to your selves 2nd Timothy 4:3 God judges with equity He is not a democrat or republican nor a respector of persons but does all things after the counsel of His own will, be careful of what you allow to tickle or scratch your ears to fall away from the heart of the King we live in a monarchy not a democracy ,remember as you fight  for a system and world that will pass away and melt with fervent heat God desires your heart and not the system of the world produce Kingdom culture not hate, roman's 10 righteousness speaks on this wise say not in thine heart; but what saith it?", 'Edgar Stihl': 'JESUS CHRIST IS IN CONTROL', 'Justan American': 'Mark Taylor needs to take a close look at the voting map from the last election. Houston is a BLUE voting area of Red stateTexas. Even the small area of the Florida panhandle that was hit hard voted BLUE the last election. The areas in North Carolina and South Carolina that were hit hard were BLUE voting areas. Take the map from the last election and overlay it with a map of storm damage. All Blue areas..'}{'Joseph Harris': 'Speaking of Trump retweeting his commitment of stopping child trafficking, is there any confirmation of dark web encrypted communications of Microsoft Bill Gates participating in a kidnapping scheme of Baron Trump?', 'alex reutov': 'FROM THE EAST UNTO THE WEST...THE RED TSUNAMI...IS THE BEST...!!! BUT...FROM THE WEST UNTO THE EAST...THE RED TSUNAMI...IS...***THE BEAST***!!!888!!! NOV 6....2018 ...IS...*** THE MEGA---PILLS DAY 4  THE DEMOCRATS ...!!!', 'Kim Styles': "Climate change is real it's called weather. I stole that from somebody else on YouTube hahaha", 'Sue Robertson': 'keep praying folks', 'SKY BRIDGE': 'THEY NEED TO GET THOSE HARP PEOPLE ......  ........ SOOO EVIL', 'Sandra Mackin': '2019 is going to be a VERY VERY GOOD !', 'DANIEL SLAGLE': 'Ill share what the Lord has and is currently showing me for the sake of others who need confirmation. \n 1 All for the Glory of God, His Will, the Kingdom of JESUS Christ. So all of This we live through isnt the point, the Kingdom of God is, His NAME, and His Honor.\n2. Remember Obamas "hope and change"! That was a fraud! Devil using what God Had said was coming. "Change". The imitator copied and tried to effect a change before the Lord did. (he failed).\n3 everything shaken. Goats seperated from the sheep, tares from the wheat, the false from the true. Why? Because of what is coming. \n4 He would in the next years to come (from when I knew in 2000) woild be seeking men and women who would hear and believe and learn faith. Him. Who He could entrust and impart to His Words, His Callings , who would minister HIS NAME to them who would after...\n4 "Calamity". Not my word, His. Blackouts. Famine! Civil war. Violence increased because of Him not restraining and the deluded being completely deluded. Yes, sure enough, we are witnessing this right now but know, it will increase. \n\n  How many have seen their lives really, really put through the ringer? I have, and if it had not been for what He showed me I\'m not so sure if I could have endured. But I am hearing of this from a lot of people, but its all good, we are being cleansed, SANCTIFIED, losing worldly connections because\n 5 the world is about to reap a bitter, bitter harvest!\n Any thing we gained from and of the world or by our "hard work", well, it\'s polluted, unfit, and it needs gone, purified and sanctified for HIS WILL AND USE!\n 6. A time nwas said to be coming that we would have only our faith because the world, the institutions of man, the arm of flesh would not supply for us anymore, because, those things wont exist. \n  And we were, when readied, would be a light in the darkness and lead others to the knowledge and love of God. \n\nThere were things God has told me to not write, because the devil was not to know, but He told me because He does nothing without reavealing it to his servants the prophets first. So He has revealed. \n\nPlease heed and obey. \n The wicked will be exposed, not just Obama and Clinton and them, but everywhere, anyone. \n The pastors who have gotten fat and made merchandise of His Saints, the thief, the adulterer, the liar, all. His NAME. Will be GLORIFIED!  These who made themselves gods, full of pride, following satan, boasting and mocking Him and His Chosen, they will suffer total loss and no place for repentance will be given. \n\nThe youth will seek out the Truth, and there will be an outpouring of the SPIRIT of GOD upon them. They will seek out them who have been prepared these last 18 year\'s for this time. \n There are many, who none think anything of now, but God has been thoroughly preparing. Who is honored now will be abased, brought low, openly shamed. \n\nTHE LORD, HE IS GOD AND THERE IS NO OTHER!!! \n\nHe is about to pour out His Spirit in ways as never ever before . So many of us who have been through incredible trials and tests and challenges, were being prepared, and now emptied, and as having gone through boot camp, will be filled in a moment and our mission made clear. \n  Yes, people have died. They were in the way, or the authority had to be passed on to the next, we have been moved out of one position and placed in another, all, by God. For His Will. For to lead others. To Glorify Him. For some for their very lives. And for more than we can understand. \n  We Will find each other though we have felt so all alone. We were, but we had God our Father separating us into Himself for His Purpose to come. We had to be alone. Out of the established church for this time. We had to have nothing but Him.', 'Doug Roby': 'I saw a hilarious picture of Hillary standing in a cemetery with all headstones with the caption " Hillary\'s rally".', 'John Orr': "Blah blah blah. Sessions has you all fooled into thinking he's laying low and doing something. Hogwash. I gave up on all of it. They either get em gone or patriots will and gov better not get in the way.", 'Robert Kiss': 'Please vote red and help our President Trump. MAGA  May God bless you all and keep you all safe and healthy. Amen  Thank you Mark for all your Prophecy. May God bless you and your family and keep you safe. Thank you Prophecy World. May God bless you and everyone involved in this report and may God keep you all safe and healthy. Amen', 'SAMMI SCHINDLER': "I'm trusting the plan of our Lord. Keep the faith, patriots and continue to pray.", 'Deborah Baker': 'Let God arise and our enemies be scattered.', 'elfofcourage': 'Someone needs to tell Gary Franchie of the Next News Network to stop bashing Sessions and to Stop calling for Rosenstein’s firing.\nQ', 'jax': 'i cannot believe jeff is a good guy    and if nothibg happens after nov    then what will people say to defend sessions', 'Lutetia Vollintine': "OH BULLSHIT IT'S THE BIBLE BEING FULFILLED YOU DICKWADS", 'Kedric Pitman': 'Trump needs to immediately activate the military and have the military arrest Pelosi, Booker, Clinton , Tim McCain and Maxine Waters for instigating violence against the US. Trump needs to do this before the midterms to show a price will be paid! Regardless of what anyone says if the Dems draw first blood after the midterms it will be too late! The bowl is out and all the ingredients are in the bowl!', 'Ezekiel Rodriguez': '2019 will be GITMO time for many corrupt treasonous Politician, Bureaucrats, and Sedition on the part of Hellywood Celebrities and Leftist DemonRat violent voters.', 'Abel Flores': 'Not so long ago Mark was saying that Hillary has Sessions in her pocket?', 'xslogic 1917': 'mark Taylor is for real', 'karen putteet': 'their is no such thing as climate change the is the devil confusing us we are in the birth pains of the end times period', 'dannette peters': 'It is Q, who has taught, those who are listening, what the swamp actually is.      It is not just 100 criminal D.C. politicians, that should be immediately arrested and put AWAY.  IT is a behemoth, moneyed system that has been established around us.  IT has poisoned millions of corporations, companies, agencies, departments, offices, law enforcement, legal systems, medical industry, churches, EVERYTHING.  The swamp is habitat and profession to millions of people.  It was only our naievity and ignorance that caused us to think Trump would start making arrest immediately.   But here we are nearly two years later, many more people in OUR country have awoken or are beginning to.   Many more still need to learn and be shown.  If we are to hold together as a REPUBLIC, the People need to understand why; when the arrest and executions begin.', 'Maxine Johnson': 'Your recording sound seems to be too low. All my sound is turned up and still you voices are too quiet. Love you guys.', 'ConservativeQueen': '#MyPresidentIsAgenius #LoveMyPresident #Trump2020 #MakeLiberalsCryAgain', 'marsack7': "If man can control these storms, then why couldn't POTUS stop them? Doesn't he know? Maybe it's impossible? What is going on?", 'Dora Tiscareno': 'Will it happen b4 i get any grey-er....😬', 'James Lynn': 'I don\'t know about the rhetoric you guys are putting forth. Trump tweeted several times about Sessions not doing his job into investigating the other side of Russian collusion. How is Sessions on par with Trump?? How is Sessions the "silent executioner"? Isn\'t Trump\'s tweets directly refuting your claims just to wake up the other side? Are you guys not paying attention to the current events or are you guys out of it?', 'Ash qelon': "You're just a cross between Perry stoned Paul Begley and that other hammer head over there in Hawaii.\nWho cares none of you people say damn thing worth listening to your whole bunch of fools trying to play Church", 'Greg Smith': 'We can help the police maintain order !  ( If they need us ! ) .', 'Josephine Dorion': 'HOOOO\xa0 HUMMMM.............. let me know when Sessions wake up.', '1966Hemi426': 'I’m trusting in the plan.  President Trump is a genius.', 'Dennis Jemison': 'SESSIONS WILL COME THROUGH=TRUST SESSIONS THE STEALTH BOMBER=Q', 'frank jones': 'If Sessions is doing any good .. Trump doesn`t seem know about it..', 'Tom Rodgers': "Most analysts that I've heard, including those that support Trump, are saying the Left WILL take the House back. Trump needs to star arresting the criminals now. So what if it looks bad, the Left will make it look bad no matter when he strikes.", 'Jacardo': 'All of the events show us we are truly living in some very intriguing times', 'Galen Grounds': 'Better happen soon,we’re tired of Session holding off'}{'Joseph Harris': 'Speaking of Trump retweeting his commitment of stopping child trafficking, is there any confirmation of dark web encrypted communications of Microsoft Bill Gates participating in a kidnapping scheme of Baron Trump?', 'alex reutov': 'FROM THE EAST UNTO THE WEST...THE RED TSUNAMI...IS THE BEST...!!! BUT...FROM THE WEST UNTO THE EAST...THE RED TSUNAMI...IS...***THE BEAST***!!!888!!! NOV 6....2018 ...IS...*** THE MEGA---PILLS DAY 4  THE DEMOCRATS ...!!!', 'Kim Styles': "Climate change is real it's called weather. I stole that from somebody else on YouTube hahaha", 'Sue Robertson': 'keep praying folks', 'SKY BRIDGE': 'THEY NEED TO GET THOSE HARP PEOPLE ......  ........ SOOO EVIL', 'Sandra Mackin': '2019 is going to be a VERY VERY GOOD !', 'DANIEL SLAGLE': 'Ill share what the Lord has and is currently showing me for the sake of others who need confirmation. \n 1 All for the Glory of God, His Will, the Kingdom of JESUS Christ. So all of This we live through isnt the point, the Kingdom of God is, His NAME, and His Honor.\n2. Remember Obamas "hope and change"! That was a fraud! Devil using what God Had said was coming. "Change". The imitator copied and tried to effect a change before the Lord did. (he failed).\n3 everything shaken. Goats seperated from the sheep, tares from the wheat, the false from the true. Why? Because of what is coming. \n4 He would in the next years to come (from when I knew in 2000) woild be seeking men and women who would hear and believe and learn faith. Him. Who He could entrust and impart to His Words, His Callings , who would minister HIS NAME to them who would after...\n4 "Calamity". Not my word, His. Blackouts. Famine! Civil war. Violence increased because of Him not restraining and the deluded being completely deluded. Yes, sure enough, we are witnessing this right now but know, it will increase. \n\n  How many have seen their lives really, really put through the ringer? I have, and if it had not been for what He showed me I\'m not so sure if I could have endured. But I am hearing of this from a lot of people, but its all good, we are being cleansed, SANCTIFIED, losing worldly connections because\n 5 the world is about to reap a bitter, bitter harvest!\n Any thing we gained from and of the world or by our "hard work", well, it\'s polluted, unfit, and it needs gone, purified and sanctified for HIS WILL AND USE!\n 6. A time nwas said to be coming that we would have only our faith because the world, the institutions of man, the arm of flesh would not supply for us anymore, because, those things wont exist. \n  And we were, when readied, would be a light in the darkness and lead others to the knowledge and love of God. \n\nThere were things God has told me to not write, because the devil was not to know, but He told me because He does nothing without reavealing it to his servants the prophets first. So He has revealed. \n\nPlease heed and obey. \n The wicked will be exposed, not just Obama and Clinton and them, but everywhere, anyone. \n The pastors who have gotten fat and made merchandise of His Saints, the thief, the adulterer, the liar, all. His NAME. Will be GLORIFIED!  These who made themselves gods, full of pride, following satan, boasting and mocking Him and His Chosen, they will suffer total loss and no place for repentance will be given. \n\nThe youth will seek out the Truth, and there will be an outpouring of the SPIRIT of GOD upon them. They will seek out them who have been prepared these last 18 year\'s for this time. \n There are many, who none think anything of now, but God has been thoroughly preparing. Who is honored now will be abased, brought low, openly shamed. \n\nTHE LORD, HE IS GOD AND THERE IS NO OTHER!!! \n\nHe is about to pour out His Spirit in ways as never ever before . So many of us who have been through incredible trials and tests and challenges, were being prepared, and now emptied, and as having gone through boot camp, will be filled in a moment and our mission made clear. \n  Yes, people have died. They were in the way, or the authority had to be passed on to the next, we have been moved out of one position and placed in another, all, by God. For His Will. For to lead others. To Glorify Him. For some for their very lives. And for more than we can understand. \n  We Will find each other though we have felt so all alone. We were, but we had God our Father separating us into Himself for His Purpose to come. We had to be alone. Out of the established church for this time. We had to have nothing but Him.', 'Doug Roby': 'I saw a hilarious picture of Hillary standing in a cemetery with all headstones with the caption " Hillary\'s rally".', 'John Orr': "Blah blah blah. Sessions has you all fooled into thinking he's laying low and doing something. Hogwash. I gave up on all of it. They either get em gone or patriots will and gov better not get in the way.", 'Robert Kiss': 'Please vote red and help our President Trump. MAGA  May God bless you all and keep you all safe and healthy. Amen  Thank you Mark for all your Prophecy. May God bless you and your family and keep you safe. Thank you Prophecy World. May God bless you and everyone involved in this report and may God keep you all safe and healthy. Amen', 'SAMMI SCHINDLER': "I'm trusting the plan of our Lord. Keep the faith, patriots and continue to pray.", 'Deborah Baker': 'Let God arise and our enemies be scattered.', 'elfofcourage': 'Someone needs to tell Gary Franchie of the Next News Network to stop bashing Sessions and to Stop calling for Rosenstein’s firing.\nQ', 'jax': 'i cannot believe jeff is a good guy    and if nothibg happens after nov    then what will people say to defend sessions', 'Lutetia Vollintine': "OH BULLSHIT IT'S THE BIBLE BEING FULFILLED YOU DICKWADS", 'Kedric Pitman': 'Trump needs to immediately activate the military and have the military arrest Pelosi, Booker, Clinton , Tim McCain and Maxine Waters for instigating violence against the US. Trump needs to do this before the midterms to show a price will be paid! Regardless of what anyone says if the Dems draw first blood after the midterms it will be too late! The bowl is out and all the ingredients are in the bowl!', 'Ezekiel Rodriguez': '2019 will be GITMO time for many corrupt treasonous Politician, Bureaucrats, and Sedition on the part of Hellywood Celebrities and Leftist DemonRat violent voters.', 'Abel Flores': 'Not so long ago Mark was saying that Hillary has Sessions in her pocket?', 'xslogic 1917': 'mark Taylor is for real', 'karen putteet': 'their is no such thing as climate change the is the devil confusing us we are in the birth pains of the end times period', 'dannette peters': 'It is Q, who has taught, those who are listening, what the swamp actually is.      It is not just 100 criminal D.C. politicians, that should be immediately arrested and put AWAY.  IT is a behemoth, moneyed system that has been established around us.  IT has poisoned millions of corporations, companies, agencies, departments, offices, law enforcement, legal systems, medical industry, churches, EVERYTHING.  The swamp is habitat and profession to millions of people.  It was only our naievity and ignorance that caused us to think Trump would start making arrest immediately.   But here we are nearly two years later, many more people in OUR country have awoken or are beginning to.   Many more still need to learn and be shown.  If we are to hold together as a REPUBLIC, the People need to understand why; when the arrest and executions begin.', 'Maxine Johnson': 'Your recording sound seems to be too low. All my sound is turned up and still you voices are too quiet. Love you guys.', 'ConservativeQueen': '#MyPresidentIsAgenius #LoveMyPresident #Trump2020 #MakeLiberalsCryAgain', 'marsack7': "If man can control these storms, then why couldn't POTUS stop them? Doesn't he know? Maybe it's impossible? What is going on?", 'Dora Tiscareno': 'Will it happen b4 i get any grey-er....😬', 'James Lynn': 'I don\'t know about the rhetoric you guys are putting forth. Trump tweeted several times about Sessions not doing his job into investigating the other side of Russian collusion. How is Sessions on par with Trump?? How is Sessions the "silent executioner"? Isn\'t Trump\'s tweets directly refuting your claims just to wake up the other side? Are you guys not paying attention to the current events or are you guys out of it?', 'Ash qelon': "You're just a cross between Perry stoned Paul Begley and that other hammer head over there in Hawaii.\nWho cares none of you people say damn thing worth listening to your whole bunch of fools trying to play Church", 'Greg Smith': 'We can help the police maintain order !  ( If they need us ! ) .', 'Josephine Dorion': 'HOOOO\xa0 HUMMMM.............. let me know when Sessions wake up.', '1966Hemi426': 'I’m trusting in the plan.  President Trump is a genius.', 'Dennis Jemison': 'SESSIONS WILL COME THROUGH=TRUST SESSIONS THE STEALTH BOMBER=Q', 'frank jones': 'If Sessions is doing any good .. Trump doesn`t seem know about it..', 'Tom Rodgers': "Most analysts that I've heard, including those that support Trump, are saying the Left WILL take the House back. Trump needs to star arresting the criminals now. So what if it looks bad, the Left will make it look bad no matter when he strikes.", 'Jacardo': 'All of the events show us we are truly living in some very intriguing times', 'Galen Grounds': 'Better happen soon,we’re tired of Session holding off'}