{'Talking Cryptocurrency': 'I wish everyone would use your terminology.', 'Peter KazAk': 'Hello friend! Thanks for your videos. Plewse check if it is your telegram @aaantonop ?', 'Alex Lary': 'Hey guys can bitcoin get bullet proofs ? Is that possible', 'MrHarrilasagna': 'Thank You!', 'Robert Graham': "Eth is a horrible pre-mine scam that's already over 1TB, has major sync problems, is centralized, they reversed their blockchain, they have a central leader and  crypto kitties brought down their entire network. There are many more shenanigans as well... Andreas only shills this shitcoin because he has a bag of eth from the pre-mine that he even admitted he was a part of. World computer? FUCK NO", 'em em': '7:40 I like this format!', 'latigo66': '10:57 Soooo, you’re implying Cardano sucks then?', 'Mind ya beez kneez': 'meta Data tokens coins rely on the website and the probable finite business life of the issuer. If the erc-721 token issuer goes out of business then the token itself is just a relic.', 'Mylaw Twisp': 'watched, liked & shared = true;\n\nGreetings from Kenya Africa', 'Fabrice Manzo': "trilemma, \nEOS gives up decentralization for fast and free TX's, It all depends on the use case.  Different blockchains need to be complementary.  Some people are defending only their investments like a crazy football fan!\nPersonally I like ethereum a lot! I like smart contracts a lot, they are gonna change the world ⚠️\nI'm looking forward for the Constantinople upgrade. They should roll back the Ropsten testnet and test it over and over again, till it all works perfectly", 'Gee Willickers': '"Trilemma" is a fallacy. It\'s non falsifiable.', 'Bryan Keller': 'Andreas could create a MOOC like Andrews Ng did for machine learning and artificial intelligence on Coursera and it would also become the most famous course of its branch.', 'Dan Marcum': 'It feels like "no blockchain, no coin" could become a new rule next to "not your keys, not your bitcoins."', 'nion456789': 'Smashed the like', 'MACE': '"No Views"\ncool, frist.'}