{'rosely covali': 'Unity will happen immediately when death show up. Nobody will fight for enemies that everyone who really is.\n\nThe rest is only rest. Nobody really cares.', 'bob dias': "It is time to destroy the stronghold of the enemy!  I especially appreciate Trump for his actions to introduce prison reform. I have been active in prison ministry since 1985, and it has been a real source of God's grace in my life. One gift I have been given to share with inmates is a song I wrote in the early '70s called Amazing Grace Revisited. https://youtu.be/sTHY35AoPho", 'ARCHANGEL OF LIGHT': 'Please list date of interview,\n\n....”islam is a judgement against an apostate church...? STOP. That’s some hogwash right there as sharians torture, rape and murder everything non sharian in it’s wake...\nDeep state satanists put this rapefugee destruction in place....', 'Lore Sogge': 'Our fathers abandoned us, what did you think would happen?', 'Joseph M': 'Don\'t you mean "In God we Trust"  I like what you represent in this video, however, where did you come up with your handle?  Sorry I can\'t go for that or can I subscribe. I Trust in God only, not man.', 'dean johnston': 'The enemies greatest weapon: to DIVIDE and conquer. Fathers greatest weapon: to UNITE and conquer; Where 2 or three AGREE!!!', 'Denise Shumate': 'Mark Taylor God is not giving America anymore time he is coming back very soon and no one knows the day nor the hour of his return God is angry at sin and its not just America but the whole world he is tired of sin and we are not getting more time he is truely showing us we are living in the last days and we as Americans are not going to be shown mercy just because of Donald Trum he is only a man and the bible says to put our trust in no man and Donald Trump is no excrption yes i voted for him only because i felt like he was much better than Hilary but i can say this she needs prayer and lots of it but even Hillary can be saved and the God i serve can turn her completely around just like he can Obama and all those crooked politicians and no im not in anyway for her or any of the corrupted ones but when i see some of the titles of your shows on youtube its like you are for the death of these people but what do you think the God we serve and Jesus Christ would want for them he says in his word that he wishes no one er puld parish and wants them to have everlasting life but i never hear you say God have mercy on them and God please dont let them go to hell. Mark Taylor hell is hot and we need to be praying for their soles and i have to say that we are to try the spirits to see if they are from God and when i listen to some of your prophecies they dont line up with the word of God and so many of your shows are rerun after rerun theres never nothing new from the lord no new prophecies but only stuff thats added on to the old stuff i keep hearing about all the arrest but theres never no arrest only you saying we have to wait we have to wait and so m as ny people know that this is not the way it is done if you want to convince me and i dought you will because you were ill have an excuse not to you are more than welcome to try and convince me that what you are saying is what thus says the lord i will listen if its true', 'William Jones': 'What if  ( Catholic observatory website )  https://www.vofoundation.org/blog/biblical-signs-sky-september-23-2017/    The stars alignment in the heavens Revelation 12:1  September 23 2017 the End Time alignment. The book of Daniel sealed (Daniel 12:4) till the End Time) September 23rd 2017 Revelation 12:14, Daniel 7:25  the  3 1/2 years (time times and dividing of time) in context with Daniel 7:12 & Daniel 7:26 of their dominion being taken away. Interestingly the beast judgment (Daniel 7:11) & (Revelation 19:20)different timing due (Daniel 7:12) the rest of the beasts (plural) 1 year (time) 3 months (a season) from September 23rd 2017 puts the draining of the swamp Dec 23rd 2018.  The Jewish need a red heifer without blemish before the temple can be built.  The word from the temple institute is one was born in Israel August 28th  2018 it needs to be 2 years old from conception the earliest date to dedicate and rebuild  the temple November 29th 2019 putting the earliest possibility to the second coming Nov 29th 2026. This is based the final seven years start from the order to rebuild Jerusalem Daniel 9:25 from those interpreting in middle of week (Daniel 9:27) are seven years due 3 1/2 years (Daniel 12:11) If the the second coming November 29th 2026 then the earliest for the Marriage feast of the Lamb 45 days later (Daniel 12:12) January 13th 2027', 'Lourdes Corrick': 'i agree we need to be united. to stand by God. is really the best idea. He created life and is the giver of life can imagine a woman to kill life in her a gift given by God , the face of God this babies see day and nigh. they loves thier there mom and truste them alresdy they feel save by you ; your womb is the only home they got.', 'Sean Newhouse': "You sure won't find that unity on social media (except among themselves) as in Twitter and fb esp twitter that librull cesspool replete with libs all proud of they're  opinions, and heavily veiled passive- aggressive whiny based snarks, giggle-rewarding and all around suckupping amongst the Star trekkers mostly it seems and condscending about virtues...as usual, and as if they're the only ones lucky enough to have friends and family laugh out loud. one of main issues to bring up in this election is trump cutting the red tape and more of so many long on in the tooth failed policies of the past.", 'Lutetia Vollintine': "WOMEN AREN'T ANIMALS YOU IDIOT MARK TAYLOR WOMEN ARE HUMAN BEINGS AND WE DON'T BREED IT'S FOUR LEGGED ANIMALS THAT BREED", 'alex reutov': 'OUR ENEMY WILL LOSE INDEED...THE ONLY UNITY...IS ALL WE NEED...NOT LOSE AMERICA...BUT TO TAKE BACK...ARE YOU ARE STILL WITH US... GLENN BECK...???>>>!!!888!!!<<<', 'Joseph Marcello': "Heavens! Eating while you're interviewing somebody like Mark Taylor is an apostasy... What on Earth is wrong with you? Can't you request your physical desires for even a few minutes until you finished with the interview? This is very slovenly and unprofessional of you, too bad, since your heart is in the right place...\n\nPoor home training and poor manners embarrass you", 'Mike Littlejohn': 'Typical,  the forces that be cut to an ad exactly at the prayer.  Evil everywhere. Good video though.', 'TheJESUSCHRISTRULES': 'Deceivers', 'Cathy Lehman': 'Unity Church in Kansas City, MO, was started on 24/7 prayer vigil.', 'Gary Chandler': "U.S. PATRIOTS AND #WALK AWAY DEMOCRATS U ITE AND MAKE OUR COUNYRY GREAT AGAIN. THIS IS OUR COUNYRY AND THOSE TEARING DOWN THIS COUNTRY ARE TEARING DOW OUR YOURS (#WALK AWAY DEMOCRATS)  AND MINE.. (THE U.S. PATRIOTS)... IF YOU LOVE OUR COUNTRY BOTE THE EXTREME LIBERAL DEMOCRATS OUT.. THEY ARE DESTROYING OUR COUNTRY. DO NOT BELEIVE YHEIR FAKE POLLS , THEY ARE JUST A TRICK TO GET YOU TO VOTE FOR THEM. ALL OBAMA HAD WAS DOOM AND GLOOM FOR OUR COUNTRY AND THAT IS ALL THE EXTREME LIBERAL DEMOCRATS ARE OFFERING US NOW...  WHY DO DEMOCRATS NEED A VIOLENT TERRORIST GROUP (ANTIFA AND KKK AND OTHERS)  . IT CAN ONLY BE VIOLENCE. IS THAT WHAT YOU WANT FOR OUR COUNTRY AND PEOPLE.. DEMOCRATS DO NOT HAVE ENOUGH VOTES TO WIN WITHOUT CHEATING..  THAT'S WHY THEY WANT SO MANY ILLEGALS TO INVADE OUR COUNTRY  AND VOTE ILLEGALLY...THE ILLEGALS ARE ANOTHER TROJAN HORSE. ONCE IN THE DEMOCRAT EXTREMIST WILL BE THROWN ASIDE. THEY THINK THEY ARE USING THE ILLEGALS BUT THE ILLEGALS ARE USING THEM. STUPID EXTREMIST DEMOCRATS. TREAT THE ILLEGALS AS AN INVADING ARMY SHOOT THEM. THE ENEMY USES CHILDREN TO FOOL YOU STUPID.", 'Sydney Smith': 'A wild tempest blew through here last night.  Take a knee to the Lord now.  Can you not see the time and the hour?!!!', 'Mark Earl': 'How mentally ill can you get the Lord told you hahaha your sky pixie story is an insult to all of our intelligence the Catholic church is a global pedo ring are you a child molester', 'rpiepho365': "The Holy Spirit is unity. Father Son and Holy Spirit are one. Christians/Believers are in position to drop even more 'denominational' chains to move forward, bind the 'strongman' and take BACK our heritage/inheritance!", 'Mama Lion': 'God has been giving prophetic word about unity for 30 years through Vassula Ryden. Christians need unity to live a true life in God!! TLIG.org', 'Shelley Ellis': 'https://www.youtube.com/watch?v=ypDFVK7Exfg'}