{'Sir Sidney Ruff-Diamond': 'Comes across very well & reads the script perfectly.', 'Thegoldenemerald': 'The title is technically wrong', 'Ben Davolls': 'How about vote weighing? A couple of Mandatory questions at the top to see how informed the voter is, then depending on the score, your vote is weighed. Ignorant? score 1. Knowledgeable about the current state of the country? score 2. Highest score wins', 'Chicken Chaser 125cc': 'I thought that your vote does not matter because how the votes are counted?', 'Ansai Ricciardi': 'Who cares if your a democrat or a republican, don’t let politics divide each other.', 'Nepharius TV': 'He will always be my president. He’s so cool and he actually cares about us as human beings and wants to unite us as a country. God i miss him.', 'Ababmer Vid': 'Trump: 4.2% GDP, Lowest Unemployment Rate in a Decade. Obama: Nothing.', 'Oh Damn': 'HE👏ISNT👏PRESIDENT', 'shamik chakraborty': "can't wait to see this blow up in the face of Democrats.\nDemocrats want more voter participation. What if More and more voters vote Republican ?", 'hamilton6935': 'Notice how everything in the frame is Democrat blue', 'heylo lp': "I've got the only reason not to vote in US elections. I can't as i live in Germany and i'm not a US citizen", 'a': "I'm from the UK\nI see Obama, I click, simple as", 'Beate Köhler': '*I wanna know his skincare routine!*', 'Jessica Brown': 'Come backkkkk!!', 'Matthew Taylor': "Lgbt glee on his face he's a wrongon alright why would people miss trash like this fool.", 'Gander Suffiane': 'But I live in the UK', 'MrGalgalanda': "ok i'll vote. but i'm a republican. gonna go with my man Trump. MAGA!", 'ShekelHunter': 'ok so basically', 'Dylan Crozier': 'He’s great', 'Akhilesh Murali': 'This applies to every country..', 'Bradly Doko': 'I miss him so much as president 😭💔', 'John Doe': 'Oh but this dirty scum bag has time to send drones to kill innocent school children abroad. Shut up you dirty dog. Your democracy is a failure, it will be replaced by something superior.', 'Keita Foxy': 'Lol for excuse number 2 he’s basically saying ANYONE you vote for would do and it would be better than ending up with D.T. administration in the office again.', 'Raiden': 'I still \xa0love him.', 'Rachel El': 'I feel like he was the president 8 million years ago. GAHHHHHH 😭', 'AidenGH23': "Well I honestly don't care about America...", 'Dáin Ironfoot': 'Holy fuck he looks old.', 'Bija Abba': "I'm a teen and I enjoyed politics especially when he was president.\nTrump has been so discouraging in many ways but it has actually encouraged me more to vote when i'm old enough because i understand my vote does matter.\nEven tho idk much about the actually people running always.\nI enjoy looking at the basics cause that's how everything starts.", 'Nathalie C': 'that " there ´s no joke here" is just fantastic. Ok american people, the entire world laughs at you because of Trump ... but you still have Obama. You still the state that elected the coolest president on earth.', 'Daniel Knapp': "I laugh at Trump because i think he is dumb, i laugh at Obama bacuase i think he's kinda funny. One these things is better than the other.", 'Harrison Engle': 'I dont vote in California because it is always blue anyways.', 'Lewis Conner': '*Ex president', 'Blair Mettam': 'This is a real man and a real President', 'Emperor Yongle': "I don't vote because I live in California.", 'Danielle Calder': 'I voted.', 'Heath Hall-Muir': 'Hello fellow kids', 'Soph D': 'Trust me my dear  president *in my heart*, I WILL be voting. In the middle of being busy with my doctoral program, I WILL be voting! P.S. I miss you.', 'samuel bloch': "I don't have a excuse not to vote. Time to vote Republican", 'Kayla Hopwo': 'I miss you dad', 'Farah Tiffani': "good God, America, don't you miss him?", 'Hannah Craig': 'Its sad how unviral this is', 'Aditya Nair': 'More like failure Obama', 'Ruuod': 'to be fair, trump represents a significant part of america: the morons. \ni dont say that all americans are morons, but yet there are enough to elect someone as president', 'James Bledsoe': 'I MISS OBAMA', 'A   Angela': "Even in Germany we miss the Obama's and can still not believe what kind of president US people voted for, at the last election. \n#8 Your vote has an impact to the entire world!", 'Ditiro Motene': 'Obama looks less stressed 😹', 'knightingale': '3:03 FTW!', '-Genes-': 'Antichrist back at it again.', 'papolap19': 'Thanks Obama', 'Stephen Butler': 'If American midterms are anything like uk local elections, then they matter more than the general elections.', 'Emperor Dank': "Obama seems to get older everytime he's on camera", 'Amber Spath': 'Pokemon Go To The Polls!', 'Estefan Richter': 'Thanks Obama!~', 'Keyshell': 'I would love to see Trump do something like this. Just to see the colossal difference in charisma.', 'Bob dude': 'Trump is better', 'Ben Cummings': "No thanks, I'm apolitical. Doesn't effect me.", 'Jason Mason': 'I’m Australian and it’s illegal not to vote', '30secondstomarsMBH': 'As much as I love him, his answer for "I Don\'t Care about Politics" was crap.\n\nThey don\'t care. They don\'t even care enough to want someone out or to care enough to check out the other options. \n\nThe BETTER answer is this:\n\nJust because you don\'t care, doesn\'t mean politics doesn\'t affect you. The price of gasoline, the ability to move freely from state to state, country to country, the way you use your internet, politics affects everything that happens in your life. Everything. \n\nIt\'s great saying you don\'t care, but you care about your life. If you care about how your life works and what you want in life, you might want to start checking back in to politics, because that\'s a sure-fire way of improving your life choices, if you vote in the right person for you.', 'roadhouse699': "I'm very passionate about protecting the 2nd Amendment and comprehensive military spending based on the needs of the military rather than the desires of politicians who know nothing about it, but I'm also very passionate about non-heterosexuals receiving all the same rights as heterosexuals, as well as slowing climate change as much as possible.\n\nIs there a single politician left in the entire United States who represents my views?", 'Dapple Dog': 'The amount of sheepish ignorance within these comments is amazing. #MAGA 2020', 'Kyle Parkins': 'I can’t vote; I’m too young and I don’t live in America.', 'Austin Hernandez': "I just hate that two only two options really are Democrat and Republican. Primary elections should be abolished to give more opportunity for members of third parties or better yet no party affiliations. I also can't stand the retarded, low IQ, indoctrinated, close minded voters that say they'll only vote for one party, judging everyone of an entire party. Just scroll down this comment section and you'll see waht I mean.", 'IAMTHEICEMAN': "I may not have liked the guy policy-wise, but he's easily one of the funniest and most charismatic presidents to hold office.", 'Zach Frost': "I think it's funny how most of what he says when telling you to vote sounds a lot like propaganda", 'Turkic': "Fucking go away for God's sake", 'NBOd ds': 'The title should say *Former President* ur livin in fantasy land', 'Jacqueline Bucovy': 'OMIGOD I MISS HIM SM!!!!!!!!', 'Catie lady': 'TRUMP IS OUR PRESIDENT NOT HIM!!!', 'Emma Yu': 'All The Right SHADE In All The Right Places！！！dad the babysitter is bullying US', 'Whistling Whistler': 'He knows that the younger generation is more liberal, and left wing in nature, hence him encouraging young people to vote.\n\nNaughty Obama... need a lil slap for that', 'We Deserve Better': 'Sorry Obama but you are part of the reason why people became disenfranchised in the first place.', 'Neptune Rider': 'Obama you convinced me to vote\n\nREPUBLICAN', 'Alex D': 'Not sure why it\'s "President Obama" he\'s not the president anymore', 'Kaizoku': 'Jesus Christ those liberals just shut the fuck up “we miss you we miss you”  get  over it you lost', 'Rob Taylor': 'Fuck Obama.', 'Dora Dennis': 'Good Lord, when will this guy go away??', 'Jan Edmunds': '♥️PLEASE  ♥️E V E R Y B O D Y♥️   VOTE♥️', 'Cruella De Vil': 'I mean he would know', 'Aaron C': 'I’m not even from America and i miss him so bad😑', 'romalovi98': "My problem is I don't have a car and my mom can't take me because we would have to bring my little brother.", 'Catherine Scarborough': 'ANTICHRIST SPIRIT\n - DO NOT BE DECEIVED! He brought in immigration, changed the constitution, RFID & OBABA CARE! ... and so much more, put your faith and trust in NO MAN! JESUS CHRIST IS COMING FOR HIS OWN then TRIBULATION, NWO, MARTIAL LAW, RFID, ONE WORLD RELIGION, WW3 TO ARMAGEDDON, RISE OF ANTICHRIST! WAKE UP NOW!', 'Bomber Harris Do It Again': '#1: a bomb was sent to your house', 'Fiona Cahalan': "It's 2018. Former President Obama. Former.", 'Ashanti Robinson': 'Where is his ring?!', 'Alexander Stromer': "How about this one:\nMost of the candidates are crap and the one's which would be the right choice are far from popular and will never make it anyway. Instead we constantly get mass market rules and people pleasers. Ergo democracy as is, is flawed", 'Vault Boy': 'But he’s not a president', 'Bre ME': 'I wish Trump was Trump but with Obamas personality', 'konakona': "The problem is that people do NOT want you to vote. They want you to vote for their party (or one of the parties they think is ok). Btw. I'm not from the USA, so can't talk about Reps/Dems. There is no party I want to vote for where I live (Germany) and the issue I described really frustrates me", 'Ibrahim Abdel-Haleem': 'And now I wonder how the American people elected Trump', 'Automotive Anatomy': 'Vote for Biden to run for president and Obama as VP for 2020.', 'Hyper Nova': "He's not the ducking president", 'NTM': 'I get to known more about America when he was president , and I find it cool .... if it was today HELL NO', 'A & L Bricks': 'Um not president', 'Dr. Royal': "I don't care about Pokémon either. | *Change my mind*"}{'Friendly Russian Hacker': 'Reminder: This guy is the reason we have Trump.', 'Jena': 'Nothing but respect for MY VOTING PRESIDENT', 'RoadWarrior2006': 'This loser aint the President. And this moron said Trump would never BE President. Aha..', 'Khush Patel': 'what good did obama do??', 'timetowaste': 'Fuck this dickhead', 'gilda': 'why are his teeth blue?', 'Nathan Thomas': 'Obama was high key one of the most overrated and shit presidents ever. So much bias with him just cuz he’s a good speaker and black.', 'Casey Games': 'i sware hes got whiter xD', 'Will Eden': 'Fraud.', "Steven O' Brien": 'Bought by Wall Street', 'Flav': 'MY PRESIDENT!', 'Jack De Vida': "Man he looks old. My uncle is a year older than Obama and he doesn't look this weathered. Still miss this guy tho.", 'Inni Khan': "I don't live in america so can someone please tell me what this election is for?", 'ice cloud': 'Dont you mean "former president" he needs to fucking go away.  He is so washed up, it is quite obvious he doesnt care about the united states or its citizens, he is just trying to get people to vote democrat so they can keep scamming people..', 'Harry Pearson': "He's not the president", 'Douglas  Hamandishe': 'I totally agree - reasons to vote are universal check it out https://youtu.be/o6QPBXkFHEg', 'Lebby Great': 'Orange Man Bad, Democrats good.\n\n/s', 'Valkyrien': 'God i missed the sheer amount of sass this man is capable of', 'Chris Collins': 'Look at all these NPCs in the comments.', 'EC2Jonathan': 'whos j-eazy', 'TKWeckroth': 'I won’t vote because I’m not American lol', 'Sarina Belcore': 'U tell em Obama. Fuck Republicans', 'Nic Bean': '"sometimes these elections (midterms) are even more important than the presidential race." Ppl NEED to know this.', 'Ebenezer Nyenwe': 'Obama is back please be president again', 'Luna T': 'He has so much swag.  God I miss my president.   WAAAHHHH', 'FluXXed': "Shouldn't it say *FORMER* president lmao", 'Godd Howard': '*Mr.Obama or Senator Obama not President Obama, the current POTUS is Donald Trump and after his term he will be Mr.Trump', 'thomas vansteelant': 'Giving me House of cards vibes', 'Horizonts': "Why is obama advertising elections, shouldn't trump be doing that?", 'WateverWatever04': "I love how much shade he's throwing 😂", 'Shibli Ziadeh': "If my vote really matters, then explain the Al Gore / little Georgie presidential outcome. I don't believe in the system period. I bet you, that you cannot point your finger at any politician including yourself, that came into public office to serve us (The Employer) with empty pockets and left with empty pockets. How much are you worth right now Mr. President?. How come we don't have the same health insurance that you and all of the government (Our Employees)have?. So, Please spare me the bullshit, that my vote counts. All we do in this country is, every election we have to choose who is going to fuck us the least with the red, white and blue dildo, and the choice between plastic or paper bags. I will end my comment using the bullshit line that all politicians uses GOD BLESS YOU, AND GOD BLESS AMERICA, lifeless slogan, lifeless politicians. Good luck America.", 'Mr H9736': 'I want tomorrows headlines to read Obama infers that Dancing With The Stars is rigged. We all know those bullshit talent shows are. Time to bring and end to them.', 'Vaskor Basak': "Whoever uploaded this video seems completely out of touch with events - the title should be 'Former President Obama...' rather than 'President Obama' (although I'd probably be much happier if he was still President).", 'samuel fitzpatrick': 'Mr Obama is the best', 'hugo h': 'I miss him, heck I miss Bush! \nAt least Bush would make me laugh', 'Paul Gibbons': 'The whitest black American they may ever elect.', 'Anthony Olmo': 'Why isn’t voting day a national holiday?', 'Dustin Townsend': 'No candidate wants unequal pay for women. If a woman works the same job, with the same amount of hours as me, she will make the same. Period. If you start paying women more, then and only then, you will have unequal pay.', 'Mysterious': "it's not president Obama it's just Obama", 'Akshita _': "The irony is they're still addressing him as President Obama. 😂\nEveryone hates the orange Cheetos.", 'Richard Ugwu': '"Scrolling through endless photos of your dinner on Instagram"😂😂', 'James Lane': 'I disagree with him on so many things politically but damn i miss his optimism and candor.', 'ok skeleton': 'Ex-president', 'Kris Papa': 'Democrats are trying so hard ... can u please finally get lost', 'Graf Guy': "Aah yes. I miss the good ol days. Back when Obama was creating the Libyan slave trade, selling untraceable guns to Mexican cartels, giving planeloads of  unmarked cash to our Iranian enemies in pursuit of nukes, destroying the job market, GDP and bailing out Wall St with your parents' tax dollars. The good old days. But gosh golly he sure talks pretty.", 'Cornflakes And Milk': "He's not the president no more, just...Obama.", 'Chris Lagos': "President Obama is a sellout. \nI will vote, having said that, \nHis just vote premise , presupposes that there will be a name on the list that will move us into a brighter future than the present. He was instrumental in the  bought and paid for results of the 2016 primary election. \nHarry Truman once said that if you leave public service richer than when you came in, you're a crook. By that measure alone, president Obama is a crook, setting aside the fact that the long held Republican pipe dream of a health care mandate is now the dnc flagship, The fact that he brought more fracking in the United states and overseas to countries that didn't want it than ever before. The man is a disgusting sellout in my view.\nYes, he's eloquent , so what's the point if we're sold out.", 'ansh garg': 'He’s good.', 'CarrotShaker': 'omfg i literally cant even with him, he talks about other people being uninformed when literally so much of america PRAISES obama for doing absolutely nothing, even in his presidency he was useless.', 'C P': '*Former President', 'Jasmine Alize Plata': 'You will ALWAYS be my president! I love and miss you and your family so much, and I will never forget all you have done for us in those magnificent years.', 'Luke': 'Is being sent a suspicious package on the list', 'Mason Bahney': 'I love yah man but some of those jokes were crinngggyyy', 'Jamie': '"President Obama" he ain\'t President', 'At The Phrygian Lion': 'He also doesn’t have time for middle eastern kids pleading their innocence before his drone strike wipes them and their families from the earth', 'Royce H': 'Even though this video is slightly cringy, it makes a good point.', 'Natalia Turner': 'I shared this video to everyone I know that is NOT registered to vote!!!!!!!!!!!!!', 'Jenely Ramirez': 'LMFOAODJSOSLS HE’S THROWING MAD SHADE I MISS OBAMA', 'Gunnery Sergeant Hartman': 'Why does he look so light skinned in this video', 'vvrench': 'Married to a guy \U0001f92b', 'Ba To Ni': 'VOTE for TRUMP!', 'fromASIA SSO': "easy-iest publicity for Google, but he's absolutely right we should vote for what its really matter. miss him a lot", 'Amanda N': 'Bring Obama back..... please!!!!!', 'Perry Dubreuil': 'Cool guy .Can make anything sound exciting .Us Canadians love him', 'Aj Tamburino': 'I’m republican but Obama is the coolest president ever regardless of policy and biases in this video', 'Dom Goate': 'if no one else will say it, i will,\nhe has not been president of the united states for TWO YEARS.', 'george h': 'Obama was the best president and honestly sometimes I think he is still the acting president. The only thing I want to know is, does he dye his eyebrows, because they are great.', 'zachary nachin': "Lmfao... When obama said that the 1% GDP was the new age. That how is trump going to make these deals and make America great again?? What magic wand does he have???\nNow you look at it... He's taking credit for trumps economy. When he made deals in other nations to keep companies there.... Fucking funny... Told all you liberal fascist that the new GDP was only going to be 1%. When the GDP has moved to 4.5%.... And yet he's the greatest President? Nd trump is a joke?\nBut I bet half, You liberal fucks are benefiting from Trumps economy with his magic wand that Obama said that he didn't have....", 'That’s The Badger YT': 'What if I live in England?', 'Gunmetal Grey': "I can't wait to for trump 2020!", 'Joseph Doty': "why vote when it doesn't matter. Our vote goes somewhere then someone just does whatever they want. take for example the electoral college. Its a load of crap. Another example is MA with there recreational marijuana vote that passed in 2016 and nothing happened. I'm tired of me voice being worthless because of how this insane bureaucracy of bullshit works.", 'Nick Hilliard': 'Former President Obama*', 'Can I get 500 subsribers with no videos?': '0:16 “I don’t care about Pokémon”. SO I GUESS OBAMACARE WAS JUST A MYTH, HUH?', 'Chick Magnet': 'propaganda', 'Sukh Mykoc': '"Is there any kind of introduction or are we just plunging in that huge asshole." What?', 'Yonny Chavez': "Lol that's first comment about Pokemon😂. Okay he's convinced me.", 'Katrina S': 'That was not a like a president', 'HappyOnLifeCuzBeans': "As an outsider looking in at American politics, I don't have a dog in the fight. I do find it weird however, that race relations in the US took a massive step backward during the tenure of their first black president.", 'Diddyguy24': "How about instead of complaining we all accept that Donald Trump is our president for at least the next 2 years. I don't really like him that much either but I'm not going to cry about it.", 'mhffc': 'Could one be " I don\'t want to vote for a President who authorises the execution of a wanted suspect on foreign sovereign territory" or " A President who escalates the use of drone strikes and in doing so kills more innocent civilians ..', 'Platinum Pineapple': 'OBAMA 👍😍', 'Arnav Dinesh Kamath': "Here's an 8th reason. I'm a minor", 'Ceebo Vid': "I remember when 90% of comments were smack talk when he was president but with the perspective of trump lets reminisce the good ol'bama days. Just an observation, I see sheep.", 'Avengers Newbie': 'I know nothing about USA but I do know Obama was way better than Trump.', "Nathan's Channel": "You know he's not president Obama anymore", 'Jay': 'I love this man.', 'Zawjat Mansoor': 'We Want Obama Back!', 'J. Sanchez': 'Damn Barack shots fired at my Instagram feed *pew*pew*', 'eiecheverri2': 'I love you.', 'KleenerBro': 'Holy crap how distorted can someone be to actually think Trump is better in anything than Obama? He even beats him in Whiteness if that makes any sense.', 'user name': 'Lol, still calling obama president', 'Banks': "Obama still doesn't get it.\nPeople are struggling, they don't give a damn about sexual orientation or where you fought in uniform.\nIt's about policy, policies that make sure people can work full-time and not need to rely on welfare or food banks to survive.\nP.S. many rich/wealthy people don't vote, all they do is donate thousands and politicians like Obama do exactly what they say.", 'xXFeralArtsXx': "Obama can shut the fuck up this manipulative lying SOB. His opinion is irrelevant, his word untrustworthy. Man's going around saying how cool he is, meanwhile deaths in black communities and general gang violence had tripled under his great leadership. Fooken Trump is doing more good to black folk than this piece of shit.", "Klaus O'Shaunacey": '“You wouldn’t let your grandparents pick your playlist...” hey my grandma gets some banging songs going', 'Henry Ijeoma': '*"...and climate change is a hoax"*\nOoooooooooh burnnnn!!', 'MrGamerman001': "I like obama, always have. But I think this is the first time I've disagreed with him. Voting does NOT work. An entire state could vote blue, but if the delegates vote red then the state is going red. This is why we should only base elections on popular vote."}{'edwin mason': 'This guy is the best - why ever did the American idiots vote for Trump?', 'Ken Hewson': 'Go pick cotton', 'John Taylor': "What's wrong with Pokemon?", 'Alexis Halliwill': 'He’s the one that needs to come back!', 'Sara Gold': 'What a nut case...', 'Daz69H': 'The UK is so pleased you got rid of this puppet and replaced him with a real president. Trump for a second term please.', 'Sam Sedge': 'Pokémon fans represeeennt!! Pokémon forever!! 😍😍😍💘💘💘💞💞💞💞', 'Mülly 1960': 'vote for Obama, he was a REAL president, not a joke', 'NAMiR L': "....damn didn't recognize him with how white he looks.", 'David Gonzalez': "Don't care if your republican independent democrat liberal or conservative please share and vote", 'gary The snail': 'Here 2 dislike', 'rhukie k': "As a Brit, it's nice to be reminded that not every American voted a chimpanzee into the Whitehouse.", 'roblex63': "Shouldn't you be out there helping starving kids or something ? instead of doing this shit...", 'AlyssaIsBored': 'thATS BECAUSE THEY HAVENT HAHA i love obama', 'robot6644': 'Number 2 is actually kind of sexist and racist. You are assuming that because someone is the same race or gender as I am that I have to vote for them or that I relate to them. You are a black man who grew up rich. You have little in common with a massive chunk of "your kind" who have had none of the pleasures you\'ve enjoyed since birth. Definitely was a terrible choice for this video.', 'photo Kemp': 'He is as evil as Hilary', '- -': 'Well he does have time since he made this video...', 'Harrie Healey': 'Lol Obama sucks, trump is da man😎👌🇬🇧', 'Delaney Shaw': 'Didn’t know this joke was still President.', 'JamaicanRain': 'LOL at the "no time".  Obama acts as if he\'s never been busy.  He should try being a parent sometime.  You\'re taking care of your infant in 2010 and suddenly it\'s 2040 3 kids a life later and time\'s flown by and you realize then you haven\'t voted in decades because of busyness and you STILL can\'t vote!', 'Johnny Dickshot': "He's no longer a president.", 'john phillips': 'Eternity is to long to get this wrong. Accept Jesus Christ today, we are not promised a tomorrow. It is a free gift, take it. Do yourselves a favour and check out these channels, Truth Happens and ODD Reality.', 'IronPeter': 'whats orientation got to do with the person you vote for.', 'RatherA': "What's his exuse for destabilizing two countries? He ordered to bombard Libya and kill their leader and ordered to arm rebels in Syria? So what's his excuse?", 'Mora Ognian': 'i miss you', 'John Smith': 'Michelle is called Michael a tranny', 'Kian Irajy': 'you fucked us over, Bush did too, and so has Trump. But I send you my love and respect from IRAN, for sending us Nowruz Messages (however symbolic they were). Long live the Islamic Republic of Iran, and may God finally bless America.', 'Aditya Sanjeev': 'Fuck obama.', 'Scorpius1691': 'Excellent video', 'mritachi15': 'VOTE WE NEED EVERY VOTE', 'The English Gentleman': 'Thank god the bomb was intercepted.', 'Grace Ward': 'I think he’ll be known as the best president in history for a long long time because he was just such a loved amazing man!', 'Flam ingo': 'I love him so much', 'Atlas': 'Yet when you vote "someone" better they tend to go the other way Obama although you was somewhat ok you wasn\'t brilliant.', 'Mario Rossi': 'Wasn’t this guy in power?', 'ItsIxel': 'I miss Obama even though he wasn’t able to do much because of the 2010 and 2012 midterms. Just vote!', 'Dakota': 'I still hope Republicans hold the majority (:', "King Of Combat '": "Remember, voting in Democratic elections is shirk. \n\n*Stay Muslim, Don't vote.*", 'Chinmay Moghe': 'Damn. His face looks paler every time he shows up on TV or on camera.\n Anyone else notice this or is it just me?', 'Pat Johnson': 'Blah Blah Blah who cares Mr Pacifist Let the Children die OBOMBO cause I am alright jack .', 'King Reef': "Suck it Americas. We're laughing on your white house show", 'nbfkiwff7': "Let's be real almost everyone wants back at least 1 Obama", '1OFGODSOWN': 'Bottom feeding POS on his best day.', 'b oi': 'lmao obama be shading trump', 'Mr Tea & Crumpets': 'Is it just me or does he look more white now', 'Leonardo Paolini': 'Shit guys, this is so well done, he is top level politician.', 'A': 'He is not the president why call him president Obama? He is a expresident EX.', 'calvhill': "He was a shit President, let's not beat around the bush.", 'Nezekeh': '...and we don’t have time for his fake bias deceptive ignorant rampant tyranny.\n\nHats to off to Trump,  a real man, getting shit done, not this puppet cunt.', 'Klumsy Kameleon': '1:55 *SO TRUE, EVEN IN THE UK*', 'Sahara Vixen': "Bro ain't PRESIDENT!!", 'James Wayne': 'Terrible President. He allowed the black ghettoes to go crazy burning down cities that were already overrun with criminals like Baltimore and Chicago.', 'Chris Kayser': 'Wow, he really became old', 'Tom Butcher': '3 reasons I like watching Obama give speeches 1.) He can actually speak intelligently 2.) Obama is a funny 3.) I like reading all the pissed off replublican or trumptards ranting and raving.', 'Edp’s Late Utility Bill -': 'Raise the voting age to 21', 'Marcus Thorén': 'Even if every president of the US is a muppet of other elites, this man surely made politics in the US feel real and relatable. His voice is so soothing too. We miss you, Obama.', 'M E Hendrix': 'The only reason I’m not voting is I literally can’t. I’m not old enough. And my state isn’t participating in the midterms.', 'Hazues': 'Shouldnt this say former prez? We have moved on to better things people', 'mcdonaldswarfare3': 'Why do people miss obama do much? Things were worse when he was in office.', 'Lion Vision Studios': 'Man I love Obama.', 'sde1': 'https://www.youtube.com/channel/UCA9nJt6jYLgWw-EDs-OJ2zA', 'mazin merza': 'And that is why, you will always be missed mannnn!!', 'wsde4': 'https://www.youtube.com/channel/UCD-l_BGjkLekvjDZJ7gIHgA', 'Imjustheretowatch 123': 'God I wish he was still president, when life was great, when trump wasn’t in a good position of authority', 'CatMom': 'A REAL president! God bless him.', 'Raucous Lovemuffin': 'So... anyone heard yet that some geezer LITERALLY TRIED TO BLOW HIM UP TODAY???', 'Nina Steffen': 'I know this is super irrelevant but is he wearing lipstick?', 'Jayden L': 'Even as a Dutch person, I miss him.', 'Rookiereece': 'You say President, Nah Ex President... 😎', 'Michael Harrington': "But your vote actually doesn't matter. The result of the election won't change if you go to the polls or not.", 'Jamie Dabber': '‘President’', 'Ben Ward': 'Is he becoming more white? The fuck?', 'Quinn Orleans': 'Fun fact: Obama [and every other former U.S President] is currently on a pension of $200,000+ annually - excluding additional finance such as free travel and postage which can raise this amount to over $500,000 annually \nMoral of the story: Screw 9-5, just become the U.S president and work for 8 years tops ;)', 'Hashim ThaDream': 'I miss this man so much!', 'Rollace The Jazzmaster': 'Why are people still calling him President Obama, he isn’t president anymore, get over it', 'Collin Macavoy': 'What kind of beta cuck likes this guy? 😂😂', 'Harith Mikail Mohamed Nasser': 'Hey guys remember when the us was not rascist and FOUGHT A WHOLE FUCKING WAR TO STOP IT BUT A CARROT FACE IS ABOLISHING ALL OF IT ANYONE REMEMBER HUH', 'Paul Shutt': 'Trump! Trump! Trump! Trump!!!', 'Imam Dwi Septiadi': "man he's good at speaking, please make a late night show mr.president!", 'Albert Einstein': 'President Obama? ... President. Ok', 'Kyle': '#3 So your sayin my grandparents are dumb', 'Will Lectar': 'Loving the multiple camera angles 😂', 'MR. SAVAGE': "*Do you aprove this message?*\n\nalso Im not even old enough to vote & I don't even live in America so why am I getting involved with the conversations in the comment section", 'Gargoyle One': "I'll never vote for one of those transgender fucks. They're a joke. That first excuse was my excuse, but putting it that way? I'm gonna vote this year.", 'StukaJi86': 'Meals on IG is pretty boring', 'Adam': "Glad he's not the POTUS anymore XD", 'Vamsi Krishna': 'He is such a great orator..True LEGEND...', 'PaladinVII': "I don't agree with the examples he makes in #2 and #5, they are fueled by the democratic narrative.  However, his underlying message is excellent!  GET OUT AND VOTE!  There is no excuse!", 'Seth Belfort': "He's a cool and a funny guy. But was a pretty crappy president", 'Arnas Žuk': 'Damn this is is a clusterfuck of soyboys', 'Hylss': 'Looking forward to his Netflix special.', 'John Goodman': 'Another moron former President of US.', 'Hibz xo': 'GOD I MISS HIM...', 'Boneywolf de': 'What am i doing here. I’m Singaporean.', 'Ooh Oops': 'Obama ca joke and trump is a joke', 'Naima Khan': 'U guys do know the current president is sh*tface Donald Trump, right ??'}{'Hozay': "Well, he just changed my perspective in voting. Guess I'll vote.", 'CCG-C': 'Um.... he NOT THE PRESIDENT lol', 'CamouflagedAk1mbo': 'He doesn’t care about Pokemon \n\n\n\nWhat le fuk', 'Theguy2295': "Don't share that you voted, share what you voted for", 'Redvibes A': 'Boi u best start caring', 'RenegadeRaida': 'Why are you still calling him president LOL', 'Flappy Bird': 'Obama is soo full of shit. Glad to have Trump.', '*YellowMan In Africa*': 'This not Obama. LOL', 'John Howard': 'Worst. POTUS. Ever.', 'Jeanne Jaurès': 'Obama groupies are so blinded by their love that they don\'t see this guy, beside his little jokes and "cool attitude", was just a terrible president.', 'Harambe': 'I LOVE YOU OBAMA.\n\n\n\n\n*Walks in with MAGA hat*', 'Kaino': 'I love how Obama can speak almost freely, it’s fucking great', 'aragorn elessar': 'Damned illuminati puppet. #trump2020', 'PogieJoe': 'He is always so natural and comfortable on camera. Miss him dearly!', 'Anastacia Allan': "Damm Obama's looking good. Good for him", 'de wolff': 'Go home', '10 10': "Still ain't voting", 'Lynchy The Classical Liberal': 'Thank god he had is arse kicked by Trump in 2016.  Obama has plenty of nice talk, but never got anything done.', 'The Bloodroyal': 'If 100 percent of american citizens voted we could get a representative government, well that and throw out first past the vote.', 'BattleCarrot': "Benghazi\nOperation Fast and Furious\nIRS Scandal\nUsing executive orders to steal power from congress when they wouldn't get his laws through\nIran deal\n\nThese are just 5 of the many things Obama did terribly wrong. Maybe check them out before worshiping him.", 'Andy The Wookie': 'Shut up Obama you did nothing but make the problem worse increased our debt, got more people on welfare, fucked healthcare.', 'Mr Patraeus': 'Death to this tit. Globalist bastard', 'Oot spagoot': 'Good guy, horrible president.', 'JinXPrince': 'What did Obama actually do for America?', 'Travis Rabble': 'A useless puppet of a President, an absolute embarrassment of a President. You might as well have put a sponge in charge as it would have absorbed more than this idiot. Regards', 'rocker4577': "What about, its a total sham and a lie and he's one of the greatest deceivers of all? Answer that.", 'Miguel M': "I don't know why but this doesn't feel cringey to me and I know it should, so great work makers ( and Mr Obama ) keep it up", 'Vincent Campaert': 'Classic leftist propaganda', 'Gian Santos': '1:54 Student loans is one of the leading causes of early in debt. Why tf would you want it easier to access. So you can get the young people of America back on depending on you? No. Awaken little sheep and shake off the chains the Democrats have tied on us and vote right. #MAGA (I am aware of certain policies the republicans have made, but essentially it doesn’t even matter really if you’re a transgender from a male to female, just mark female. Or if you’re really unhappy with that, then start a petition and they’ll change it. But whatever you do, don’t vote left. Unless of course, you want the destruction of this country in around a year, because that criminal George Soros wants only the end of our sacred United States.', 'JY Assistant': 'Who is this old man and why is he teaching us about google?', 'This Rebel is Scum': "Everyone should vote, because if you don't vote you can't complain if your government is made up of morons.", 'Leo Bullock': "Oh how short people's memories are......\n\nHe was another war monger who lied and lied and lied......\n\nJust like Trump just like Bush just like Clinton just like Bush Sr and so on and on and on and on\n\nAnd yet look at all the love for him lmao......\n\nYou people are fools", 'Steve': "Don't care if the candidates have a penis, vagina or nothing... I just want candidates that are GOOD AT THEIR JOB.", 'Rik Hughes': "I've never liked this man, I find him a false puppet. Sure he's good looking, suave, perhaps even sophisticated but he does not deliver. I do not like Trump as a man, I find him slightly un-couth, but he does what he say's he's going to do. If someone does not do as he/she is told he sacks them, how refreshing! Trump is a politician who actually delivers his campMillions of people voted for Trump and they are justified in their choice. If you want mediocrity bring back Obama...……… if you want change for the people Keep Trump.", 'esketeet scots': '"President"', 'Akshath Manikandan': 'One of the best presidents in American history, who helped America fight the recession and saved the country’s automobile industry. \nI wish all that was possible in the current circumstances....I agree on some issues of immigration with Trump though... but kudos Obama!', 'MJ H': 'It`s sad to see that other countries have the same problems with Non-Voters as here in Germany... I wish that our former chancellors would do things like this. (and would have  humor like this. Mostly our politicians are boring...)', 'sol walker': "The easiest way to make your student loans affordable is to be born in a country other than the US seriously why do you guys pay so much? It's capped at £3k a yr here", 'Loch #1': 'A Good Man if there ever was one.', 'Ching Chong': 'Say all you want, obama was a chill mothafucka. I would want him to narrate my shitty life lol', 'Punkster': 'Democrats are in such a mess you give left-leaning people no one to vote for. Partisan loyalty is not a good enough reason. It is time to focus on the future and you cannot do that while you are still looking back at Obama.\nThe Democrats need to be sorted out and sorted out fast.', 'renge99O9': "Someone ask this dude if he will endorse Hillary Clinton for President in 2020.   Then you'll see some REAL shuck and jive.  :-D", 'David Love': 'Oh yeah this is what a capable President looks like! It’s been so long', 'a B': 'Globalist shill', 'DS YAMO': '"thats changing this year." where have i heard that before, oh wait. i remember, your campaign. thanks obama', 'Alezey574': "Keep it real Obama. Voting doesn't matter coz it is probably rigged", 'Kessler 2072': "My excuse: I'm 15 and I have more political views than any adult I know.", 'Tommy Moore': "He's not President anymore.", 'King man': 'Fuck obama for destroying libya!', 'Tyler Campbell': 'Former president*', 'Marmelademeister': 'I think this is a really important message.\nBut maybe it would be time to change something about your election system. In Germany we are doing a lot of things differently, and I would argue: better. For example, elections take place only on Sundays. Also, there is a voter register for every electorate. Everyone in the voter register receives an election notification by mail like one month in advance, and the notification includes the address of the polling station.', 'Flavius Belisarius': "If you are uninformed that's the perfect excuse not to vote.  What's to stop you from voting for someone who stands for the opposite of what you want", 'Agent SEPTEMBER': "I want to express how much I miss this man, how much he is needed more than ever today and the good that he can do, but people are already saying what I'm thinking better than I could articulate. It's good to see people who know a good person when they see them.", 'TANKS': 'God I wish this man could be our permanent leader', 'Precious McNeil': 'He looks even better!!!! Miss you so much, Mr. President. Someone who carried themselves with dignity, but who also had a sense of humor. Now look what we have in the office, a joke.', 'MADK 27': "Lol they don't call him former president it's like trump doesn't even exist 😂😂", 'Thomes Maisling': '"Google is super easy to read" True unless you\'re reading about POLITICS. Then the results of your search are almost always a confusing mess of spin and and contradictory opinion. After all how can you get past the opinion to the truth, when spin and opinion seem is all that\'s available?', 'Archangel17': "I never understood why the US elections are on a working day or why this day isn't at least some kind of national holiday on which people don't need to work.", 'Bebe AlRasheed': "I'm not American but I miss Obama so much<3", 'Michael Parleblue': 'Anti American, none American, anti-white racist, bigoted radical islamist sympathizer. WORST PRESDENT EVER.', 'Adrian Blair': '"Former President Obama" 😘', 'GashCam': "Anyone with a brain wouldn't give a shit what this dick smoker thinks", 'MarxY': 'He makes America look sane again.', 'Greggybread': 'So the lying hack that is Obama has been pulled out to help the dems', 'Kane&chloe': 'He’s getting whiter 😂', 'FunkyAnimal The Earl of Funkdom': "Obama is a great orator and charmer. He was a lackluster President. He did nothing to confront China's trade war with the US. Race relations deteriorated under his watch.", 'Gabi Ghita': "At #2 when he was listing more representative candidates like women, LGBT, etc. I was so hoping he'd say atheists but I guess that one's still taboo. Still, it's always a breath of fresh air to see Mr. Obama. Reminds me of what normal should actually be.", 'Xrisus94': 'I dont like politiks. \n\nLook i dont like pokemon. But that dosent stop it from coming back! - Obama.', 'Man.': "Thanks Obama, I'm gonna vote all Republican! :D", 'Wikan Hastuningdyah Budiharto': "those eyebrows tho'", 'vegoman': "Glad he's out of office", 'Fabio Roberti': 'I can literally see his strings', 'Jack Dog': 'I’m not American, but this guy is so damn likeable and this current one is a dick.', 'KOROSH Babaei': 'Thanks a lot for sucking up to Iranian regime and giving them millions of dollars to crack down Iranian people and help Assad in Syria ,Hezbollah in Lebanon,Hotis in Yemen,Ghods forces in Iraq,terrorists in Bahrain  .You sided with \nislamic dictatorship and wrote love letters to rootless ayatollah .You betrayed Iranian people and Americans,we hate you for that. You handed Iraq in a plate to the  islamic government of Iran for god sake. As once said ,by grate power comes a grate responsibility ! Thanks a lot for all that , haj Houssein Obama .', 'Zealot Wang': "There are two interesting points from this video. First, democrats thinks that they are a party for young people. Getting young people go out to vote will benefit them. Second, more people go out to vote is a great indicator that a country's democracy and government  is becoming increasingly dysfunctional. Therefore people feel the urgency to vote. Trust me, more voter turnout means things are getting scary and polarized, more gridlocks in politics.", 'Gary Oldman': "Why does it say President in the title? I understand that a lot of Americans are unhappy with Trump, but it's a bit weird still calling Obama the President. Makes me think ATTN: is a biased source and not worth subscribing to.", 'Sebastian Kristiansen': 'Good riddance you war mongering, bought and paid for, race baiting charlatan. Republicans will win again and again.', 'Danster82': 'If He was honest he would say the will of the people is not fullfilled in government so voter apathy is entirely understandable. We need to reform beyond representive governance to utilize technologies for more direct governance by the people without middlemen.', 'ldstof': '*Former President', 'Minetoutong': "People that does not care about politics should not vote. \nIt's a terrible idea to make them vote.", 'Caspar': 'The bias of YouTube is astonishing. This guy is a puppet & the same people who run YouTube. Have less influence on the way America is governed..... good!!', 'Alex Alone': "I never understood it when people said Obama was a terrible president, I thought he was amazing, he represented everyone, he was easy going and kind and he truly cared which is so so rare in politics these days. It's just a shame it took Donald Trump for y'all to realise how great Obama was and get nostalgic for him", 'Mar Wth': 'Guess he can have gadgets now hahahah', 'david g': 'Do t worried fellow nocs I will be voting', 'Matt James': "He's not the President", 'Da Illusionist': 'He is not black. 👻👻👻', 'Emilyy': 'Idk why I’m watching this. I’m to young to vote and I’m not American 🤦‍♀️😂😂', 'Aditya Sharma': 'Wish we had a head of state like him', 'ΛDΛM': "I love how brainwashed americans clearly are with how they're acting in the comments lol", 'Matt Lee': "He ain't President anymore he's just Barack Hussein Obama now. \nGo away and crawl back under your rock and let pres Trump sort out your mess. MAGA", 'Olympia.WA': 'I miss Obama. I’m not American but he represented world values better than most other presidents. The US I a huge country with a lot of influence. The decisions they make can help or hurt the rest of the world. Remember you’re not just a part of a state or a province or a country, you’re a citizen of the world. The things that happen in one country can affect us all. All votes matter. Make sure your values are represented.', 'Yeemø Katherine': 'I’m from the UK and even I miss him. He cared about his people and changed the way people view the world.', 'Mannez Mootseng': "I'm not American but I so as hell would vote just cause Obama encourages voting!!", 'Hayloom Terence': "He's such a sleazeball", 'Cheesie 65': 'I didn’t like Obama but we can all agree that people should vote'}{'Reginald Wigglesbottom': "My vote does not count. That is always a good one. On October 20,2018 in Peachland, British Columbia, Canada there was a municipal election. When the votes were counted the winner was won by 1 single vote. There was a recount done and it turned out that it was a tie. Your vote counts. You live in a free country, take advantage of that and exercise your right to vote. Many people in the world don't have that choice.", 'January Baby': 'Has my guy been dying his eyebrows?', 'Grodioz': "I'm not even American and he convinced me to vote.", 'BladesOf Wrench': 'Who’s voting red with me?', 'Black Salami': 'Fuck having a tranny president no wayy Idc what you say', 'Rohan Walia': "Pikachu's gonna get yo ass", 'L I L Y Z': '‘I don’t care about politics’ - former president Barack Obama', 'nivolord': 'I feel a bit disrespectful for teleporting around mr. Obama.', 'Richard Sharpe': 'The gushing sychopantic comments here are very cult like. creepy.', 'inf1n1': 'I Just punched myself in the fkin ballz....If u tell every1 we are doing alien space shit then i will be down wid it coolio sweet but no1 iz fooled, that we aint 50 yrs atleast behind bs tech and stupid choices, yeh tour black secret choices np just come out out, we all know ur secret hand we dont care we just want stop being lied 2 we know who runs the world we can fkin see it....we dont give a fkin shit stop hiding u fkin f4g lords looooool....grow a dickand show us some BALLZ', 'carol H': 'Listen', 'LupusGelos': 'FORMER president. Literally a has been', 'Hi Jack': "Okay..not an American. But why will you hate on this guy?? He's the nicest guy I've ever seen", 'Pritam Sinha': 'EX-President.', 'Kyle Noe': "He's still my President. Idk when tf they're gonna bring in the next one. I'm happy with the one I've got.", 'Joe White': '"I\'m not into politics" is a perfectly valid reason not to vote, why would we want someone who knows nothing about politics choosing who governs the country? Uneducated people voting is what put trump in power.', 'Dylan D Fleck': 'Voting is rigged in favor of the republicans. Just look at what’s going on in Georgia. Several thousand black votes apparently don’t count.', 'T ZJ': 'EX-president*', 'Chris chris': "It's true all old people vote and they don't know shit about the modern world and look at the shit they have voted for in the past they made a right cunt of it choosing all the wrong people   over and over again the youth vote is the one that counts they aren't senile cx💜💜💜", 'kayincat': 'What do real leaders look like? Like him. Someone who encourages positive actions and who empowers you to strive to be the best version of yourself.', 'Tim': 'Please Mr. President, ask your daughters to run for President when they are old enough.  We need a Woman in the White House! And a FEMALE OBAMA would be extremely exciting and hopeful.  Obama for President again ( when they are old enough)', 'pilkerss': "Young people in America need to VOTE! YOU CAN DO'S IT!", 'Leia Jiang': 'I have a great one, i am chinese and 16', 'Macario Patrick': 'All he did was repeat himself and told people to go vote.', 'Toni Pwneroni': 'LOL, silly yanks and their optional voting. Just make it mandatory like any normal representative democracy.', 'Andrew J': "I can't vote. I'm Canadian. But I watched this entire video just to remember what it's like to hear a U.S. president form complete sentences.", 'Ed Mob': 'i don’t even live in america and i’m voting because of him', 'Elizabeth Hoover': "SO refreshing!!! Amen to everything he said here. I am SO tired of people not voting and complaining about the state of things. No excuses, don't be a part of the problem. Thank you, President Obama.", 'King Liberal Mc’GayGlobalwarming': 'Half my friends use these bullshit excuses, and it’s sad because young people are the future on changing politics from grumpy, apathetic, and shitty old fuckmeisters to people who care about women, lgbt people, minorities, and getting universal healthcare.', 'Patrick F': 'Man, Youtube are shameless putting this on trending trying to effect the elections, while deleting thousands of Youtube channels for supposedly that very reason.', 'Chris Callear': 'What about big business funding both sides to make sure they get their policies through either way?', 'ross mcfadyen': '7 excuses for the current presidency being so successful \n7.trump \n6.trump\n5.trump \n4.trump\n3.trump \n2.trump \n1.usa', 'Sheikh Mohammad Adil': 'Hahaha....Obama called out those congressmen illiterate in Internet 😆😆😆😆 lolz best thing', 'EKEKEK88': 'Sure they’ll all vote for republicans', 'Skipper': 'He is such a matured smart and gentleman. On the other hand Trump is such an arrogant person.', 'Macobsession100': 'We’ll see Obama, we’ll see', 'SlimThrull': "Regarding point three: If my vote matters, then why is it that it wouldn't have changed the outcome of any election? No election I've ever been able to vote in has been decided by a single vote. Not one. So, claiming my vote matters (in other words it would have changed anything) is demonstrably untrue.", 'Anthony Garcia': 'I love that the title says ‘President Obama’, not ‘Former President Obama’', 'JBzzzz': 'Obama is a ghetto hoodrat', 'Shim Novak': 'A great man indeed. We miss u Obama.', 'Amin': 'I am not even American or live in America just watch it for this guy awesome person', 'NPC 1873872': 'Orange man bad! vote demorat!!!!', 'C.D': 'My vote has been gerrymandered out of relevancy by Pennsylvania State Republicans.', 'NonScience': 'Aparently Obama hasn’t heard of the Equal pay act of 1963... Equal pay has been a law for 40+ years and he mentions it as an issue?', 'Nathaniel Russell': "Excuse #8, I'm not 18 until November 8.\nPlease give me tips on how to vote in midterm with this problem.", "It's Cris": 'Obama with those comebacks tho😂', 'Hubble Tea': 'He’s been president for as long as I could remember, it still feels like he is. I’m a 2004 baby btw', 'Adan Vera': 'did I  hear woman rights and lgbt rights not on my watch.', 'Avissa A': 'THIS IS EVERYTHING.😁', 'Brent Mcchesney': 'I’ll vote. I’ll vote to keep America great.', 'superhanfeng': 'So refreshing to see him and hear him talking after getting used to the way Trump talks', 'ShadowEspioFan1': 'Its funny seeing the former president still keep going after the election cracking jokes and having a good time.\n\nI may be a UK person but Obama was a great president no doubt.', 'Rin Kagame': 'Raise in minimum wage = No change in wage for employees making more than minimum wage > Food, Housing, Daily Necessities costs goes up > Larger divide in economy. I’m all for helping those who are struggling with money, but minimum wage is not our answer.', 'Steven Williams': 'His eyebrow are perfect.', 'shock jockey': '#notmypresident', 'bacm flatstart': 'My excuse for not voting is because not only am I 13, but also because I am too busy looking at votes from minecon earth', 'Mahiraj Singh Chufal': 'This is the worldwide problem. This video should also be available in native languages of different counties so everyone can be benefited.', 'Athen Tang': 'is it possible to drag obama back for a third term somehow', 'Bill Jordan': 'Hail trump hail victory hail our people!', 'La Pal': "He looks so much healthier now than when he was running for President. Good to see he's living a happy life.", 'Yol Stumah': 'Obama actually looks good like he looks less stressed', 'John Appleseed': 'Voting isn’t a bi-partisan issue. I don’t care who you vote for, just vote.', 'Hamza Khan': 'Like is there anyway Obama can come back? 😂', 'cody codytin': "What if I'm a conservative republican, am I allowed to keep those guys in or should I only vote for Democrats?", 'Molly Spackman': "I LOVE YOU OBAMA!!!! You are my hero and i want to thank you for everything you've done!! You are the person that made me proud to be an American!", 'Hank Moody': 'What a nice guy', 'Louie Shipman': "But he's not your President", 'Langpty im': "Because they haven't! LOL", 'Thahir Ahmed': 'Lots of people missing him, huh, Fuck this puppet. Thanks for the ISIS ahole.', 'Senator Doge': "I like how he kept neutral, didn't mention any parties or any candidates. He kept it professional", 'xZANZIBARZx': "*I ain't a fan of Obama*\nBut the Pokémon joke was awesome kudos. Hopefully he wrote it\n*I don't like Pokémon either and that shit is sooper zombie; it just won't stay dead*", 'Gray Edgar': "He's that turd that just doesn't go down the pan!", 'Antoinette Motley': 'Obama. I pledge my vote!!', 'Josef Stalin': 'One citizen of Wyoming has the same voting influence as seven Californians', 'loni75041': "I miss the days of a competent president. Every time I see or hear the name Donald Trump, I'm reminded of one of this country's biggest mistake.", 'Livvie V.': 'My vote for dancing with the stars matters a lot in my mind thank you very much', 'Mr. Grey': '_"A vote in this November\'s election actually does matter."_\nNo it often doesn\'t and as a former president you know that. Unlike pretty much every other democracy on the planet we don\'t use a popular vote for our leader. Your state\'s Electors are the ones that vote and your "vote" is just a suggestion that they do not have to follow.\nIf you\'re in a red state and vote red you\'re a drop in a bucket of red paint, if you\'re in a red state and you vote blue you\'re a drop of blue in a bucket of red paint.\n\n_"There are people running for office that don\'t think women should get equal pay for equal work"_\nPeople like you? They already get equal pay for equal work, when it\'s actually equal work, but you wanted to give them more because debunking the Wage Gap myth is unpopular.\n_"who don\'t think we should do anything about schools being shot up"_\nWhich is every president in office for the past 70+ years, including yourself. None of you have the nuggets to *really* go against the gun lobby.\n_"Who don\'t think we should raise the minimum wage"_\nAgain, pretty much all of you. Sure you\'ll make token attempts but none of you will really go against your corporate masters.\n_"Vote in somebody that shares you values"_\nNobody that shares my values will get close to a position of power.', 'Roxy Hall': 'Google!', 'Staedler Staedlerr': 'idiot.', 'Amal Edward': 'Hey Barack here, i loves memes! What a fuckin tool', 'Grayson Eckland': "Excuse number 8 I'm too young", 'Amalie Oub': 'My president', 'Nemisis 007': 'I feel like there’s just a big meeting room in the White House just to discuss Pokemon 😂', 'Geovany Lizarraga': '"I don\'t have clean underwear, I can\'t vote"', 'rope 05': 'He looks so old', 'Vibha Vadul': 'I think Obama stole that grandma line from Michelle 😝', 'Deonea Wenzler': 'Thanks Obama!', 'Street Wise Hercules': "Just don't vote for politicians like him, things should be fine.", 'ManiacOnMars': 'I cannot get used to him with grey hair even though I saw him slowly turning grey...I MISS YOUNG OBAMA', 'AmbientSmokeCraze': '"... it allows them to do nothing about the things that you\'d like to see government do." *I\'d like to see government f@!k off*', 'Edward Kinsey': 'Why does the US have an 8 year rule as President? Obama  is the best president since Lincoln', 'GoobNoob': 'Not the president.', 'Robert Brown': '65 thousand dollars worth of hotdogs eh?', 'Just4 Kicks': 'He would run as a senator again', 'Jack Davison': 'Why couldn’t the American laws be like the European \nThen Obama could have stayed and there wouldn’t be orangutang running the country'}{'Adam A M': 'i dont get his pokemon joke', '[EU4] Crimea': "Hahaha I legally can't vote", 'Jakker271': 'Tosh.', 'MasterOogway': 'The mark Zuckerberg senator thing was funny. Haha. They had not idea what the Internet was. Poor lizar.... MARK, I SAID MARK', 'Joy Chowdhury': "I'VE NEVER SEEN A WHITER BLACKMAN IN MY LIFE.", 'Victor Magistralis': 'A lot of butthurt libtards here xD', 'Jog stevens': 'Cool now lets see what Trump says to these excuses', 'Buck Fitches Met Goney': 'Hey, President Obama isnt the president', 'delboy trotter': 'I liked obama i like trump more!', 'mike oxbig': 'LMAO at the delusional comments on here....talk about being in denial. what colour is the sky in your fucking world, \xa0he\xa0was voted the worst president since the end of WW2 !', 'skunkshmuggler': "Wow he could be in  Running man !  Look at his eyes . He knows he's full of shit lol", 'Nick': 'He looks quite old in this video. A shame to see such a great man is also affected by time', 'Curry and a Pint': '@0:40 "If you want to throw a wrench in their plans vote for someone better". *EXACTLY*  GO Trumph!!!', 'Kamran Kazemi-Far': 'I miss Obama, I really like his personality, I dont live in America but I hope you Americans vote, you people deserve better.', 'Alex C': "The dumb thing is...you could have 10 people vote or 10 million people vote it doesn't really change anything..its like printing more money all it does it devalue money and cause inflation - the more people that vote the less valuable your vote becomes if it were just 10 people your vote would actually have a big impact", 'Unfunny Earthling': 'Doesn’t care about Pokemon \n, hmmmm seems fishy', 'Ahaybalewithasliceofmelon': 'You don’t get to moan if you don’t vote, when you vote moan all you like.\n\n(I’m british)', 'NPC': 'THIS IS NOT PROPAGANDA - OBAMA IS COMPLETELY UNBIASED - LET US REJOICE', 'Chauhan Ashish': 'The coolest President Americans ever had.\nHe touched lives globally.', 'Working Joe': "DON'T BE ANOTHER NPC - TRUMP 2020", 'BigT53': 'Trump 2020', 'Sue Lewis': 'Hmmm where\'s number 8?..... "I don\'t want to vote because I don\'t wish to collude with a system which has proved to be corrupt"\n.', 'Charlotte Colbourne': 'Miss you Obama😫', 'chillout1001': '1 hes just Obama now ,HE IS (N O T President Barack Obama) HES A LIER,HE IS SICK.HE FUCKED THE PEOPLE OF THE U.S,TRUMP HAS DONE ALL HE SET OUT TO DO WHAT DID OBAMA DO HE TOOK YOUR CASH AND KEPT HIS MOUTH SHUT,HE HELPED IRAN GET NUKES,HES NOT U.S BORN.HIS BIRTH CERTIFICATE IS A LIE,PROOF IS OUT JUST LIKE HIM AND MICK', 'joo ni': 'Good god America, get your shit together and go vote.', 'Ini Ejidele': 'Obama used a playlist analogy 😂', 'matzmx': 'Such class. Well spoken. And compare to what you guys have now...', 'Ven': "I'm not American but I'm watching this cause Obama", 'Hamzah Patel': '2:30 Did he just insult 83% of America 😂😂', 'Lord Kek': "Can't be bothered.....doesn't make a difference.", 'xShadow': 'barack was shit lmao', '234,790,792 views': 'Hes not the president doe !!!.........he is just Barak Obama...........', 'TankNuke44': 'Okay I will go vote Republican now!', 'ursusrex': 'I Just Have One Thing To Say... OBAMA Is My President For Life.', 'kevin mucyo': 'Miss him 😭', 'Martin Shkreli': 'hes a good sales man!', 'Jessica moreno': 'Godmmit! Obama is so freaking smart! Argh! I got to go vote!', 'Dave Davidson': "Vote them out, oh you mean vote for one of the two guys that actually have a chance. I'd happily go and vote for a total change to the system, removing most of the people involved, but we all know its the same people from the same class taking money from the same big companies etc. But what do I know, nothing, so I probably shouldn't be allowed to vote for change I can't even understand anyway. I'm a natural optimist by the way.", 'Felix Schoppen': 'I miss you barack!! Most unapreciated president ever!!', 'Ben Ward': 'Nice guy but a fucking useless president!', 'Anwarul Sifat': 'the coolest US president ever!!!', 'Bradshaw': 'Please come back Barry! We miss you and Michelle!', 'Joseph Juarez': 'Fuck you ATTN your are a biased news source against Trump', 'Deeq Adan': 'Even White People love Obama Funny Motherfucker lol', 'Kelly Corcam': "It's more than words, its results.  If all your life needs is happy words have Mommy read you a fairy tail before you go to bed at night.  The rest of us Americans want a President who accomplishes what he campaigned on.", 'Omer Demirkan': 'Not biased at all.', 'rocklesson86': 'I miss him so much.', 'Jonny World': 'Glad this guy is out', 'Janelle Glass': "I love President Obama, but what's with the Jay-z and Bey? Come on...they are overrated...smh\nBut GO VOTE PEOPLE!!!", 'TheMojojay': 'Yeah its important to vote, for people like him, he did more drone attacks on anyone else, no trial , no jury, just killed from afar. I dont worry about putin or any other ass hat leader, just the dickheads of leaders that america bangs out.', 'Danny The Nerd': "President Obama? Uh no, he ain't the president no more.", 's10dlka': 'Remember the days when the US President could...you know...talk in coherent sentences. \nNowadays you need to be more educated to get a high school diploma than be the leader of the free world!', 'Jose Santos': '1 excuse. I’m not of age to vote', 'Benzaiten': "I miss President Obama.\ncan we please pretend the last two years didn't happen?", 'Chris Sanchez': 'Attn: proof you are deluded, he is a has been. No magic wand , he could not figure out what it takes to create jobs and get consumer confidence. Socialism is not the answer.', 'Mizloudmouth7': 'Throw that shade Obama!', 'Cruise Addiction TV': "Being uninformed about who is running and what amendments are up for vote is because we get bombarded by advertisements for the people and not what they have done and what their plan is. The amendments are advertised with little to no information on them. If we can stop the attack ads and have ads for the people that have plans to change the system, that would be much better and much easier. Also the advertisements don't have a website that I can go to for myself and look at what these people are going to be putting into effect.", 'Levelonesucks': "Damn he's good", 'Thomas Schaefer': "I'm from Germany and it's so funny and at the same time pretty awful that Mr. Obama is still after he's out of office for almost two years now, far more presidential than Trump. This is an outside perspective", 'George Cross': 'Thank you Former President Obama! I’ll be sure to take my ballot and vote for the Republican candidate in Delaware 😃', 'Ben Velasquez': 'Like how Latinos helped him, yet his administration has the biggest deportation numbers ever? Neither one getting a vote.', 'Chase Forestello': 'Obama tell us WHO thinks that school being shot up should stay that way? Just who? Who think women should make less than men solely because of gender? Who? Politics is nasty, almost all of these fuckers lie and take advantage. 700,000 minors illegally entered the U.S. so Obama decided to grant them "normalized residency" but he damn sure wasn\'t going to grant them citizenship all the while the tax payer pays for it. Trump on the other hand says tough shit BYE BYE and everyone freaks out???? Open your eyes, Obama knew what he had to do to look good but he knew that citizenship was not an option so he does the bare minimum while creating a massive long term problem in the process, all to save some face? Thanks Obama.', 'Feder147': 'Lol Obama turned white', '0 000': "In a way, it's sad that your former President has to do this, exactly what I am trying to tell people on my own bloody humble channel and I am European-African but white so no views, at least Barak Obama is great شكرا باراك اوباما!", "Jo'kel": '"as most things, voting\'s more fun if you do it together." meanwhile in germany...', 'Kjelly Lund': 'He made me want to vote, but then I forgot I am not American. I am Norwegian.', '// Braneofficial //': 'Dude im from germany and even I wanna vote right now.', 'Demon Slayer 561': 'Dam obama aged 30 years in the last 10 years.', 'mayaa03': 'OBAMA ! what dumbass! just SFU and go away', 'SonOfThaSoil _': 'He had 4:32 of time to say as much tho lol', 'shimmy.ojeleye': "us not voting in 2010 led to one of the worst losses in congressional seats for the incumbent party in the history of our nation, in obama's first midterm. maybe we can make up for that a little by voting this november? happy voting people.", 'R C': "why does his voice sound so weird sometimes? It's almost like they didn't record some stuff and fixed it in editing by mashing together clips", 'MK KUMAR': 'man we miss obama', 'Zephyr Stobart': 'I like this guy. He should run for President.', 'Em W': 'I live on the other side of the world from the USA and I don’t think the midterms are boring.......', 'wendynico25': 'So sad and sorry for America', 'felicote': 'Snarky Obama is my favorite Obama', 'Rezolutionist': '"...because they haven\'t." - superfunny, Obama rocks!', 'G.S.PRASANTH JUREDDY': 'Man, he is so cool....i wish India have a president like him....he is never seemed like a president , he is like a Friend of people.', 'AlejPix': '1:18 😂', 'The 40 year old vegan': 'Oh my President, my President, \nhow I miss thee and rational \nthought and compassion!', 'boykiddman': "Obama: Go out and vote! (slips in recommendation on which party to vote for.) \n\nThis isn't about informing the public. It's about getting young voters to vote blue. Sure Obama is a cool dude, is way more eloquent than Trump, and has a better sense of humor, but this is still propaganda guys.", 'Nicholas Tarpinian': 'He looks younger', 'Clay Carmichael': 'Yes I will vote. I will vote Republican', 'Sooner Admirer': "It's ironic that young people want to vote for Democrats that have already said they would either raise taxes to save entitlement spending or just refuse to touch it (which will incur more debt).", 'NCC-1701': '#6 and #7 in my state is non existent. We have mail in ballots.', 'Ranjit K. Nair': 'This guy is awesome! Respect from India. _/\\_', 'R R': '3:20 Well Mr. President... there are some lazy people out there that you can’t pay them to get them out of their living room to go to vote.  I’ll bring you an example. I worked the phone during Hillary Campaign. We were provided with maps and locations of voting places as well as campaign volunteers on the ground. There was a person I called and I asked her if she would commit to vote. She said well she doesn’t know where the voting spot is and I told her she said she doesn’t know where it is. While on the phone I google map(ed) her place from the voting place. Then she said she thinks it’s too far of a walk. I said I understand I can arrange a ride for you. There are campaign volunteers on the ground who would gladly come pick you up, wait for you until you vote and then drive you back to your house. She made all kinds of excuses and I asked her if Hillary is the candidate she would vote for or would she rather choose Trump? Her responses was swift! Hillary of course she said. Well guess what Mr. President, I almost am certain that she had no problem flying to DC on the Inauguration Day and shout and protest. Did it matter then? Did it even change anything? Well that was too late wasn’t it? I’m not blaming her specifically but there are thousands who were in the same situation. I hope lessons have been learned. Thank you for reading. And thank you for staying involved! I’m still with Her!', 'o m': "how do you decide between two candidates when both of them have views you despise? i want to vote, but i'd feel guilty voting for either of them.", 'Captain Howdy': 'The best advertisement would be Obama was not a dream Time to wake up and vote 🗳 MAGA 2020 . And then finish it off with this was paid for by wake up America . Org', 'Javon Ezell': '😂❤️😂❤️😂❤️😂❤️😂❤️😂❤️😂', 'NPC#0R4N93': 'Blue wave baby! 🌊\n\n(Seriously tho, as much as I hate commie bastards, I miss you papa bama)', 'Rohmash': '"I don\'t care about pokemon, but that doesn\'t mean it won\'t keep coming back" Put that in the history books folks.', 'MOTH': 'Daddy Obunga 💦💦💦', 'Blondie Wise': 'Thanks Obama', 'jhorn188': "Only problem is when the so called democracy is so corrupt that it's really an oligarchy run by the big money corporations. No matter what candidate the people vote for, the politics will not correlate with the peoples wishes at all, but correlate very closely with the interests of the rich.", 'Minho Song': "I'm currently outside the country. How do I vote?"}{'ishu gupta': "Excuse 8 : Obama isn't running", 'Janno Jacomille': 'Straight to the heart of non-voting snowflakes...', 'CrystalCoyoteX': 'That the trolls are here, imitating delusional movements like the birthers that have faded into obscurity, should serve as a heads up to everyone. They do not like this man. Some say "bring him back," and others say, "identity fraud" but the inflammatory aspects are the same.\n\nDon\'t let them get to you.\n\nIgnore that bs and hear pay attention to the guy who actually has something real to say. It ain\'t me, I\'m not that full of myself. But the guy with the real message just released a very patriotic video telling you and your mamma to get out there and vote.\n\nYou should. I don\'t have to agree with you, but you should. You have that right. So vote, and don\'t let that caustic riffraff in the comments turn this into a firestorm for you.', 'T J': 'How do we know who to vote for?', 'Black Dot': 'american people are sick of these liberals bullying everyone on their tv shows award shows VOTETRUMP bitch', 'staring beyond': "What's happend in USA nowadays? Neverthless obama is a former president, why he has been appearing on media so many? I'm Curious.\n- from S korea", 'Victoria Shore': 'He aged so beautifully.', 'Winchester2247': 'This man is the best. I miss the days of real men.', 'mwood341': 'God, a dose of NORMALCY. Obama, we miss you out here man. \n\nI hope you’re enjoying retirement, you really have earned every single second of it. #ThankYou', 'Krispy K': 'Thanks Obama. I think I’m gonna vote for the non corrupt party republican', 'Grant Chay': 'FORMER President Obama', 'Ryan Davies': 'Didn’t like all of his policies, but the man has decorum and charisma and for that he has my respect.', 'Jessica Montague': 'I miss Obama, it was nice having a president with a moral compass', 'DrMD': 'Screw everyone. Don’t vote', 'Muhammad saim ali': 'Hello\nI am from Pakistan and love obama', 'Mathias B.': '8th. Republicans kicked me out of the Voting register for being Black/Latino/Young/living in a liberal area….', 'Anthony Rogers': 'He is El Jefe', 'Sk. Sabit Faisal': 'coolest president the US have ever seen', 'Adrian Robinson': 'His ears is so big... Lol...', 'Deon Van der Westhuizen': 'Somehow he managed to put a massive divide between the USA races.', 'Zzul Ma': 'What a cool guy. 2016 feels so long ago 😭😭😭', 'Surbhit Agrrawal': 'Although I’m a Right Wing supporter, one has to agree that Obama’s youth connect is just amazing!', 'Christopher Dibbs': "I don't get all this about not voting. In Australia, it compulsory to vote. You literally _have_ to vote - it's illegal not to. You'll get fined. \nBut I agree, looking through what people had for dinner probably _is_ boring.", 'Key': 'How do you do fellow kids?', 'Aaditya Desai': "Even I'm not an American, I still enjoy his talks. Coolest president I've ever seen! 👏", 'Timmy Smith': "I really liked his responses for excuses 2-7, but my main thing is excuse one. I don't really care to much about politics and I'm still not sure why I should?", 'Yigyigs': 'This is so savage I love it. This can relate to any voting system I guess', 'Inês Machado': 'No longer president but still cares.  <3', 'Ozioma Sydney Eze': 'We won’t even let our parents pick our outfits! 1:55', 'Kjell056': 'obama trying to stay relevant like', 'griffin lamp': 'He looks better, the break for him was much needed.', 'Buddhika J': 'Thanks for the advice We vote 🔴🐘RED🐘🔴 ....... btw heres a little trivia..\nMiserable doomed era of US history is considered as 2008-2015', 'InkMonTima s Poetry': 'Miss him so much oh my God', 'UninstallingWindows': 'He should have said that its a new challenge that everybody is taking part of.\nObama: "Eating tide-pods is so yesterday. All the cool kids these days take pictures of themselves voting for the most reasonable candidate"\n* Highest voter turnout follows *', 'Eric Girardet': 'Hello everyone, I am from Switzerland and you probably know that my country is really small compared to your country but here, our political system is based on Direct Democracy. I don’t know if you could apply that system to the US. \nWhat the world doesn’t understand is the way you electe a president. Yes, this unbelievable thing call the grand electors system. It seems completely outdated and unfair. A candidate could win the majority of the citizen votes but still loose the election because of that grand electors system. Is there anyone or political party who wish to change it for a more fair and democratic one?\nAnd, YES, please go and VOTE! That’s why your veterans made the ultimate sacrifice, is that you, regular citizens, can live in a democracy. If your rights and freedom is getting slowly away from you, your nation is drifting slowly but surly into a dictatorship like (lovely) Russia (I love the Russian, it’s a great nation) or Turkey (and Turkish people a really nice as well)\nVOTE!!!', 'Alvin Lee': "My God, I've missed this man.", 'lisa koola': 'i love you ❤️ we love you \nhe is my President 🇺🇸', 'Jason M': 'Obama we miss you !!! TnT', 'Evon Williams': 'Can you please come back we miss you', 'Mugiwara no Hana': 'Why are his eyebrows so dark, but his hair so gray', 'G- Ridez': 'I mis a president with a longer brain span that 1min', 'Daniella Gourie': "Im uninformed because I'm from and live in Sweden, but can Donald Drump get removed from his post if he loses during the midterm election??", 'shortylickens69': "#8 I've been voting for 22 years and nothing gets any better.", 'AWESOME SAUSEY': 'Miss having a guy who could make a good joke', 'Adam Donahue': 'How did they not include, “I’m only one person. What’s the difference?”', 'Brandon': '283,000 views so far. Every one of you mf’ers who is eligible to vote better do it. Otherwise this is just another YouTube video you watched while you were sitting on the toilet.', 'TheBusttheboss': "I don't think Obama would want you to vote if you were Republican.", 'Sukriti Kiran': 'God... I miss him', 'wmrt167': "Just got my absentee ballot today and voted abroad from Japan! Don't sit this one out.", 'Sergio': 'Uhmm...Obama * not president Obama', 'The Angry Intellect': 'You\'re a fucking idiot.  You said in the title "president Obama" - HE ISNT THE FUCKING PRESIDENT.  You don\'t post shit and say because at one point in time someone did a job so they are forever referred to by their position in that previous job.  If I stop working as a delivery driver for dominos and become a CEO of a bank, I\'m not still the delivery driver.\n\nFucking dipshit.', 'Benjamin Tarrant': 'this channel likes comments that call Trump a joke and then tells us its unbiased.', 'Xavier McQueen': 'People, please don’t just vote by party. Vote for the individual that appeals the most to you. This goes both ways, just because you are left or right doesn’t mean you only have the options that you side with. Please do some research before picking based solely on if they’re red or blue.', 'Acin75': 'Haaaaaaah!I love this guy!!!!!😍😍😍😍', 'dnahubs': "This was great!  Informational, witty and funny.  Come on now everybody, if you've got time to view this and comment, then you've got time to vote.", 'Shikha K': 'That this has less views than pewdiepie in the same amount of time saddens me', 'drsupremo88': "Hahahaha that's because they haven't", 'mclifer': 'Hit the road Jack!', 'Mohan Bhargava': 'Obama please come back for heavens sake. We are exhausted with stupid voldemort. Please please please come back.', 'King Sasan': 'I’m not Australian but I clicked just because Obama was in it 😂', 'jj jj': "I don't have time to get an absentee ballot", 'cioda': 'Lord Almighty. Obama had his issues. But dear God did he actually show that he cared about the people of this country. Not just the white ones. \n\nI would vote for Obama if I could. God help this country.', 'Oliver Lutsch': 'omg America you fucked up so bad. You had the sweetest most genuine guy as president and now you have a joke. Go change that again! you can do it!', 'concernedspectator': 'What a class act. Brb gonna double check my registration. vote.org', 'Kimmy Lester': 'What an icon', 'Sandro Togonidze': 'Obama is such an og.', 'bitecha bitechabitecha': "Oh thank God, you're back! Have you seen how crazy this administration is? Save us.....oh you're not staying? Damn", 'Florian Miller': 'can you imagine such a video in a few years with trump?', 'Sandy': "Increase minimum wage ceiling and people actually lose jobs, because small business can't afford them, anymore. These politician use demagoguery, w/o any clue about Economics.", 'Great Value Bleach': 'I miss Obama’s terrible economy.', 'havingicecream': "God he's awesome", 'Blahblah Bubu': 'Wow, he looks good w/ grey hair.  😎', 'disastrophe143': "Democracy is a sham. Your vote doesn't matter. Don't bother.", 'rivr crse': "1:24 He was trying really hard not to laugh😂. Can't blame him. We need to vote all these dinosaurs out!", 'Islam Ibadullayev': '😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘', 'superplan89': 'If Texas came out in high numbers, Beto will win, but it’s about the same...so ted Cruz wins', 'Hollis Adams': "he's my president", 'Ethan de Mocskonyi': 'Not voting. Simple as that.', 'Red D.R.O': 'What is it with democrats and Pokemon, *flashback to Hillary* "Pokemon GO to the polls"', 'shilohtlw': 'How about i just want america to fail?', 'ranga rajan': 'Damn.. "looking at your dinner photos in Instagram is boring" you guys got obamaslapped.', 'SuperHorseman22': 'Obama sucks. Voting does not matter', 'Lynn Belvedere': "Watch 11/9, Mr. Michael Moore's new movie, and tell me you believe this man or anyone else for that matter. There are times where your vote does not matter. Ask over 90% of the voters in the great state of West Virginia. Thank you. -Mr. Belvedere", 'Daryl Wathen': 'Such a quality guy with good advice. He makes a great point about those guys not knowing much about the internet, The internet is a pretty big deal now, it seems politicians should have a clue about it and how it affects people.', 'Hotpinkrandomness': 'How I miss you you sweet angel man', 'Ed Moritz': 'I miss bork obma hate orange man sexist pin pls', '•Magnivince •': 'My god the amount of ignorance in this comment section.....\nListen I get you hate Donald trump and I hate him too but the amount of peo le who think Barack Obama was a messiah for America is TOO DAMN HIGH.\nGuys let me remind you America’s dept literally got worse by 1 TRILLION , let me remind you the fact this was the guy who caused fast and furious THIS was the guy who literally fucked the entire Democratic Party by giving them more than 10 million dollars in debt\nSTOP KISSING THIS GUY’S ASS!', 'Loïc P': "This man had class and sass, I'm not even american and even I miss the obama era", 'Stir It Up': 'Dude wrecked my country for 8 years and now he’s destroying YouTube too? Enough already!', '2miscme': "This is great... LOLOLOLOL and hahaha!  I'll be voting for sure!", 'Annette St. Clair': "Vote early if you can't make it on election day. I just did today."}{'Rene Casey': "Thank you Mr President! I'm 17 right now, but I GUARANTEE I will be voting Trump out in 2020!", 'Jash R': 'Obama really out here backseat presidenting and I couldn’t be more grateful', 'snail snail': 'How have you been most effective in persuading someone to vote?', 'Tyler cox': 'I’m pretty sure the only reason we are still in The Middle East is to stop ISIS', 'ibrahim mohamed': "I don't vote because when I go for holiday outside of the country I still have to vote or I will be charged with a lot of money. I'm not registered so they don't know if i voted or not. \nI'm from the country don't think I'm illegaly in the country!!!", 'Jeffrey Hudson': "I freakin hate this guy!! So glad I don't have to cringe when I watch Fox anymore!!", 'Pawn Doe': 'Awesome! Minus the scrolling through dinner thing... That joke has been played for at least 5 years.', 'SoniCraft98': 'I’m a republican. I may disagree with Obama on a lot of stuff, but boy do I miss this dude’s way with words. Thanks for convincing me to vote, Obama!', 'Haikrisna': 'This guy create isis in middle east and stil hve ball to talk about politic', 'NiogHalvFemsProblemer': '"My vote doesn\'t matter." Aaand he makes absolutely no mention of First Past The Post, or the importance of a representative democracy...', 'Leopard-King': 'Sweet hopeful innocent children, the political saviors that implore you to vote them in for your protection are the ones that rigged the piano to fall on you in the first place.  Vote if you wish, but only two things moves politics, money and arms.   Ready for your two styles of leadership?  In your face, unsophisticated, brute apathy, or clever, charming, sleight of hand apathy.   Both sides hand out their bones.  Good luck suckers!', 'djhero0071': 'I really don’t give a fuck if you align more democrat, republican or what but if you’re 18, you should vote!!! You gotta vote!!! Governor, senator, state judges!!!! All of these guys affect you more directly than the president!!!! Guess when they’re voted for? MIDTERMS!!! So if things feel like they’re going wrong in your state (like high college tuition, unjust laws like for abortion rights, etc.) \nV O T E!!!!!', 'SwedishBlouse': "He's not the president...he's trash...", 'Angelik Yusty': 'Jajajajajajaja I love his sarcasm 😜😜😜😜', 'TheRoflcopterGod': 'I wish politics was based more on good debate over current and proposed government held morals, ethics, policy, and law, but instead it’s more about who is the most charismatic and/or instigating. This has been a potential issue ever since the radio was invented, giving FDR a natural advantage over any possible challenger (because how can a person compete with someone who “talks to you”). Social media has made this worse. I am reminded each time I see Trump or Obama speak on camera. Btw, I hold nothing against Obama and I was a supporter of his so no personal attacks please.', 'Yimei Cai': 'The former president is forced to work more because the current one isn’t doing work.', 'Afruza Hasib': 'Oh God! He’s glowing!!', 'Generalsaurkraut': 'Nice guy. But he couldn’t run a lemonade stand. I’ll take the crazy asshole that gets results.', 'notanonymous': "02:30 damn Obama, you didn't have to scalp me like that but okay 🙃", 'Grace O': 'Already voted! 💥', 'stringtheoryOW': 'We gotta meme this, but this is very informative', 'ColdBacon 400': 'I miss him like a college student misses home cooked meals', 'angel83119 Fiona': 'Papa!!!', 'Jacob Johnson': "I love Obama, but God, this is the most overtly millennial-pandering thing I've ever seen.", 'Madison Grooters': 'Obama’s really out here dissing millennials through jokes about Coachella, using the internet, and a Beyoncé concert 😩🔥💦 we need him back in office', 'TWSTF 8': "Remember when our President WASN'T a complete embarrassment? \n\nAh, the good 'ol days.\nWay back when a person was expected to have at least as much integrity as the people whom they were elected to represent. \n\nBack when the greatest Nation in the history of the Planet insisted on a basic level of honor and civility in their leadership. \n\nLuckily, the arc of history ALWAYS bends towards justice.", 'Alexandru Zepciuc': 'I was small, stupid and not into politics to enjoy having a real, great leader of the free world :/. And here I am in this nightmare...', 'Tribune Luke': "Failed to answer a large reason why people don't vote.  Neither candidate holds values or represents what you believe.  Of course he wouldn't have an answer for that.  Party politics subverts democracy at all levels, reducing your choices to a binary options, both of which aren't worried about your particular interests or concerns.    I wish for a day I could ask some one like Obama such a question.  What does one do in the face of a democracy that no where near represents what you believe or what values you hold?  What does one do in the face of a democracy that operates with only the consent of it's own party members.  I did not consent to this current Government and I perhaps will not consent to the next Government.   Of course no one wants to answer, difficult questions.", 'Sudarshan Jain': 'It heppens quite less that you enjoy listening an ex-world leader so much... Its an absolute joy to listen to Mr. Obama...', 'Rajon Rondo': 'Lightskin Obama, fuck cp3 ringless head ass', 'Nito Maldonado': 'When I see trustworthy candidates that actually have valid truth and character.\n And represents my people then I’ll vote.......', 'Jonanice': 'his cracking up at 1:25 made me smile', 'Lucy Bonilla': 'Damn Obama looks different. He looks well rested', 'Neil Johnson': 'My god do I miss this man....', 'Cons and Piracy Theorums': "If you can't address me directly and say my name then you are worthless and marked for death. Fuck you Obama", 'Snodge Kat': 'Vote!!! My dear American neighbours, please VOTE!!!!!! 🇨🇦💖🇺🇸', 'stephen sewell': 'muslim cunt', 'Richard Bidwell': 'When are we gonna make voting days a Federal Holiday? Seems like this should be a major goal for Democrats in the future.', 'Jerry': "3:37 Obama giving everyone who doesn't vote the finger 😂", 'Jed Findlay': 'ATTN:  Please edit your captions, they are not correct in a few spots. Thank you.', 'LadyHashZ': 'Shut up.', 'Sam K': 'Useless president, total waste of 8 years.', 'Chenai Sabeta-Boadi': 'Is this really Barrack? Or is this a fake?', 'cyndie26': 'Here\'s another one: if you live in a constituency with a "safe" seat, the "safe" candidate may rely on the lack of opposition voter turnout to win the election, potentially leading to a loss of a "guaranteed" election. Go out and defend your candidate of choice, whether it means defending the "safe" seat or opposing it, as your candidate may have a chance at winning just as much as your candidate has a chance at losing.', 'Jose Juan': 'All the probar that put a dislike are probably brainless haters who does not want a successful country, but a circus and a pig shitting all over their faces while they do nothing!!', 'Kirby Le': "Went from Bush to Obama and then to Trump? Bad to good to worse. Let's not make the same mistake again.", 'Miriam Mazer': 'Come back, Obama. T_T', 'Elizabeth Starling': 'Mah man', 'Tiny Rock': 'He’s killing it even when Luther has a day off.', "Qisthas Noe'man": 'Haha this thing has google', 'Shietal Ramesh': 'For your own sake America .. take charge before it is too late \n---------  Rest of the world', 'Jason WakingUpDad': "Politics 100% aside. Obama is just a better human being than Trump... I'd rather invite Bush II to my thanksgiving dinner before I'd pick up a phone call from Trump. God I miss having sensible president. Right or left I dont care.", 'Navateja Vardhan': 'He is roasting trump in a way', 'César Cormier': 'i MISS THIS GUY!', 'W. Kamara Njoku': 'He doesn’t stutter anymore hehe love you Barack.', '*김태진': "Obama is as weak as Jimmy Carter. I'm glad Trump won in 2016. Trump 2020!", 'sewagii': 'Why is voting always about choosing what you like?`\n\nThis is total bullshit. You should also vote if you are not satisfied with any candidate. Maybe you do not have a favorite, but there are also candidates that you do not like?\n\nYou are hungry and you can choose cold soup OR hard bread. No one would think of anything to eat. The cold soup tastes like shit, but is still better than hard bread', 'LiziBeth000': 'The makeup artist did him wrong...', 'ziv71': 'Obama is the real joke', 'Archibald Tuttle': 'This is so refreshing!', 'Kalana Herath': "To those who don't care about politics: Okay, but politics, though not being your interest, very much still affects your life", 'lil lizzard': "I really don't understand why you guys in the US need to register for voting. Isn't it enough to just be a citizen and bring your ID?", 'Rex Arthur': 'Lol scrolling on your endless dinners posted on Instagram is boring 😂😂😂 teach on Barack Obama.. #CivicEducation', 'Sathyajith Shankar': "God, I hope all these appearances by Obama actually make an impact in making the dems win because boy I'm scared", 'Jovanii Patino': 'Type in your address boom it’s that simple .\n(Camera change) (awkward silence)\nThere no joke here ..', 'FrozenMonkey824': 'So, basically vote for baby murdering, illegals loving, sexual assault accusing, filthy fucking Democratic worms. No thanks Obama.', 'Jessica Harding': 'That a man with class, intelligence, sensitivity and humor. MISS HIM', 'Ellie Corr': 'I miss Obama!!!', 'Christian Topayung': "I don't trust any of candidates", 'sandy ray': 'Wow go away already.', 'khabane Cisse': 'God! This dude knows how to talk!', 'XiD Chan': 'So……Obama becomes the wise old man finnally.  —from Key and peel Skit😏', 'Jason Nge': "Obama is the president we'd laugh with. Not like trump the one that we laugh at.", 'Thank You': 'Honestly i miss this man so much everytime i see him or hear a speech from him... I just cry!!! That man had so much class!!!!!!! So much class.....', 'Ty Chanel': 'God I Miss Obama😕💕', 'Devin Padilla': 'What an absolute unit. Love that lad!', 'Justsaying something': "Meanwhile In Sweden, we might have a re-election cause none of the parties got enough votes to win and they can't work together in order to decide which party should lead the country. Good times to be alive.", 's.0nam': "I can't vote because I'm not American.", 'Kyto Bytes': 'Voting simplified:\nDo you want to do heroin with the Bloods?\nOR\nDo you want to do meth with the Crips?\n\nThe two party system is incredibly flawed, and 3rd party wont win because everyone says "3rd party wont win", rather then just voting 3rd party. \n\nWhat I have learned, is pretty much everyone is incompetent, yet thinks that they are perfect. \n\nAll i want is a president who agrees equality is important ( on a global level, not just National), who has a understanding and respect for science in the ssame fashion Trump respects nazis and religion.\n\nAnyways, I\'m 26, ex Army, still not registered to vote, and I have yet to see a reason to convince me to vote. Having tto pick your poison is unacceptable in my opinion. Like I always say "if you place meth and heroin on a table and ask me to pick one, ill choose to walk out".', 'Bradmyr': 'I miss you so much!', 'Niko Bellic': 'If you didnt vote NPC will', 'AtypicalWeirdo': 'Seriously I miss him. He had a sense of Humor. And now we just have.. yEAH.', 'Purple Pony': 'VOTE AMERICANS!!!! For god sake for yoyr country sake please vote and do some good for America and world. Many countires are deep into corruption they look at few world nations for best examples and America after selecting Trump ruined it for everyone. All presidents what achieved the peace and harmony among the world, Trump is destroying in every sense. Vote for good governers and improve your life balance with good infrastructure... education, medical facilities or atleast social security... when the time will come throw this trump baffon out of oval he tarnished it enough. He is a disgrace on white house...', 'Abubakr Hassan': "I want a president like you  :'( \nours just care about filling their bellies even if it means killing us or selling the country\nand of course it's obvious that the elections are rigged, because almost 99.999% of the people despise him and still he gets 97% on elections", 'keesalemon': 'He\'s not the president anymore. I know that it massively sucks that he\'s not, but the title of this video is inaccurate to call him president. Maybe put "former president "', 'Patrick Castillo': '0:16 this officially makes him the worst president right?', 'Alfian Sofakhair': 'Pokemon 😆', 'Marta Viðar': 'is it just me or has obama become super sassy', 'Anarcho Toast': 'I refuse to vote because it gives legitimacy to the Capitalist system!', 'Gavan Schultz': 'Thank you Mr Obama from Ireland. It was wonderful seeing a US president like you in office who stopped the recession before it got worse. Also it\'s nice to have a president who\'s biggest scandal was only "I think you were born in Kenya (blatantly disregard birth certificate)"', 'Loroyal': "*Obama oh na...nnaa*\nHey\n*I'm stuck here in Atlanta naa...naa ahhh*\nHey", 'Kaiser68': "I don't know if No.2 is a good reason. Shouldn't the people in office just be the best people for the job? Why do they have to look like me, or have sex with the same gender(s) as I have sex with. Vote in people with principles and beliefs, not based on what danglies they have!!!", 'The Big Bad Ned': 'A righteous personality with no understanding of foreign relations, a true gem you were.', 'Wet sock Productions': 'I miss you so much come back', 'Wookien': 'Dear Americans.\nPlease please please vote. \n\nAll the best,\nThe Rest of the World'}{'Dobby Maltese': 'went from president who tells a joke to president who is the joke', 'miran x': 'Vote.org 💯% gotcha!', 'Fantan': 'Seeing Obama makes me so regretful that I didn’t vote during his presidential elections.', 'Lillywonka': "Oh, how far we've fallen.", 'Nate Ennen': 'Fuck corrupt obummer. Pathetic waste of time. Worst president ever. Makes me want to puke', 'Adeeb Bayat': 'god i love you obama', 'therandomJuners': 'Omg this script is cringy af', 'dany manchster': 'Thanks Obama!', 'Mæko': 'Were gonna change the face of politics alright, Vote Republican.', 'Thomas Doss': 'Odumbo the turd with ears. What a useless human trash. Democrap socialist lib left trash', 'Eric Blackmer': 'Make America Civil Again!', 'Alexis Cummings': '#YouBetoVote', 'Jon Adam': 'Do you ever notice DemocRats NEVER tell you to GET INFORMED and THEN vote? No. It\'s ALWAYS sign up here and vote. I wonder....WHY don\'t DemonRats want you INFORMED first? Maybe its why Democrat McKaskill just got caught in undercover video saying "She lies because if people knew her true intentions, she would never win." Hmmm. 🤔', 'sarcasmo57': 'I would vote for this guy.', 'marlene g': 'Ah the good old days of sanity.', 'Kathy Jennings': 'Love you Obama, best President ever!!!', '007niks b': 'Haha thank god his is out .. Anyways why did he get nobel peace Prize', 'Noah Carroll': 'actaully i would let my grandparents pick my playlsit, so long as i got to pick some of the time too. As far as i can tell, grandparents have been sleceting the playlist for the past 200 years', 'SidTheKid': '0:17 RIP Pokémon', 'Ropsana Khanom': "Why am I watching this? I'm not even American", 'Aida Shahira Suhadi': "I love how the video is titled President Obama instead of former President Obama y'all still can't get over him", 'jose galo magana cuanas': 'How about niantic make pokemon raids at the ballots.', 'Big E': "I sure do miss you, I mean you were so great, I mean, it's so, I mean you tried so hard to....well you know what I mean. I really like Alexandria\xa0Ocasio Cortez now cuz, I mean, she's just so smart and everything. I still think you're smarter but you gotta admit she's just so....well you know....smart.", 'Isaac Rajagopal': '1:24 hahahaha', 'knockoutfever4': '2nd worst President behind Bush Jr', 'miguelr246': "Can't vote democrat if they don't care about Pokemon.", 'chrissy5291': 'So, the title says President Obama instead of former President. I am ok with this.', 'Kevin Duggan': 'Thank you Obama for starting a new Cold War or if you didn’t just being so crappie at the job you were assigned that we are in one. BTW and attacking our bill of rights is not cool if you don’t like it you can leave no one stopping you it’s free country.', 'Muhammad Bashir Musa': 'God I miss this man please come back.', 'Gr8 Incarnate': 'These elections ARE more important than presidential elections.', 'Bryan Batchelor': 'We need this guy back', 'Daniel Bautista': 'All these excuses will go down the drain if you come back 😢', 'Vinci Vince': 'If you really dont care who wins then I think that is a good reason to not vote.', 'GoGreen1977': "In Colorado, everyone registered to vote should receive a ballot by mail, weeks before the election.  You can take your time to study the candidates and ballot initiatives before you fill out the ballot.  Then you can put a couple of stamps on the return envelope and mail it or drop it in a drop off ballot box near you, without stamps.  Or you can go to your assigned polling station on election day prepared to vote if you take the time to study the issues beforehand.  If you are too lazy or indifferent to vote in Colorado, then you should move to state that makes it difficult to vote or really doesn't want you to vote!", 'Rivers727': "I relate to Obama. I too don't care for Pokemon.", 'Noor Ahmed': "Wait did he say 'pokimane'?", 'SHDU Studios': 'I love Obama so much.', 'Japanthewoman': "Politics aren't boring. You know what's boring? Scrolling through pictures of your dinner on Instagram. 🤣", 'Charlene S': 'GOD I MISS HIM', 'Alan Husky': 'Srry not srry to say this but im not voting and i dont think I ever will... I don\'t want to be responsible for voting for the next big idiot to have a small or large amount of power and waste it on shit... I don\'t like the political parties and will never like them because corruption seeps its way thru... Voting is and always has been about "literally"  picking your poison... Idc what u have to say about it...', 'whattheflimflam': 'Cant wait to vote red so I can continue to enjoy the good economy and snowflake meltdowns. MAGA!', 'leland grover': "I hate to break it to you Obama but most young adults & people in general aren't too receptive to being patronized.", 'Finemasilm': 'I wonder if he regrets not being more radical when he had the chance', 'Valarie Williams': 'President Obama is the BEST 🗳 Vote November 6, 2018', 'Ruben Espinoza': 'Let me tell you guys out front, I have my reservations and opinions over former President Obama and what he did during his presidency. However, I feel that he is more gracious and act more charismatic than this current joke of a president.', 'Jack Crowley': 'On the ballot in Michigan this year is prop 2, which would give the drawing of voting districts to an independent committee. Vote yes, friends', 'Tona V.': "I was unfriended by so many people because I implied that they need to vote. For the most part they're not bad guys, but they're actively contributing to the failure of the country, and in turn, the death of the world.", 'Donald-Ud-Deen Trump': '“You know what’s boring?  Scrolling through endless photos of your dinner on Instagram.”  BURN!!!! 🔥🔥🔥🔥🔥', 'EH PA': 'This is what it·er·a·cy sounds like.\n/ˈlidərəsē,ˈlitrəsē/\nnoun\nnoun: literacy\nthe ability to read and write.\nsynonyms: ability to read and write, reading/writing proficiency; learning, book learning, education, scholarship, schooling \n"literacy and numeracy are the first goals of education"\ncompetence or knowledge in a specified area.\n"wine literacy can\'t be taught in three hours"', 'Josh Garcia’s Video Vault': 'When people say “I don’t relate,” I believe that, unfortunately, they are saying, “I don’t think they know my shoes, and act accordingly.” Unfortunately for us and HIS FOLLOWERS, Trumpey did exactly that for them (bullshit though it all is...) \n\nPeople don’t understand all that goes into politics. Perhaps better TV would be NOT, “oh I’m Native American DNA, daddy worked hard, blah, blah, blah...” It might be, “You think you live in the jungle, see those guys over there, they are there to preempt people from shooting at me from a rooftop,” “Every time, I get on stage, I have to be careful about what I say to an absurd degree because I could get sued.” “I work to keep the country running 24/7/365 and only make xxxxxx, and I CANNOT understand why someone believes that they are entitled to 480 times that amount because they simply THOUGHT UP A BUSINESS, but also aren’t the ones making that money everyday, it DRIVES ME NUTS because it makes me think that society doesn’t think what I do MATERS!!!” You’re close Obama, but you still need to take the “Red Pill of Relationality,” go ahead take it, 💊\n\nNO, RAISING THE MINIMUM WAGE IS INDUSTRY IN THE DEMOCRAT’S POCKET AGAIN!! I know America needs to protect it’s economy, but we need to have the balls, moral aptitude, and foresight to see that it is GREED, not low wages that is the root problem.LOW WAGES are a SYMPTOM of the disease. Do you protect against Chicken Pox with calamine lotion?! NO, you vaccinate (these days.) Like I have been scream at Senator Sanders, WE NEED GREED REFORM in this country! Money is a good thing. But what does too much of a good thing create? Evil. So, (too much) money is the root of all evil, absolute power corrupts absolutely, and wage inequality we have. Raising the minimum wage works just long enough for people to forget they were being screwed before the prices of goods and services get raised YET AGAIN for the MILLIONTH TIME. Valuing the economy yes, but what does valuing the economy do? Make each dollar worth less and less, yes, very good! SO, we need to say, “OH GREAT, you founded a business, once you get that 100 MILLION in your personal equity, it is NOW TIME to A) Reinvest in the PEOPLE in your company (not just the company, Apple,) or B) Make a new company, or C) Give up the business life, become a musician, travel, or GO TO CHURCH, because, there’s more to life than a little money yah know?”\n\nYep. Facts.\n\nTell me, would more people invest in the stock market if everyone had $75,000/yr. at their disposal AND the price of good and services REMAINED THE SAME TOO? You betcha!! Shit man, and I’m a psych major.... ya’all don’t know this??!!\n\nAhem, do you jobs please Washington, ahem...\n\nYes, MAIL VOTE! I love my mail vote and I’m not 65 yet. I’m 40, but I love it because I CAN use the internet, it comes to me before the election so I don’t forget there is an election because I too have “other things to do,” for as important as voting is, the short-term liability of paying the rent is MORE important for us in the moment. \n\nOther than that an-as-always-excellent-Obama message that I approve of.... still waiting for my “universal healthcare” I gave you $25 for (-_-#)', 'AsherSax': 'I love President Obama, but this video is sort of ridiculous. ATTN: "We need to find a way to get 44 to say \'Pokemon\', \'Coachella\', \'Instagram\', and \'playlist\'." So subtle, guys.', 'Anthony Swope': 'Mr. President you gotta point about the old white dudes in Congress and the internet, how can people be allowed to rule if they ate do out of touch???', 'jimmy dean': 'For the midterm elections are boring one he should have said "in this election you can vote in enough people to stop trump from being able to do any more retarded shit"', 'Frederick Martinez': 'Vote Republican', 'BitInvest': 'Im voting for Trump. My first time voting.', 'Mohammad Nachawati': "He's glaringly wrong on number 1.  Politicians want you to vote.  They want you to think that your only voice politically is a vote that really doesn't matter.  Your vote is a transmission of acceptance.  You accept whatever they do, whether you voted for the winning candidate or not.  George Carlin said it best.  Don't vote.", 'dj comup': "Vote for me and i'll set yall free sound like slavery when our ancestors had to fight at battle fields for our freedom same ass line....tired ass lies arrogant americans don't even appreciate veterans who had die there ass so civilians can keep there sweet jobs..", 'yashasvi k': 'Vote Blue!', 'Altair Ibrahim': '"White power with a black face.\nHe said fuck it I\'ll do it."', 'spaceinbetween': 'Hoping for a BlueWave this midterm! If the energy-industry-bribed Republicans keep pushing for coal and disregarding global warming, soon we won’t even have a stable Earth to live on', 'Michael Wu': '奥巴马真的帅，而且口语是真的好听。', 'tiny99990': "omfg @ 1:25 when he couldn't hold in his own laughter, that was awesome... he looks a ton happier than when he was president, less reserved too.", 'Muesli Snipes': "7 excuses not to vote:\n\n1: You're a cis white male\n2: Old white male \n3: Straight white male \n4: You're a white supremacists\n5: You support #OrangeMan (voting rights revoked)\n6: You're a young white male (non Hispanic decent)  \n7: You're misogynist white male", 'S Rowe': 'Excellent advice.  Ghandi once said, "Be the change you wish to see in the world."  Obama said, \'Turn out and vote, November 6th, and take some friends with you.  It only takes a few minutes, and it\'s really important to take an active role in the selection of the people who represent you.\'  Thank you, Mr. President.', 'wizzzer1337': 'remember actual human beings? man... 2016 is such a long time ago....', 'Vishal P': 'After a long time... This is how president sound😂😂', 'Daniel Carranza': 'Too ez back to trump twirling around..U.N maybe you get more Stars.', 'Winona Wu': 'GOOGLE IS SUPER EASY TO READ \nOmg please everyone out there in the States vote! Do the world a favor!', 'jag10': 'All NPCs agree, Orange man bad, Zuckerberg good', 'birkaran gill': 'Obama was a good president but bush and trump make him look great', 'Meg': 'America, as an outsider watching your horror show, VOTE!!!  🗳  Don’t assume enough people will vote and end the crazy! Take your right to vote, and make your voices heard! \n\nGood luck 🙏', 'Dani de Janeiro': 'Fuck I fucken love that man', 'English Tea': "We haven't had a real president since 20 Jan 2017.", 'Peter Parker': 'You mean *Barack Obama*. Not President Obama. Obama is not the president anymore. That’s like calling Bill Clinton President Clinton when George W Bush was president', 'MrTomfoxy': 'I LOVE YOU ❤️💕😇  I feel so much safer when you speak!!!', 'Jack Jammen': 'As long as we stop them from purging our vote!!', 'Markus Buhl': 'God i miss Obama. He represents a time when I was still hopeful for the future...', 'Monsieur Octopus': "Thank you mr Obama for reafirming what all conservatives will do while your mob of sjw-npc's will be washing the streets with their liberal's tears on this glorious day. First time in history when America is colored red coast to coast.\n#DRINK LIBERAL TEARS\n#LOCK EM UP", 'swarnak Ray': 'But Jay-Z sucks!', 'MomoHawk golly': 'Trump lies America dies God I miss Obama', 'Alan Q. Wake': "I like what I'm hearing but it's so hard to believe voting makes a difference with our current president😖", 'Emrah Sogol': 'Hello,friend reyes obama just fan show l love you dost the emperor alireaza \n\nKings of the gblings', 'hassan khan': 'Great guy, Great Golfer', 'Ebo Dad': "He's a sweet talking  liar, deceptive snake of a man!!", 'Owen Jack Goodwin': 'When the world was not horrific', 'Typically Thomas': 'When I\'m on a camera crew and the person we\'re interviewing says "It\'s a wrap" I want to punch them. Obama on the other hand... gets to say that as often as he wants!', 'Ned Rostram': "Obama was such an amazing president. It's a shame that there aren't that many politicians as eloquent, intelligent, charismatic, empathetic, humorous, and tenacious as Obama out there.", 'APPLE & HAPPY x-files': 'Aww finally a beautiful voice and a beautiful face .... My President 😍', 'flyte': '0:16 wise words', 'Andrea Myklebust': 'I miss him! ....aaaaand it really looked like he was unbuttoning his shirt at the end of the video. I would have been happy to keep watching. ☺', 'disporting': 'OBAMA! ❤️❤️', 'ehla 01': 'I love Obama💙', 'Kolink Battler': "You don't cate about Pokemon? I believed in you, Obama! XD", 'Rafael Casemiro C Teixeira': "And.... that's not an Apple Watch?!! Where is the hype??! WHERE IS THE HYPE?!!! Ps: miss you, Obama....", 'Joshua Vazquez': 'propaganda', 'Skolastika Winta': "Dude, i'm not even American but i wanna promote to Americans to vote. So GO VOTE PEOPLE!! There are state where you can vote early, by mail,by email, there are also where you have to register a month before or 2 days before. Please learn it for your area. Your vote *will* affect the future of your country. For your own country, the place where you grow up and live, GO VOTE FOR CHRIST SAKE.", 'jimmid32': "But wait .. He's full of excuses though ?? Worst president in 44 terms. Thank God Elections Have Consequences 🇺🇸 Sad the pathetic, leftist, lemming Obamabots comments on here. Still completely taken in by this charlatan, snake oil salesman. Fortunately for the rest of us he wasn't able to do a third term and triple his damage saddling countless more generations with his foolish spending and inability to do anything remotely positive for the people of this country. You can lead a dipshit horse to water, but you'll never be able to make it drink. Listen to Barry Hussein you fools. You have no sense to think on your own. If you have any personal questions for him maybe you can try him at his 8 million dollar mansion in DC. Much like your other heroes the Clintons, that showed up to 1600 Pennsylvania Ave bankrupt, He and Michelle became Mega millionaires off of the taxpayers of this country. Clearly he cares about the average person. Just like he cared about the kids in South Chicago that got shot on a daily basis through his eight years of deplorable presidency,  The town that he called his home. Sad 😥 Just out of curiosity why did he wait till the 11th Hour to campaign for his successor Hilary??? Do foolish lemmings ever ask themselves these questions?? Did he have any excuses then for that? 🤔 Maybe he was hanging out with new buddy Richard Branson 🤔"}{'TrueSake': 'Miss the days when we had a respectful, educated, positive and caring President.', 'Sexy1': 'president obama watching you takes that awful stomach ache away that i get when i watch trump  your medicine to the usa is surely missed', 'Vanessa Sah': '!!!!....Come back...!!!!', 'vptes1': '0:48 It’s not about race or gender, dude. It’s about political beliefs. I’m a libertarian and none of the candidates represent me, as usual.', 'Mitchell Sheppard': 'He just seems like such a great guy', 'MrAramis02': 'The voter suppressing strategies of the republicans got this election in the bag.\n\nYou non white democrats bitches aint got nothing.\n\nProve me wrong, america', 'demetrick edwards': "Excuse 8: ELECTORAL COLLEGE. Bush vs Gore, Gore won the American vote, bush became president. Hillary won the American vote and Trump is president. OUR VOTES DON'T MATTER", 'just a random guy': "fuck Obama if you don't care about Pokemon I don't care about you", 'Ultimate Powerlifting': "Wait until the red wave floods y'all. You liberals are going to drown.", 'NPC753235896447 75': 'Gosh, I wish Obama was still president.  100x times better than Blumpf!', '会員ピカ様クラブ': '政治にポケモンを出さないでくれ', 'Shweta Crawford': 'Decent man..best president ever.', 'Carl Arteaga': 'Barack Obama is among the greatest of American and world leaders.\xa0 In 2020, the United States will need an outstanding Democratic statesman like him elected President.\xa0 As for the present, it\'s hard to believe a putrid piece of trash like Donald J. Trump is the current American President.\xa0 Trump isn\'t a credible public figure.\xa0 Or, reputable.\xa0 Or, ethical.\xa0 Or, a moral man.\xa0 Trump and his followers want everyone to do as they do, and cater to and live for the worst sides of human nature.\xa0 Trump willfully lies through his teeth every day.\xa0 Trump and his followers champion "alternative facts", also known as CRAPOLA, and disgrace the United States around the world every single day.\xa0 Trump and his supporters, including Republicans in Congress, don\'t give a damn about hard-working immigrants or immigration reform, or about victims of sexual harassment or assault, or about the number of victims who\'ve been slaughtered when one of us abused his privilege to own a firearm, or about the consequences of ever-worsening global climate change, or about fellow American men, women, and children with pre-existing conditions who now have potentially life-saving health insurance coverage, thanks to the Affordable Care Act.\xa0 We\'ll see if the majority of Americans throughout the United States can still be rational, still be engaged, still be decent, and will VOTE OUT perennial liar and hatemonger, corrupt pervert and bigot, and utter stupid swine Trump and ALL of his useless, self-serving Congressional Republican enablers when the day arrives!\xa0 The opportunities are coming.\xa0 Starting on November 6, 2018 just around the corner!!', 'Mhambi Musonda': 'I miss having thoughtful intelligent President. #ComebackBarack', 'firstdayofwinter': 'Obama is so cute XDD I love how he is explaining what to do if you don\'t have time to vote XD also I cracked up when he whispered that the ppl questioning Zuckerberg don\'t know how to use the internet XD he tried so hard to talk in "young ppl language" too, like in a somewhat embarrassing but also cute dad way', 'kittydreamz86': "I miss feeling like the world wasn't ending and our country was being led by a competent adult who cares about humans.", 'Timothy Harrison': 'Obama for prez 2020 should be the direction the dems head in, Michele would do a great job', 'Krista Johnson': "Doesn't care about Pokemon? Just lost all credibility with millenials :P Jk ilu bud", 'X Y': '#ThanksObama ;)', 'R Ma': 'Amend the Constitution so this guy can have at least 5 more terms as pres!', 'Max English': 'At 3:25 he says “vote.org” but you can tell he must have said .com and they got a separate recording of him saying “.org”', 'Sunny Singh': 'I have been working on my ballot for a week now. I did not do this much research for my college essays as I am doing for the ballot issues.', 'karenKristal': 'why did they put make up on his eyebrows? The man is perfect, he doesnt need making up, we just need to hang on his every word.', 'Kenneth Simmons': "People voted for you, Barack, thinking you supported traditional marriage, only to find out you'd lied to them. And you wonder why people don't like listening to you politicians...", 'Super Thunder Gamer': 'Obama’s the man! He’s one of my favorite presidents!🇺🇸🇺🇸🇺🇸We need another Obama like people in power who are for and by the people! Not a Autocrat like Trump, but a Democrat like Obama’s! We need people who support the Constitution, our Representative Liberal Democracy, Freedom, Liberty, our Federal Republic, Neo Conservatism, Liberalism our allies, Human Rights, and Civil/Equal Rights!', 'Beyond Cynical': 'Thumbs down, there’s my vote.\n\n\nTotally illogical, even in a close race your vote is still hundreds or thousands away from making a difference. Does he even believe what he is saying?', 'Laurence': '1:18 “You remember those hearings where Congressmen were asking Mark Zuckerberg questions like they’ve never used the Internet? That’s because they haven’t.”\n\n*I LOL’d.*', 'rick lomar': "He could have ended the wars and given everyone healthcare while Democrats controlled all branches of government. Why didn't he? Also, why did he bail out the crooks on Wall Street? Hope and change ... lol", 'BlueMorningStar': "Alright Dad, I'll go out and vote, GEEZE. Can I have my iPad back now?", 'PicklesRTasty': ">lol look at how relaxed and cool I am, I'm just like you fellow kids!\n\nFuck off", 'TheLastInferno': 'Those neck exercises tho', 'roveltin': 'worst president ever...', 'Abundantia': 'Does he have any advice for voter suppression?', 'Jacob Perez': '😥😢😢😔', 'John Semper': 'Yeah because the only thing that matters is the color of your skin and the sex of the person. God I hate democrats your all racist and sexist. Yeah and Obama backed a socialist who doesnt understand how the minimum wage is calculated. Yeah the gender pay gap is a lie I can mathematically disprove the gender pay gap. Oh and none of your suggestions on gun violence would have stopped a single shooting. Your the worse president in the history of the United states.', '1000101': 'ugh, "there are some people who think women shouldn\'t get equal pay for equal work".  I\'m calling bullshit on this.  Name one person in any western nation that thinks this.  One.  I bet nobody can point to one person who ever said, "a woman should make less than a man for doing the exact same work."\n\nThe only "wage gap" that exists is artificial.  Men work more overtime and take less unpaid leave than women.  That\'s the only reason some women make less money than men for the same job.  But there are also a number of women who do put the time in and make the exact same amount as their male counterparts at the end of the year.  Stop using this as an argument.  It\'s a lie and you\'re stupid.', 'sng1867': 'If voting doesn’t matter, then why are Republicans so hellbent on suppressing votes?', 'cabc74': 'Just 150k views so far 😕', 'Kadir Saltan': 'I am Turkish, I live in Turkey and I want Obama to be my president. OBAMA FOR TURKEY #Obama2023', 'DannyB Plays': 'A president with a personality and can make jokes and actually speaks logical words out of his face hole... imagine that!', 'theash3s': 'God Bless trump way better president !', '70s80s': 'You heard Our President....NO EXCUSES!!!! VOTE!!!! 😍🇺🇸', 'PaiN ExoTiC': 'Voting is for the emotional, not logical. Logically, voting makes zero sense.', 'Don Anderson': 'We miss you Barack,hope to see you back in the White House with Michelle!', 'YouTube Moderator': 'I made sure I was first in line to vote for Senator John McCain!', 'musicalbacon2': 'You know, this Barrack guy would make a killer YouTube celebrity', 'Willem DaFuckedUp': 'Huge respect to this man.', 'the4thj': 'He had me at student loans, and the healthcare thing, and that chicken in every pot.... did he say that?', 'Keef Fontaine': 'Please, everyone, vote.', 'FP Piroozian': 'I don’t live in the US & am not an America but I DO MISS this man.', 'Ein Gwi': 'Pathetic I love how they keep bringing him back everything  they hope he would make them win like in 2016', 'Neel L. Lumi': 'Why not add closed captions? Deaf people have to vote, too.', 'seaside view': 'You are literally the worst president in history. Please just go away.', 'Darrell Allen': 'Obama is the textbook definition of a lame duck president. If you don’t believe me look at the difference of popular vote he  go into 2012 verse 2008.', 'The Scapegoat Mechanism': 'You don’t have to vote if you don’t want to. Don’t let ANYONE guilt trip you into converting to their party. You also have a right to complain no matter what you do. It’s called freedom of speech.', 'Karma Sauce': "I love Obama.  And I miss him.  I'm not even American and I miss Barack and Michelle so, so much.\n\nBut Americans don't vote because of the electoral college, gerrymandering, voter suppression and lobby groups (to name a few daunting and hopeless realities).  I vote in my both my provincial and federal elections, but if I lived in the United States, I probably wouldn't bother voting either.  I'd sooner march than vote.\n\nAs long as your politicians continue to be bought by corporations and special interest groups, voter confidence will continue to dwindle and you will be left with a majority of uneducated and blind faith voters.  Educated and engaged people know how the system works and I can't blame them for saving the time and effort...that's what a smart person would do.\n\nLet me be clear, Americans are not apathetic.  They are disillusioned.  And for good reason.\n\nBut I'm still rooting for my neighbours to the south.  And I know Canada's government has its quirks...we still have a Queen as our head of state.  But holy sweet baby Jesus, you guys gotta get your political shit together.", 'Beta': 'If we want our votes to count in Presidential elections, we need to make the Electoral College go away.', 'uriarteh': 'I miss Obama 😭\nBut yes sir count me going to vote all blue. ✅', 'Lex Blazer': 'God, I miss him...he was up against a huge congressional wall, so he never became some big-accomplishing president...but at least he could talk.', 'muller3641': 'Great segment. Love you Barack. 🤘', 'Laurencio R': 'Now he was a real President!!! Not the embarrassing imposter we have now... smh', 'Jima Alex': 'How did we go from this humble, eloquent, intelligent and thoughtful President to the orange Marmalote imbecile  we have in the office now!!!', 'bud thedog': 'Thanks for reminding me to vote republican', 'Marie Morris': 'Missing a Real President \n😭', 'davindranauth': 'Barack Obama is the GREATEST President of the United States.', 'xthatwhiteguyx': 'Thanks for reminding me to vote republican, for the first time of my life, Obama. You da man!', 'Kowasi': 'Will there be a Trump version? A George W. version? A Bill Clinton  version? Bring those vids on because this one was hilarious!', 'Leigh P.': 'The guy is funny!', 'Fick Dich!!! Arschloch!!!': 'Sozialistischer Stichel!!!', 'Amod Sandeepa': 'I miss him. And so does the whole world.', 'email16v': 'My President!', 'Lucky24': 'So old, sad, weak, and pathetic. So glad this manipulative liar with delusions of granduer and a misplaced savior complex is no longer president. #RedTide', 'bixchick007': 'Smart man, sorely missed.', 'Doug Clement': "I'm too apathetic to bother voting.", 'Julian Birch': "Thanks, especially about the Googling the candidates thing.  It may be harder to find stuff on the most local races that lack in news coverage, but for US Congress, Senate, and the major statewide elections you're bound to come up with something on at least the top candidates from a major party.  If there's a really interesting Independent or Third Party candidate running, then there may even be one or two web pages or news articles out there dedicated to them.", 'Kindle Fire': 'RED Wave', 'John Miranda': 'The Republicans own the voting machine tabulating servers. When you own the electronic voting machines you own the vote', 'Allen Waker': 'I remember when we had a president who ramped up the wars in the Middle East expanded NSA spying overthrew democratically elected leaders', 'madhavyu': "That's my President not the current impostor in the White House.", 'SCE 2045': "Man I miss that guy, sure, I didn't like a couple of things about his term, but goddammit we weren't the laughing stock of the World", 'kedar nadkarny': "I think attn did a good job editing Obama's long pauses. Hehe. (Obama is the best)", 'Folarin Osibodu': 'pls . come back. class beyond class.', 'Alex Noble 2002': 'Listening to Barack Obama speak is a breath of fresh air....I miss this man', 'Robert Lynch': 'Shut the fuck up you dog eating marxist sub human piece of fecal debris.', 'NumChuck Lee': 'maybe he should have done what he said he would do - remember the public option - remember his statements about "mandatory health insurance doesn\'t make sense" ? thats my excuse for not voting.', 'James MG': "Can anyone else besides the brain-dead Trumpers imagine the orange con-man doing a similar public service announcement encouraging people, especially young people, to vote? Obama used plain simple language and facts, easy to understand answers and sprinkled in some humor. Trump couldn't get through three of the reasons to vote that Barack Obama did because there were no references, accolades, praises, admiration's or kudos to Trump in that four and a half minute message and Trump couldn’t go that long without having his snowflake ego massaged. Barack Obama, you sir, are sorely missed by the sanest among us. Sometimes we don’t know what we had till it’s gone.", 'Andrew Garcia': 'Obama is a prime example of what we call a PENDEJO!', 'karen taylor': "I'm voting blue! We love you Barak Obama! We will vote blue and make a change for the country we Love! American deseves better then Trump! Vote blue no excuses, we will take back our country!", 'Michele Mill': 'Please come back. ❤️', 'Jess Stuart': "How about...\n1.  My district boundaries have been redrawn, so my candidate does not stand a chance.\n2. They closed my polling location and now I have to drive 10 extra miles to vote.\n3. My name was removed from the voting rolls because it had a hyphen in it.\n4. The electronic voting machine I will use has been hacked by the Russians.\n\n Getting Angry Yet?  Well, do something about it, and don't wait until election day to vote this November.  If Republicans get their way, this could be America's last free and fair election. Don't sit on the sidelines and watch our democracy get flushed down the toilet.", 'DDIFCC': 'Things used to be so much more enjoyable, before the fake Cheeto came to town🤔😏😒\nWishing us all a better reality, and I mean everyone 🙏', 'BETTERWORLD SGT0589': 'This is A Real  President!', 'Olivia P': "#2 It isn't about labels/characteristics.  It is about policies.  No one I could vote for this november shares any of my core beliefs.", 'fernando escalante': 'We got this!!! Come on people in Georgia watching this, Texas, vote BLUE!', 'stretch54': "I voted today. I didn't vote for one fukin' republican. As long as congress is going to vote straight party,  I may as well do it too.", 'Last Lime': 'Vote the same.... Vote democrat.... Vote democrat nazi party.... Paid for by racists.', 'positronlaserforce': 'Prez obama. Did you rag on pokemon? I will vote to make pokemon a national treasure', 'A. G.': "So I'm not understanding why this video has any thumbs down... it's all pretty sound advice...", 'Kurleigh Martin': 'I miss this man so much! A decent, competent, and compassionate man!', 'Gavin': "It's Barry the Pedo\nBarry like Hot dogs."}{'enigma mist': '*former*', 'Inge Justa van der Helm': 'You want people to vote? Give them a platform. The DNC has no platform at all!', 'lagrange777able': 'Almost fucking cried seeing Obama again. Cant believe its only been like, what, 1,5 years or so? Feels like an eternity without him.', 'Marc Scarpelli': "Funny to read the snowflake rank & file Rep's, hair-on-fire, frothing at the mouth against a true patriot -- simply because he doesn't have an (R) after his name.  They fail to understand the meaning of true Leadership.  I did not agree with every one of his policies, but he was a Statesman...and he never promoted violence against your fellow American.", 'CARTOONIVERSE1': 'I think the *Academy* in Hollyweird should give this guy an *Oscar* for *Best Performance* in a global scam.', 'PikaXRich': "I don't care if Obama doesn't care about Pokémon. I'll still vote for Democrats cuz I had enough of Donald Dump. he needs to be flushed.", 'Fahad Khalid': 'Coolest guy on earth. Period.', 'Commander Shepard': 'Damn Trump makes this guy look like a homeless drunk.And I like the fact how he insists on the importance of Voting Democrat than voting as a whole.', 'Eriq Brown': "just want to vouch for what this guy with the ipad said -- google *IS* easy to use! i didn't vote in the last elections.... and i didn't know much about my local candidates in this cycle, so i looked up background info on every single person running for office in my state, across all parties. i discovered a couple candidates i really liked, who i hadn't known about before. AND i realized one of the people i probably would have voted for bc of party affiliation is actually a major tool who seems to only act in their own interest. all this from a bit of googlewhacking -- and it took me about 20 minutes total, maybe 25. so don't take this ipad guy's word for it, listen to me, because i'm really smart... in fact, i might become this nation's first black president one day. so just get informed, and GO VOTE!", 'Octavian': '"President Obama Doesn\'t Have Time For These 7 Excuses Not To Vote" - he didn\'t have time to improve our country either.', 'Copyrightbreaker22': 'First they wanted us to Pokémon go to the poll. Now they don’t care about Pokémon at all. Make up your damn mind xd. In all seriousness it’s a good video.', 'Kaibo101': "Whoa. There is nothing wrong with scrolling through my finished dinners. In a generation that constantly eats out, I made something. I took the time to grow my own food and then prepared something that is good for my body. I walk away with the feeling of some form of accomplishment and connection to the generations before me. Your wife tackled obesity issues in children....shouldn't you support people making their own food????", 'Fredroks': 'Bath House Barry was the best foreign born homosexual jihadist to ever serve as President!', 'Condor Boss': "#2 I don't want to be 'lead'.\n#3 Nice slice of ageism there, Mr. O. \n#5 There are candidates who think socialism works. And that Castro, Che and Chavez were good guys.", 'MsNadua': 'We miss you!', 'Big Mike': 'Why doesnt this fucking piece of shit go get hit by a car. People dont have to vote. You and your asshole Democrats had most people in the cemeteries voting. So take yourself and your ape and finally get lost', 'ThatsPlanePokey': 'Obama is my favorite it was a tragedy when he had to leave.', 'm. mck': 'someone who cares & educates,  hope this message changes our leaders that are in now & we  put in honest caring leaders. # helpAmericahavebetterleaders.', 'Thomas Rittenhouse': '@Barack Obomber , Give back your Nobel Peace Prize , Give The American People Back Their 5.2 million families like mine back their homes & not your campaign donors on #WallStreet , Walk with the striking teachers , nurses , hotel workers that you promised to help . \nYou laid the groundwork for your 3rd term with $Hillary & the #DeadDNC and how did that work out for you Obomber ? \nYou did this to the country and now you want the american people to clean up your mess just like when you helped screw #BernieSanders ,,,, F*ck You Barck Obama and your #FakeAssProgressive Corportist War Pig Ways ,,,,, You Fuckin Neo-Liberal piece of shit . I was stupid enough to vote for you in 2008 what makes you think anything you say now matters to Poor People Like Me Who You Helped Rob By Bailing Out The Bankster You Fuckin Liar ! \nOh by the way you backstabber me & my mentally challenge 25 y/o son will be homeless for the 8 time since 2008 because of you and your leadership ,,,,, thanks ass hole !', 'c431inf 11b': 'He is still doing nothing 😂', 'Wectum Wecker': 'God I miss this man.', 'Ryan Smith': 'Obama give it up,you and your base is losing.', 'Becker289': 'Trump 2020! 🇺🇸', 'Julia Nadeau': 'Excuse #8: I\'m sick and fucking tired of politicians rigging elections in their favor with gerrymandering, voter suppression, etc... and when they get into office, they end up supporting the corporate agenda over what\'s best for workers, REGARDLESS OF WHETHER THEY\'RE DEMOCRAT OR REPUBLICAN. Case in point: the Democratic Primaries of 2016. What, are you surprised that some of us are still pissed off about this? Damn right we are! I was a Democrat since the first day I could vote. And yet, despite having grown up as a Child of Reaganomics, despite their numerous attempts to vote away my access to the Means of Survival, despite their numerous attempts to legislate me out of existence (as a transwomen), it wasn\'t Republicans who radicalized me into being a Socialist. Why not? Cause I expect that sort of evil and corruption from them. But the Democrats, I thought for years that they were better than that. In 2016, I watched the DNC and the DCCC try to ram Hillary Clinton down our throats... a candidate who loses popularity everytime she opened her mouth, a candidate who was so corporate that I could scarcely tell the difference between her policies and the bullshit politics of Reagan I grew up with! In one key state after another, I saw the DNC meddling and engaging in all sorts of political fuckery, like voter suppression and poll closings. I saw their hand in sudden rule changes and collusion with MSM to shut out Bernie and prop up Trump as a "pied piper candidate". I still remember having to watch Trump\'s empty podium on MSNBC while Bernie was holding a record-breaking rally in Phoenix, AZ. And you, Barry, YOU were complicit in all this, in both your support of Debbie Wassermann-Schultz and her tactics, and your continuous support of a candidate that did NOT have the mandate of Democratic Voters. That said, I still voted in the general election DESPITE all this. True, I didn\'t vote for the candidates of either party, but went third party (because at least the Greens weren\'t wholly owned by the corporations). But I can understand why so many pissed-off Democrats chose not to vote. I voted out of sheer outrage, in a pyrrhic attempt to show the candidates in question the level of contempt with which I viewed them. You, Barry, sat by and let the unravelling of our democracy take place. You have no grounds to lecture us all on the importance of voting. I left the Democratic Party because of the blatant corruption of the DNC. I am a Socialist because I watched democracy get used and abused by those who swore to uphold it.', 'Tobi Makkura': 'How many of his speech pauses did the editor have to deal with 😂?', 'Hamfists Man': 'I miss this guy.', 'timber_beast': 'So sad how far America has fallen so quickly since Obama.', 'Harlequin Cyning': "I don't appreciate voting for the lesser of two evils with a gun to my head. \n\nInstall a voting minimum, say 33% of eligible voters. If the threshold is not met as happened in Venezuela, a snap election is held cross country. Every elected or appointed official tossed and their position up for new blood. \n\nIn theory, gives disenfranchised voters a voice and acts as a backstop to corrupt authoritarian regimes, like the US.", 'CandyGirlタ♡高橋': 'OBAMA!!! 🙌🏻🇺🇸💙🇺🇸💙🇺🇸💙🙌🏻', 'Ben Gilbert': "I'm voting Republican", 'MickyAvStickyHands': 'Never trust a young conservative or an old liberal. One of them is soulless and the other is a grade A moron.', 'elijah mikle': 'Insane!  An ex president with so much faith in the people that he believes if we get out vote things will be better.  All I heard was reasons to vote.  No partisan BS.  Well played Obama, you served us well for 8 years, but your time is done.', 'Ash Doodge': "No I'm all in Trump 20/20 and whoever he says vote for.", 'Ron Roberts': 'This man a charlatan , a Fraud did nothing when he was in office but bombed \xa07 different Countries\xa0 & violated Habeas Corpus\xa0 -Trump is Americans first', 'Working Class Gotham': 'The most disingenuous neo-liberal Democrat - ever to sit in the White House and screw the working class for eight years. Go sky dive with Richard Branson and have a cerebral circle jerk with Hillary Goldman Clinton, sell out. You made this mess, Wall Street boy. This ad is so offensive: conflating the civic duty of voting with voting for Democrats. Our white girl degreed class is so transparent.', 'Graf Guy': "Obama and Rahm destroyed the Democratic Party. I'm voting 💯RED because the Dems have IGNORED the black community.", 'Michael Burgess': "This is the same 'hopey, changy' guy who railed against corporate America until he actually got the top job. After which, he  immediately appointed the likes of Summers and Geitner to solve the financial crisis. The same guys whose policies caused the crash in the first place. After that he printed money and saved Wall Str. not Main Str. He then refused to prosecuted the warmongers and torturers of the neo-con cabal that led us the Iraq. But he did find the time and energy to prosecute whistle blowers. Black Lives Emerged during his time and to top it all, he backed HRC in 2016 and his legacy of corporate pandering brought us Trump. But of course he can always blame Republicans for being obstructive (a convenient EXCUSE). So FU Obama and your patronising crap. Its no wonder people gave up on the political system after 8 years of your witty, smooth talking liberal hypocrisy. At least with Trump you know you're deep shit.", 'JCTJR98': "Keep talking Mr Obama and reminding us why the American people repudiated your policies in 2016. Its feels so great to finally see our country  not be taken advantage of by the rest of the world and have a growing prosperous middle class; especially blue collar manufacturing working American's. \nOh remember the threat from ISIS, missels being launching from North Korea, Iran's ability to fund terrorists and taking hostages our sailors, China's out right economic warfare and your Russians friends taking over other countries territory? Well that has ALL stopped because we now have a United States President who keeps our country safe and cares for working American's!! \nSo please keep making public aperances and also tell your friend Hillary Clinton to do the same; especially when she defends her husband's sexual offenses. Thank you.", 'emacicc': 'I love him,but damn,8 years in the white house really did a number on him,e was so young and fresh', 'Anonymous Doe': "Lol its so weird how he looks from camera to camera. Like it wasn't edited smoothly at all", 'Jimmi Stone': 'Daddyyyy', 'teamleader2010': "He doesn't have time for the truth either.", 'pforce9': 'Not a fan of Barack Obama. He spent eight years kissing republican asses, gave us Romneycare, a republican health care plan,  was too weak to exercise his supreme court nomination, made the Bush tax cuts permanent,  fired Shirley Schorrod because Bret Breitbart disapproved,  left Susan Rice to swing in the breeze, abandoned the Standing Rock Sioux to the mercy of private police brutality, swept the Flint Michigan water crisis under the rug let the wall street swindlers off the hook and is responsible for that little punk, rat bastard Tom Perez being head of the DNC. Any questions?', 'Walt Schmidt': "He's a funny Kenyan clown. BACK to the circus with ya....", 'Rin Y': 'This should be trending instead of some dumb 💩 like fake mustache?  makeup? whatever. Spread the words, you guys!!!! \n\n#VoteBlue', 'Ash Pro': "Can't say how much i miss him and took him for granted when he was president.", 'Blackvoid2me': 'You never know how much you miss someone until they leave. I miss obama', 'leebog31': 'The king NPC is back.', 'Chuey Lopez': 'I miss him so fukn much. I don’t believe in some of the policy’s he approved but he was the best president ever. Now on another note. I won’t vote because the USA is a piece of shit now with both political parties at each other’s throat. There are more than 52 political parties and my vote won’t count cuz I’m voting independent and majority of the ppl in America are going to vote republican or Democrat so there you have it. Miss you Obama.', 'Sean Lykes': "Shut up Obama. Your game is old and ain't nobody buying anymore. \n Dont worry I'm going to vote . But I assure you it wont be Democrat that i vote. It will be Republican and trump for the rest of my life. \n  You don't care about working people Obama.  Shut up!!! And I'm black so dont try it. Still like Michelle though. Dont know why she is with your uncle Tom ass.", 'Bloo95': 'God, I miss him.', 'Some dude': 'look at all the useless eater NPCs boot licking this trotsky communist', 'Luis Grullon': "That's right boys and girls, voting is the only thing that's gonna get us out of this twilight zone year", 'Justin S': "Okay, but why didn't you crack down on white collar crime or prosecute any of the architects of the Iraw war?", 'Anubha Das': 'Google is super easy to read 😂😂', 'Steve': "Obozo - you're fired. This fake black guy has done more damage to the U.S. than all presidents combined.", 'Foothills Trading Post': "obozo didn't have time for a lot of things like stimulating the economy, creating job's, destroying ISIS, fighting illegal immigration, supporting our Police and Military, addressing the 7K black on black murders in his home city of chicago,  negotiating better trade deals.....  other than FUCK UP, exactly what did the son of a bitch do ???    He, along with the rest of the dipshitocrats did 1 thing right...... they elected TRUMP !!!", 'Roland Deschain': "Isn't this Election Interference??? Obama just loves meddling. Ask him about how the CIA fucked with the 2012 French election.", 'blablabla80872': '0:46 a serious question and i think it shows how Obama answers it. He doesn’t talk about relating to idea’s he talks about relating to your race or gender. IM A WOMAN SO I MUST VOTE FOR WOMEN. IM BLACK SO I MUST VOTE FOR BLACK PEOPLE. \nThat logic is whats wrong with the Democrats. Kanye doesnt agree with your views? Then he loses his blackness.\nIts that racism that still exists in the democratic party and the leaders still show it.', 'Elise C': 'Great video!!!!', 'James Martin': '... Vote & Vote Early !!!', 'Harry Morgan': "Who in hell cares what\xa0this loud-mouthed leftist lapdog obama \xa0has time for?\xa0 And by the way, he's not president anymore. I know he's slow to learn that lesson. Perhaps someone\xa0should beat it into him.\xa0 Any former president with any class would step aside, maintain a noble silence, and allow the incoming president to do his job. But not this narcissistic, self-righteous, sanctimonious rabble rouser. He's been trying to undermine an elected president ever since inauguration day. And we're getting a bit weary of listening to his stupid diatribes. One of these days, someone will shut him up, permanently.", 'Oresti Ismaili': 'He just says pokemon?', 'blue4me43': 'Thanks, Our Very Favorite President Barack Obama. We all miss you so Please Come back and make DC our Home. We will Vote Blue this Nov, 2020 and 2022.', 'TheSnowFoxParty': 'I registered to vote a few weeks ago lol', 'Dreamer But Not The Only One': 'Obviously he does have time 😅', 'Barack Obama': 'Hello my fellow Americans! IM BACK!!! Go out and Vote!', 'Aaron R.': 'Okay slave', 'Tyler': 'This is all his fault', 'maglen69': "There are times in that video he looks like he really doesn't want to be there.", 'Adam Alkhafaji': 'They call it trump derangement syndrome I call it post Obama depression 😢 miss having an intellectual with values as president', 'tyro244': ":: the old man asks ::\nWhat's Koochella?", 'Matthew Hudson': 'Excuse 8 I am Puerto Rican and a literal second class citizen with no vote or real representatives.  Statehood. Demand it from Congress', 'David Dutton': "Trump is terrified about the midterms because he's only thinking one thing: If the Democrats take control, the first thing they're going to do is try and impeach him. Good. I hope he's right, and I hope they eviscerate him.", 'Geek The Girl': 'I know you had your faults, but I really fucking miss you! It was nice to have someone with a brain in the Oval Office.', 'Jo G': '<3', 'Jared Reid': "Corporatists have no right to call out voters who are undecided, why don't you go crawl under a rock obummer", 'BLT4LIFE': '"You wouldn\'t let your grandparents pick your playlist." I actually would.', 'Lost Frame': '2:32 Take notes kids 😂', 'Dattucha': 'You get a president in your studio and THIS is the crap script you give him?  Devoid of any decent jokes and a video title that begs not be clicked on?  Way to go ATTN', 'John Doe': "Even  Barry is against the Democrat.but I'm still glad he is not President....😁", 'Philipp Süßmann': 'I miss him so much.', 'African Rule': 'Thank you so much "PRESIDENT" Obama. I am honored to say you were my first vote ever in my young life. And we miss you SIR. Very much.', 'Randy Johnson': 'Its so sad and pathetic how the worst president in US history, having been humiliated and stripped of any and all relevance, is trying sooooo hard to be noticed again.  I am embarrassed for him.', 'Kevin Slater': 'Don’t vote. Please don’t vote. We need more oligarchs and out of touch old white men in charge.', 'catcherboy96': 'This entire video enrages me because obama is one of the biggest reason my generation is disenfranchised to vote', 'Carmel Sileo': "He was not my favorite prez, but I have to say, this was excellent!!! I'm away from my home state and voting absentee ballot, never missed one yet...so vote and VOTE BLUE", 'Robert Webb': "I never voted and I'm still not gonna even though penndot registered me as a democrat when I specifically told them not to register me at all it seems like the government dose what it wants anyway so why do they need me when Philadelphia will just say I voted because it's all a hustle it's all fixed and I don't care because they won't dare look out for a poor white boy from Kensington so fuck it I'm gonna get drunk and watch you all get played enjoy your jury duty", 'Gwendolyn Williams': 'My President Barack Obama: A highly intelligent, Capable, Articulate, Polite Caring Man. Experience Former Public Servant, Fought for Social Justice.  Vote Blue.', 'Captain Obvious': 'Took 4 of my Republican friends to register to vote, they all are voting for Beto. Dag nabbit', 'Anthony Mcqueen': 'God i miss Obama a man with class, intelligence, integrity and respects the sanctity of marriage. \n\nHe wasnt perfect, but he was and is miles ahead of what we have now in the white house. \n\nThere was a time i was proud of my president and country. Not anymore that died in Jan 2017.\n\nObama was a true leader enough said.\n\nI can careless what you haters think or say about me or this man come at me ot says more about yourself.', 'David Hendrickson': "Now we need ones of the other four! I don't think our current commander in chief is really in the jokes business though. Just roasts and trolling.\n\nAlso, I'd really like to see the classiest, coolest version of Trump that he could possibly muster up. That would be interesting."}{'Pedro Kantor': 'All this Obama dick-riding in the comments shows that some people really learned nothing from his presidency.', 'peter chow': 'So I heard that you had two rallies and only a handful people showed up. I wonder why.', 'Anthony': 'I vote in my underwear, with google open and I google everything. I read the ballot blue book each year, this year I am reading it to some friends and going to help explain what stuff is.', 'Philippe Arquie': 'How do we get people to "Pokemon Go to the polls".  How do you do fellow kids?', 'NCState863': 'Obama lost the House Senate White house and supreme court from 2009-2016', 'Karen M.': 'Gosh I love that guy.  Listen here and do what he says!', 'flea10x6': 'If you do not vote, you have no right to complain. Not voting is ceding all decisions to those who do vote.', 'James Berryhill': 'I miss you Mr. President.', 'Ken Of Darkness': "Here is my first criteria for a vote for a candidate.\nCan't be corrupt.", 'So WhoIsMilton': "The One person in this world that I don't like more than Bernie Sanders and Hillary Clinton is Obama and his Lame SNL one liners that don't hit . . .", 'Proud American': "Mr. President, allow me to answer #3. America, if your vote doesn't matter, why do they work so hard to suppress it?", 'Mary Lincoln': 'Obama and the American Media IS WORKING WITH THE DEEP STATE...TO TAKE THIS COUNTY DOWN...', 'doedecaheedron': "Trump can't afford the class Obama has.", 'Phil Rabe': "So refreshing to hear complete sentences from a president again! About 20 years ago I switched to vote by mail and couldn't think of going back to the old way with hackable voting terminals. [I don't mail my ballot, there is a drop box at City Hall]", 'TrueHero123': "The last presidential election turned on fewer than 100,000 votes because our 'democratic' system is a vestige of slavery (electoral college). There are fairer elections in war torn Afghanistan than the US.\n\nThat being said, you should always vote, in every election. I became a US citizen in 2008 just so I could vote that year for president. My proudest moment as an American was when I voted for Ralph Nader in the 2008 presidential election.", 'Carlos Catalan': 'Best president ever !!!', 'Donald Smith': 'Love this man; even more so now', 'Fredrick Cranrenbury': "What's this guy's name again?\n\nSo forgettable......All those great achievements....\n\nLike a child who's balloon has floated away....\n\nMAGA Bitches...", 'Shitstirrer': 'Love the video but that turning to the camera was awkward.', 'kevinalvarado': 'How about the 8th excuse:\nDemocrats are corporate puppets just like Republicans and neither party is advancing policies like universal healthcare, cutting military spending, Universal Basic Income, etc.', 'Anthony Gatchalian': 'hey ex prez... shut up about photos of the amazing food I prepare. Sounds like you have a shitty interest in the beauty of food\nFYI  I vote and I voted for you. The food thing is off limits...dummy', 'Jeff Stewart': 'I like his response to #2. So your idea of choosing a candidate is based on identity politics.', 'LadyMaltese': 'I miss Obama at the helm. I actually enjoy voting in person because it gives me a chance to meet with my voting neighbors. It doesn\'t take that long, about 15 minutes, and l get the "I voted" sticker and bragging rights. Honestly, if you have a hard time spending a little time exercising your voting privileges after people have actually died for them maybe you should take a serious look at your priorities.', 'Chuck Ragland': 'Listen to this people! Vote vote vote democrat.', 'Ben the Slug': 'Come baaaaaaack pleeeeeaaaase', 'Kevin Jacobs': 'This is all he’s going to do to get people to vote. He knows he’s the kiss of death to democrats , he lost a total of over 1 k for democrats country wide when he was whiner in chief. You’ll also notice that the Clintons are not campaigning for democrats either , odd since democrats claim to love them 😝. Trump 2020 !', 'Lisa Wood': 'So true about not letting my Gma or Mom pick my playlist, using google and do u know your address. This cracked me up!!!!', 'D Storm': 'He wants illegal immigrants to vote too.', 'JohnnyBoy3000': 'I would vote if I was American.', 'cal blank': 'when Obama mark Zackerburg  comment is so funny', 'Tertiary Adjunct': "Bush captured and tortured. Obama just killed.  Wake up folks... you've been bamboozled thinking there's a diff between the parties.", 'Felix Vasin': 'sounds like Obama... did they put a stunt double in or is Obama gettin old? \n\nnot looking forward to the three year span when all my hair turns white.', 'Ripley King': 'This is just too good. A president who can speak. What we need more of these days. Share. Vote.', 'Marinara Gaming': "voting blue \nthis one's for you", 'TheWedabest': 'You had your 8 years Obama.  Yeah I believed in that whole "change".  You just fucked up things even more.  I DON\'T VOTE.  Why should I vote when your rich celebrity buddies have your ear, like trump\'s family has his ear.  All you politicians are the same.  Just makes me sick.', 'vulpix': 'I’m offended and I find this a Pokémon 😡', 'dukky fuzz': 'Much luv and respect prez Obama', 'No Shit': 'Boy I miss that man so much! Go VOTE on November 6th to get to have a cool cat like him (well almost) in 2020!', 'Bung Kusi': 'Vote!!', 'Marty Schrader': "As always, The King of Klass Kills It. Why couldn't we have him for another few terms? Oh, yeah -- 22nd.", 'B H': 'Please just shut the fuck up obama', 'Al Gore Bot': 'Take off, sissy.', 'Joao Santos': 'Fantastic person! Easy to understand and relate to Obama.', 'Broken Deity': 'Obama is a living refutation as to why voting matters.', 'Esmeralda Shepherd': "I like Obama so much that I'm not even that he doesn't care about Pokémon", 'Alan Parker': 'Obama Says "WE NEED MORE NEOLIBERALS JUST LIKE ME"', 'Jacob Serrano': 'A citizen who doesn’t vote isn’t a citizen.', 'Debra Legorreta': 'STOP Obama!  Obama is the problem, not the solution.   \nNo more word games and moving speeches. We do NOT need “Hope and Change.” Broken promises with nothing tangible behind them, but fancy words with no meaning. \n \nWe need results.  No deals with the other side.  No give and take that sets the stage for future rip offs as Obama did.  We need Real Progress.  \n \nHere\'s just SOME of the criminal filth Obama and the so-called “New Democrats” (aka corporate dems) accomplished and how that opened the door for Trump and his criminal regime to grow and fester: \nThe abolition of welfare: no social security, no medicare/medicaid, no food stamps, etc.,\nThe deregulation of the financial system, \nThe illegal attacks on Syria, \nThe illegal attacks on Yemen,\nThe bailout of Wall Street, ($700 Billion TARP),\nThe $4.7 Trillion “Quantitative Easing” handout to the financial sector,\nThe crackdown on whistleblowers (e.g. Snowdon, others),\nThe crackdown on the Water Protectors at Standing Rock, belies Obama’s “Clean Power Plan” was mere lip service,\nThe crackdown on Occupy,\nThe attack on freedom of the press, saying “reporter\'s privilege” does not exist (Jim Risen case) \nThe refusal to pardon whistleblowers (e.g. Snowdon, Van Buren, more),\nThe slashing of wages for autoworkers, \nThe appointment of Tom Wheeler, an industry insider, to head the FCC (thence Ajit Pai), \nThe Flint Michigan lead in the water cover up, outright betraying the citizens of Flint,\nDrone-missile warfare with no congressional oversight, \nThe destruction of Libya, \nThe build-up of NSA mass surveillance,\nThe expansion of US military bases to 80+ countries, \nThe weakening on the 1878 Posse Comitatus Act to allow the use military force domestically\nThe military coup in Honduras ousting “Mel” Zelaya, \nThe murder of Berta Cáceres,\nMass deportations, more than in any other period in US history, \nMass incarcerations, \nCIA Operation Timber Sycamore in Syria,\nThe parliamentary coup in Brazil, ousting Dilma Rousseff, \nBlocking Argentina’s loan at the Inter-American Development Bank and the WB, leading to regime change\nThe expansion of the Endless War in Afghanistan, \nThe murder of an old, sick captive purely for political purposes,\nManipulating the OAS to overturn the Haiti elections, threatening to deny post-earthquake aide, leading to regime change and mass disenfranchisement,\nThe expansion of the strategic nuclear weapons program, \nThe kill list\nThe expansion of covert military operations to over 70 countries,\nThe expansion of the AUMF\nThe revolving door: The appointment of former Eli Lilly executive, Alex Azar, to head of HHS\nThe revolving door: The lucrative position at Lockheed Martin for former DHS head Jeh Johnson\nThe revolving door: Geitner to head Mariner Finance, a firm that preys on the poor.\nThe revolving door: Mary Shapiro from the SEC to board of directors of Morgan Stanley\nThe end of habeas corpus, detentions without trial and arrests without cause \nThe failure to stop Russia for meddling in the 2016 Presidential elections\nThe failure to punish Russia for meddling in the 2016 Presidential elections, (what got Trump in trouble in Helsinki . . . they looked the other way when Obama did the same thing)\nThe missing $10 Trillion; concerted Bush-Obama-Trump tax cuts resulted in the loss of $10T from the public funds of which $2T went directly to the 1%\nThe passing of PROMESA Act to protect Wall Street’s interests in Puerto Rico at the expense of local sovereignty: an outside board rules over the island, effectively PR is now a colony,  \nThe appointment of Arne Starkey Duncan as Sec. of Education: Common Core Exam, public schools replace with charter schools  -- so-called ‘militarization of education” that enabled De Vos,\nNOT standing up to climate-change deniers; NOT standing up to science deniers; NOT definitively supporting the Water Protectors and shutting down DAPL -- thus opening the door to Trump’s staunch denialism and the US pulling out of the Paris Agreement, \nAllowing Ag industry lobbyist, CropLife, to kickoff the EPA panel Dr. Peter Infante; the panel was about to investigate Monsanto’s glyphosate-based flagship product, RoundUp,\nThe unwillingness to investigate or prosecute Bush Administration officials for warrantless wiretapping and torture, https://www.youtube.com/watch?v=jqU9UhjPOtk “we need to look forward,”\nThe continuation of warrantless wiretapping and torture,\n\n\n. . . every week we discover yet more Obama-era/ Obama-enabled shenanigans!  Obama basically made possible the Trump wrecking ball.  Talk about collusion.  Talk about treason.  That’s the real collusion.  That\'s the real treason.  Our struggle is less and less with Russia and more and more with Goldman Sachs.\n\n\nEver wonder why Obama has such a contagious smile?  Turns out he’s laughing all the way to the bank.  \n\nSo what’s next for Goldman Sachs, Obama’s paymasters?  \nIMHO, The old “hope and change” deception wagon; specifically, the hijacking of Universal Basic Income movement, the UBI movement.\n\nWall Street’s Goals? \nRestore Obama’s standing among democrats, \nShut out progressives,\nKeep UBI from actually happening, or take the credit if it does, so progressives don’t.\n\n\n***\nHave you no shame? I have no idea who you are and why you are endorsing a war criminal.  How did you get my email?  I want nothing to do with you and deeply resent the day your group decided to endorse Obama. This is attack on progressives and on American values.\n\nThe Trump Putin summit in Helsinki which so many found so shameful would not have been possible if it were not true that there is a moral equivalence between the Russian authoritarian regime  and our government which gives lip service to our "democracy" and "core values."  Thanks to Obama and presidents before him, we have no moral high ground.  And you want to celebrate this debacle by bringing back one the chief culprits of our national humiliation?\n\nShame on you.\n\nYou stand for everything evil the USA has done.  Most shameful is that all along you talked about our ideals, our values, our freedoms.  Everyone knows this is just chatter, not just because of Helsinki, but because everything that came before that.    But for Obama, Trump would not have happened.\n\nThe Republicans are equally evil.  Here’s Kevin Drum’s list of GOP misdeeds:\n\n“As a sort of PS to my post yesterday about the decay that’s overtaken the Republican Party, I’d like to make clear just how long this has been brewing. I know this is hardly news to anyone who reads this blog, but as I approach my 60th birthday I can say that half my life has now been marked by Rush Limbaugh, the Drudge Report, Newt Gingrich, the Vince Foster suicide, Whitewater, the Rose law firm, Filegate, the Christmas card list scandal, Fox News, Monica Lewinsky, impeachment, the Florida recount, Swift boating, the GOP’s partywide effort to suppress black votes via photo ID laws, birtherism, the unanimous Republican rejection of the 2009 stimulus, Benghazi, Emailgate, Merrick Garland, and now the endless haze of racism, bigotry, and corruption surrounding Donald Trump.\nThis is very much a non-exhaustive list. But every one of these things is either a baseless “scandal,” an example of ethical rot, or part of a deliberate media effort to lie and mislead. These are the highlights of the Republican Party over the past three decades. No political party with a rap sheet like this deserves to be walking around free.\n”\n\nSource: https://www.motherjones.com/kevin-drum/2018/08/30-years-of-moral-decay-a-short-history-of-the-republican-party/?utm_source=mj-newsletters&utm_medium=email&utm_campaign=in-the-mix-2018-08-11', 'JJ Walter': 'Maybe we would get more voters if it was clicking likes and dislikes.   I wonder if there will ever be internet voting.', 'Yvonne Amaral': 'Love love love Obama ❣️', 'Poopergeist': "Excuse 1: The problem is that every time we try to vote people in who advocate good changes, they either turn out to be lying corporatist pieces of shit like you who aren't interested in the changes we need, or they're cheated out of the election by people like you. You want more people to vote, give us choices that aren't complete horseshit.\n\nExcuse 2: This is a dodge, and you fucking know it. It's not just about representation of minorities. It's about representation of our interests.\n\nExcuse 3: This one I actually agree is kinda dumb. Like even if you're living in a red state and want to vote blue or vice versa, your state isn't going to change unless people like you get off their asses and vote.\n\nExcuse 4: Nobody is making that argument\n\nExcuse 5: No, fuck that. I don't want to be responsible for voting someone like that in because I'm uninformed. Though admittedly, with cases such as yourself, values can be hard to discern. You presented yourself as someone who was gonna bring change, and then you wound up being a status quo president who bent over for the medical insurance industry when while campaigning you advocated free healthcare.\n\nExcuse 6: Yeah, this one I'll give him.\n\nExcuse 7: Yeah, this one I'll give him too.", 'ThePipt': 'Real President of USA', 'Jane Leelavathi': 'We had such a cool/intelligent president.', 'Cliff Roberson': 'None of those reasons even come close to why I will choose NOT to vote!', 'The Jackanapes': "FFS Obama...  I can't vote until 22 Oct at earliest here.  You got me, you bastard, OK?  I hadn't voted since 1996. But I voted in primaries this year, first time since.  OK?  And I'm voting in *every subsequent election I can*  - OK?  YOU ARE RIGHT, are you happy now?  \n\nI FEEL BAD about my cynicism from 1996 - 2018.  I do.  I'm sorry.  What will it take to get you off my back about it?\nTry to get more people to vote?\n\nOK I have done that too.  To the best of my ability. I've lost friends over it.  You happy?  No?  Fine.  On this issue you're right though.", 'Michael RCH': 'How is this not trending?\nMiss you man.', 'Christina Johnston Pérez': 'Thank you dear Obama....Thank you.', 'BartJ583': '#6 is heartbreaking. In Germany, for every election, every voter is sent a postcard reminding him of the date of the upcoming election and the address of his polling station. (It also contains the info you need to apply for an absentee ballot.) Why does the U.S. not have that?', 'Shanty Half Thick': '*Wrong Move there tryng to be relevant because of pokemon 👌*', 'Homing Fung': 'No time to vote? In Canada employers must grant employees 3 hours off work to vote on election day. All level of government elections nationwide. \nApparently in the US, time off to vote is subject to the employer in many states and state law does not require employers to grant time off to vote for employees.', 'Jorge Arturo Rincon Arenas': 'PFFFFFFFFFffffffffffffffffff... go home', 'Winston Harrison': 'We are now dealing with a new generation of leaders - the Baby Boomers and later. Yes, it is now more difficult to find good leaders to vote for. We need to lower our standard or vote for the lesser evil. It is the new reality.\nStaying away from the polls does not help.  \n\nPlease vote.', 'lagaman11': 'I LOVE IT!!! VOTE BLUE FOLKES!', 'Ramon Mendoza Nunez': 'Obama I miss you', 'Aquabone 81': "Considering nothings been done about gerrymandering, tampered voting machines, voter purging ect....\nI'm very disappointed to hear this disingenuous crap come out of your mouth Mister president.", 'Nackdad': 'POS neoliberal says what?', 'k96': 'Barack Obama was a real president!', 'Primalxbeast': '#6 isn\'t that easy if you don\'t have a permanent address. I live in my car and "random parking lot" isn\'t accepted as an address for voter registration.', 'dadohead': 'G.O.A.T.', 'Luxsenk': 'Traduccion en español para el publico hispano. Por favor! Esta muy interesante! Este hombre es GENIAL!', 'perry mahaney': 'Obama sucks ASSHOLE!!!!!', 'sunnylilme': "I miss obama. TONS of my friends arent voting...dont care. They're minorities and women even. Been arguing till Im blue in the face, they dont care, not political they say.", 'Wahkeena Sitka': 'i miss this man.', 'Laura Eager': 'Great video and I’m mailing my form for an absentee ballot. Miss you Obama!!', 'inthewayoftruth': 'Nintendo fans triggered lol', 'Lucius Augustus': "Listen Obama I don't like this Pokemon hate", "FAKE RAYBAN's": 'For 1 thing he is not a President he never was just a Gayboy WHORE PUPPET put in place by ROTHSCHILD\xa0 not going to watch the vid have no interest in his bull shit Propaganda OR DONG PLIMP/', 'Jacob Custer': 'This guy is so cool... wow.', 'VianneyCreates': 'Preach!', 'Vargoroth': 'The thing I like most about this video is that Obama sort of confesses that he was full of shit when he was president. There\'s a line he says:\n\n"For way too long politicians haven\'t been representative of America as a whole. But that\'s changing THIS YEAR." (@0:50)\n\nSo... It wasn\'t changing when YOU were running for office in 2012? That whole "we will change" rhetoric was bullshit? It\'s only six years later that politicians start representating the people who voted for them? Alright, good to know.\nSeriously, I don\'t get why this guy was such a popular president. What, he\'s chill and sauve and suddenly all of the corporate bullshit he did gets ignored? The dude was just another guy pretending to be an outsider who ended up being a mainstream president. Sound familiar to anyone?', 'Jason H.': 'Excuse 8: the US people are already overwhelmed by so much winning.', 'James Hazel': 'Poor Osama he just doesn\'t get it. You\'re old news, you fucked the country up and USA finally has a President who has a set of balls, like your husband Michael, and now the country is finally starting to come back around and the Dem\'s wanna fuck it all back up. Just come out of the closet, Osama, like you should have before and in this day and age you\'ll be greeted with open arms. Michael and you and your adopted girls can live a normal life. \n\nI see all these floppy cocks on here commenting, finally came out of their safe space to be keyboard warriors. I guess the new term is "Soy Boys". How do ANY of you even call yourselves men? Well I guess in some you\'re not. Sad', 'Carlos Cunba': 'My favorite not to vote excuse would be the Democrats are KKK and Republicans are against KKK but Democrats supports KKK to vote for Republicans.', 'Spenser Walsh': 'this is gonna change everything', 'Cubonica': 'No. 8 - Be a legal citizen.', 'Matthew Vinson': 'Thank you #obama. I miss you.', 'EmeraldView': "Thanks America's most recent real president.", 'Setokaiva': 'I love when he said "...This thing has Google. You can\'t use Google to look up people\'s beliefs?"  That, I think, is gonna make alot of people feel sheepish. xD', 'Getting Wet With Sharkie': 'I don\'t vote, ironically, because of Obama. A man who once promised "change" but failed to deliver and this happens time and time again with politicians on both sides. They\'ll say one thing and then when they get into power they do the complete opposite. Lets look at Obama as an example - he promised to:\n- Close Guantanamo Bay.\n- Secure US borders\n- Sign a universal healthcare bill\n- Restrict government wiretapping on US citizens\n- Repeal the tax cuts for the rich \n- Withdraw troops from Iraq\nThese are just the broken promises I can remember, I\'m sure there are more. It goes to show that a politician\'s promise is an empty one.\n\nI don\'t vote because I can\'t relate to the candidates. And by that I don\'t mean women, gay people, minorities and so on - that\'s all superficial bullshit. I want a candidate that will represent me with their policies, not their genitalia. Making bad Pokémon jokes doesn\'t make you relatable, it makes you a fucking jackass.\n\nI don\'t vote because my vote doesn\'t matter. It doesn\'t matter because the system is set up to make it that way. We have the Electoral College, super-delegates, super-pacs, a two party system that ensures independent candidates don\'t have a chance in hell, and even within those two parties - the system can be rigged in favor of one candidate over another. All you need to do is look at what the DNC did to Bernie. They pushed him out in favor of Hilary Clinton, a candidate so bad she lost to Donald... Fucking... Trump.\n\nVoting is a democratic right but so is choosing not to vote.', 'rapidroy7': "Obama is there still 57 States ? Do you still stand behind your~' I Taught Frank Underwood Everything he Knows '~ Comment? Larry Sinclair Loves him some Obama?", 'ProtoMario': "No please, don't let me down like that...", 'Vashaun Persaud': 'number 4 really pissed him off', 'William Drescher': 'Thanks.   Riffed on that one.  Here  https://photos.app.goo.gl/PFFE8DQDwM6SnYZLA', 'Angela Sanders': 'I love you, Obama! I miss you! Thanks for helping!', 'TranceElevation': 'Pathetic.', 'Slave Slave': 'Totally no love \nBro', 'Robert Happ': 'This douche bag should have taken his own advice hahaha what a joke.'}{'Slave Slave': 'Support u criminal s \nDemocrats & Republican s idiots & independent \nPut more rapist & sex traffickers like USA', 'dee park': 'My personal excuse is: Obama.', 'Robert Kelly': 'Please vote this fall!  It is very important!!', 'Alexandre Silva de Andrade': 'I care about Pokémon. Fascist!!!', 'CastrovalleyLip Lip': 'Tick tock barry’ you changed the face of politics~ I’m WOKE and voted RED 🇺🇸\nFor Americans and America- in case you don’t know why- because I MATTER, even if you don’t! Get lost, stfu and sit down, quietly', 'Chris M': 'Obama, shut up you CIA plant pot. Your wife is more of a man than you. You almost destroyed America with your NWO policies paving the way for the witch to go to war with everyone and their dog while chipping away at peoples rights, freedoms and dismantling the constitution allowing communism and Islamic extremism to run wild before bowing down to the globalists due to uncontrollable civil unrest and conflicts abroad. Good job the people got wind of your sick agenda. So folks, if you want the new world order on your doorstep real soon then vote democrat.', 'Mandisa W': 'Nevermind Democrats & Republicans, the real struggle is between those who work to change the country and those who are too "checked-out" to even try. I\'ve voted every election - State/Local, Federal, and special - since I turned 18, and I\'m so tired of contemporaries blabbing about protests & petitions, but not putting their \'X\' where it counts - the ballot box. Democracy is a "citizen-push" form of governance - Be the Change you want to see! #Vote20XX', 'Christ Aware': "Well I share the same values as Jesus so that's my pick. But he is already on the throne so there's no need for me to vote. 💪💪", 'Phillip Wasden': "He does this video because hes made to believe that talking to YouTube = talking to potential Democrat votes.  The fact is most of us just come here to hear him say he doesn't care about Pokemon.  The US is so polarized 99% of voters already know exactly how we will vote in midterms.", 'Michael': 'A tad condescending was it?. Fuck you Barry', '512BB': 'I misssssssssssssssssss you :-(', 'nail3r': '"for too long, women haven\'t been representative in office".  You had 8 years Barack.', 'Lyme is Lame': '“I don’t care about Pokémon” is the uncoolest thing he’s said. That’s how much it takes for this gem of a human to not be cool. Love you, Barry O. Great video. Miss you.', 'Eric Sharp': "He's still president? Smh", 'Sir Winston Lennon': 'People voted... TRUMP WON!', 'Alberto David Vidal': 'Pokemon is awesome!! politics no!', 'HasanJF': 'Fuck you corporate establishment warmongering shill, why should I fucking take advice from you? You threw Bernie under the bus for the most corrupt Democrat ever b/c of her 70 year old wrinkly vagina who caused herself to lose to the orange buffoon. Fuck you corporate Democrats and fuck you GOP!', 'Dana Moonfire': 'Obama was the guy who abandoned the progressive base that got him elected and because of that the Democrats lost in the midterm. He had his chance to get out the vote but instead he made it worse. How much longer to we have to hear from this failure. I think it is a very risky strategy for him to be the face of the Democratic Party. That will only stir up Trump supporters even more.', 'RyoonZ Wu': "Yes I'll vote Republican", 'Gail Beterbide': 'Dang, I miss that LEADER of calm, humor and reason.', 'timmothy58': 'hey...this is great...convinced me to vote red as red can be...thank...love...', 'deidara _': "2:44 I call BS, give me ONE prominent candidate that says that. The pay gap BTW is complete nonsense, it's been a constitutional right since the 50's for women and men to be paid equally for equal work, the statistics that say otherwise aren't taking decisive factors like overtime and paternity leave into account.", 'thedarkbatty': 'Reminder that Obama killed an American girl with a drone strike.', 'Grant Owens': 'Please vote, but not because a neoliberal told you to. Bring on progressives America. ✊', 'Mswordx23': 'Trump rules!!', 'desimurgi': "Dear Mr. Obama. You had your turn. Now get your fingers out of DNC's affairs and fuck off. Thank you very much.", 'Ordaichte Poileas': 'Gotta vote or the communists will take over.', 'Ani Bell': "'Oppressed' white male trolls are crying in the comments, but we don't care. WE know who's the best POTUS ever & who's the worst. The rest of the world knows, too, which is why they laughed the worst right out of the UN a couple weeks ago. LOL!", 'David Labay': 'In the words of Shia LeBeouf; "JUST...DO IT!!!!"', 'Daniel Spidell': "Which candidate actually said women shouldn't get equal pay? If there is one please tell me where I can locate that video....and also which candidate doesn't want to stop school shootings?", 'I am Spektro': 'Thanks, Obama.', 'tenacious645': "He's full of shit. I refuse to vote for multimillionaires who only listen to other wealthy people as someone who is supposed to represent working class people...", 'MACE Harris': "It's always good to hear from and see MY president. God bless you (former) President Obama and God bless the United States of America because we need a blessing right about now.", 'DvSDiabloHR': 'Vote Please. We need to flush Donald Dump.', 'Nadea': 'he looks white in this', 'Frost': 'FUCK OBAMA! COULDNT EMPLOY US PEOPLE SO NOW YOUR PARTY CAN DIE!', "Kenneth O'Donnell": "Lots of Russian trolls and bots on here working hard for our real president, Putin. You can tell it's getting close to election time.", 'Ro G': 'Why is that you never see Republicans making this type of PSA encouraging more people to vote?', 'TheLuiscelaya': "Pokemon.\nCoachella.\nI'm hip kids. Please listen to me. I'm not old like those dumb old people. Let me talk down to you.\n\n\n\nFuck off corporatist shill.", 'Luke Lanich': 'Alright, ready to vote republican. Hey, he is telling me to get out and vote.', 'Jeremy S.': 'Obama the master of talk talk talk and not do crap to help the Middle Class!', 'Yammel Heylel': "What about I don't wanna vote?", 'Naomi Hadarian': "Ain't got time for excuses... freaking Vote!", 'Random Stranger Online': "I can't wait to vote for Republicans this November, fuck the lying democrats.", 'Ken Berscheit': 'why is this even on youtube???????\xa0 more liberal\xa0 bullshit', 'BronerBeast': 'What if you getting money, and there is absolutely nothing the politicians can do to stop it? I can afford my own healthcare, I cant get laid off. etc. What if I dont believe in the politicians? There arent any good ones including Trump as well as YOU Mr Nobama!!', 'Hate CriminaI': 'Fuck off back to Kenya, no one cares about you anymore.', 'Hoffnung Verloren': 'Is\xa0Peter Strzok still reporting to Obama?', 'Eduardo': 'Low life\'s across the country going "I\'m so tired of being made fun of, I like looking at pictures of food. Don\'t judge me". 🤣🤣🤣🤣🤣', 'Shiro Nyako': 'Anyone remember the "Vote, and thenn get your free taco" campaign?', 'thatsoundsgood': 'i miss obama :(', 'The Bible': "10 trillion dollars in debt, a depleted labor force participation rate, 1.5% average GDP, approximately 11 million more people on food stamps after he left office, millions of children murdered in the womb, and the normalization of perversions that have destroyed countless people and countless societies. He's an economically illiterate perversion loving baby murdering Nazi joke.", 'Kris Harden': "Wait, hold up....Did he just say he doesn't care about pokemon?!?!?!", 'ddoyle11': 'I first voted for Walter Mondale in 1984 and I have never missed any election, mid term or otherwise, since then. I read the voter information book supplied by the state of California from cover to cover regarding all of the candidates, their statements, the propositions, the arguments for and against them, then I check my choices and take the book with me to the polls. I’m in and out in usually less than 5 minutes. There is no legitimate excuse for anyone living in a first-world country not to vote. None. If I can figure it out an get it done, anybody can.', 'Sibi Sebastian': '"Like they haven\'t used the internet... That\'s cause they haven\'t!" Hilarious... And possibly true!', '1111Pel': '"There\'s no joke here" : ) .  GO VOTE!!!', 'Sarah Mathieu': 'Vote Vote Vote!!! Great vid.', 'michaelthemovieman': 'The n****r speaks. Fuck off, Obama, you elitist scold.  Your legacy is dead and the red wave is coming to destroy your party.', 'StarTic': 'He doesn’t like Pokémon? The highest grossing media franchise of all time? #NotMyPresident', 'Mustafa Jama': "when this guy talks, is like when the lion in serengeti is roaring. that's why the republican do scare about him. when", 'Katrina Stirn': 'Boy, I miss Obama.  Great ad.   Love his natural comedic ability.', 'butterstix 24': 'wtf I love obama now :D', 'Ramany Soma': 'Welcome President Obama.Thank you for your service, I think US  Need you.', 'J. Muller': 'I heard that ice will be at the voting places checking and also following up on absentee ballots.', 'Defec Tec': 'Not the president anymore', 'g4ngst4crizz4b': 'Voting legitimizes white supremacist institutions.', 'Mercedes Swiftie': 'I miss having a thoughtful, caring, intelligent president #ComeBackBarack', 'Tim Liebrock': "Excuse #8: Gerrymandering\n\nExcuse #9: Citizens United\n\nExcuse #10: Electoral College\n\nTry and explain those away, you can't.", 'RVRZ': 'Obama doesnt care about Pokémon? Unsubbed from Earth', 'Ray Farron': "I had already decided not to, but this video kind of inspired me to vote this year. Thank you!\nEDIT: I'm voting REPUBLICAN by the way.", 'Murch Mop': "The candidate I want to vote for doesn't stand a chance in this broken two party system so I am being forced to vote Democrat in order to hopefully keep Kobach out of the Gov Chair.", 'ArtDocHound': 'Go vote!', 'Ask About': 'Only matters in swing states.', 'Kat Ito': 'Hi Obama 👋🏻', 'tipsy mcstaggers': 'The only way this could have been better was if Biden was in it, maybe with an ice cream cone.', 'Callie Calista': '‼️yay. It’s Obama telling us all to Vote Red‼️\nThank you so much Obama for reminding us all to vote straight Republican ‼️You’re the greatest Republican ever ‼️🇺🇸❤️🇺🇸❤️🇺🇸❤️🇺🇸❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️🎄🎄🎄🎄🎄🎄🎄🎄🎄🎄✝️✝️✝️✝️✝️🎅🎅🎅🎅⛑⛑⛑⛑⛑⛑⛑⛑⛑⛑⛑⛑⛑', 'madz4prez': 'I LAUGHED OMG', 'John Pierre': "With all due respect...I can't vote for your party. I liked you...but your party have completely gone off the rails with hysteria and bigotry.", 'Jeff Wiggins': 'Get ready for a Red Tide this November that is going to flush the remnants of you and your \nbigoted race baiting socialist muslum agendas right on down the sewer where they belong.', 'Austin Williams': "He said Pokemon. I'm sold. Voting.", 'Dovahkiff': "A lot of people would've actually gone out and voted if the DNC hadn't fucked with the primaries, wish you'd talk about that problem instead", 'kris Fodor': 'This prick always finds his way back in front of a camera. Like we havent had enough of him yet😂', 'dmitriy40': 'Oh, Barry Hussain...   💩💩💩💩💩', 'Alex Meager': '“Women don’t get equal for equal work”  That was made illegal in the equal pay act of 1963 and wouldn’t businesses hire only women if they could get away with paying them less for the same work.', 'Mick Russom': 'shut up criminal obama. TICK TOCK - your crimes are waiting to come to light. we all know what you did. you are BRAZEN to try and poison this election too.', 'James F': 'In other words... the democrats need more uninformed voters', 'chipalike': 'Hmmm, what if I am about to vote republican.... Seems to be leaning one way :D', 'Michael Gibb': "There's a very simple solution to the last excuse: switch elections to the weekend. Where I live, New Zealand, election day is always a Saturday. If you make election day always on Saturday, then more people can get in to vote.", 'Caleb Lyvers': 'I will be VOTING for Trump in 2020', 'Stephen Shaw': 'Thank you for your support, but at this moment it looks like 13 Russians gave your video the thumbs down.', 'Kyle Kroha': 'I love when he nearly cracks up laughing at 1:27 #MissYouObama', 'Mark Pierce': 'I miss having a President with a sense of humor, instead, we have a President who is a joke.', 'nick v': "I'm convinced. Voting for dems all the way. Dem Republicans", 'Jeremy Dykes': "'Member when the President of the United States was actually capable of making well-reasoned arguments? When he acted, spoke, and WAS a rational human being?\n\nI 'member...", 'E V': 'LOL The voice is getting higher pitched. Looks like these cats are getting more worried and desperate. GOOD!', 'ytyehyeh': "Regarding absentee ballots in all 50 states, while that may be true, IIRC some states do not grant requests for absentee ballots for just any (or no) reason, i.e. you must have one of a limited set of reasons.  E.g. in some states, you cannot get one just because you can't get off work or skip classes on Election Day, or you cannot get transportation to your polling place on Election Day, but you are still within some distance or nearby geographical region of your polling place.  Now, if you are on sunning yourself on Bondi beach or skiing in St. Moritz on Election Day, sure, you can get an absentee ballot, no problem."}{'bvierville1': 'He’s hip and cool, yeah!', 'Melissa Fletcher': '#REDTSUNAMIMIDTERMS2018', 'The Heart Of A Blackbird': 'Russia and China are voting for me already.', 'Riley Martin': "Hey Russian trolls! Doesn't it suck how you can't get a job in Russia better than internet troll? I don't blame your women for choosing to be mail-order brides for lonely Westerners instead of staying with your non-providing ass. It's almost as bad as your third-world life expectancy. I guess dying from liver failure becaure of alcoholism is the only escape for Russian men. Glad I don't live in that shit hole run by an angry little munchkin.", 'Maxime Racicot': 'Thank you for your continuing service Mr President.', 'Mike Stanfill': 'Ahhhh. A real president!', 'P. consuela banana H.': "He disappears for how long and now he has opinions?? Ugh. He had no problems taking corporate money he's just as bad as the rest.  We can do better.", 'Michael': 'I was planning to anyways, but thanks for reminding me why more than ever that decent people need to stop people like you and other liberals.', '21cad12': 'Excellent video! Good humor for a serious matter! Thank you!', 'Allyn Howell': "We don't care about you this year more than any other year we especially need to get rid of Democrats liberal Democrats your time is done.", 'Raven Poe': 'Damn. I sure miss this wonderful man.', 'TriEdgedPrism': "0:55 the biggest lie in politics that every people still believe. That's what he was supposed to bring, CHANGE. When did it happen? It's all the same. Look this is not about Democrat or Republicain, It's about the whole system. Where this guy can sit there and enjoy thousand dollars plus being constantly called mr.president while you fucking struggle to buy food for your child or get them treated in hospital. No matter if you liked Obama policies or not, he will still get thousand dollars until the end of his life while you will stay miserable, wondering why. Don't bring Trump into this please, this video isn't about him and i don't like it more than Obama, both suck, all politician really sucks.", 'ERP Exposure 2': 'Thank you for reminding us to vote REPUBLICAN candidates, Mr Obama!', '1banana2kiwis': 'This guy sucked as president. What a bore....all talk.... says allllllll the right things. Bullshitter.', 'Mike Zickar': 'Nailed it!', 'yodamaster103': "Don't boo, vote!", 'munchkin432': 'Love it. Vote!', 'Ria Swaynie': 'I love Obama so much. He’s so right. It’s time to be PROGRESSIVE. we can’t having stinking old farts running our country.', 'Douglas Zang': "Thank you, Mr. President, for continuing to lead when there's a vacuum of leadership.", 'Sancho G': 'I agree...Vote Trump!! #MAGA #Trump2020', 'Doabit': 'This is exactly what we needed! Thank you so much!', 'Stygian Renegade': 'That epic shade', 'Joshua Etchison': "I wasn't going to vote because I just moved to California, but as of last week, I'm officially registered to vote.  Yay.", 'Rafael Sierra': '/r/FellowKids', 'Matthew Gaston': 'It is sooo easy to be cynical and give excuses.Thanks Obama for the timely reminder.', 'Katherine Silva': 'so cool!!!'}{'bvierville1': 'He’s hip and cool, yeah!', 'Melissa Fletcher': '#REDTSUNAMIMIDTERMS2018', 'The Heart Of A Blackbird': 'Russia and China are voting for me already.', 'Riley Martin': "Hey Russian trolls! Doesn't it suck how you can't get a job in Russia better than internet troll? I don't blame your women for choosing to be mail-order brides for lonely Westerners instead of staying with your non-providing ass. It's almost as bad as your third-world life expectancy. I guess dying from liver failure becaure of alcoholism is the only escape for Russian men. Glad I don't live in that shit hole run by an angry little munchkin.", 'Maxime Racicot': 'Thank you for your continuing service Mr President.', 'Mike Stanfill': 'Ahhhh. A real president!', 'P. consuela banana H.': "He disappears for how long and now he has opinions?? Ugh. He had no problems taking corporate money he's just as bad as the rest.  We can do better.", 'Michael': 'I was planning to anyways, but thanks for reminding me why more than ever that decent people need to stop people like you and other liberals.', '21cad12': 'Excellent video! Good humor for a serious matter! Thank you!', 'Allyn Howell': "We don't care about you this year more than any other year we especially need to get rid of Democrats liberal Democrats your time is done.", 'Raven Poe': 'Damn. I sure miss this wonderful man.', 'TriEdgedPrism': "0:55 the biggest lie in politics that every people still believe. That's what he was supposed to bring, CHANGE. When did it happen? It's all the same. Look this is not about Democrat or Republicain, It's about the whole system. Where this guy can sit there and enjoy thousand dollars plus being constantly called mr.president while you fucking struggle to buy food for your child or get them treated in hospital. No matter if you liked Obama policies or not, he will still get thousand dollars until the end of his life while you will stay miserable, wondering why. Don't bring Trump into this please, this video isn't about him and i don't like it more than Obama, both suck, all politician really sucks.", 'ERP Exposure 2': 'Thank you for reminding us to vote REPUBLICAN candidates, Mr Obama!', '1banana2kiwis': 'This guy sucked as president. What a bore....all talk.... says allllllll the right things. Bullshitter.', 'Mike Zickar': 'Nailed it!', 'yodamaster103': "Don't boo, vote!", 'munchkin432': 'Love it. Vote!', 'Ria Swaynie': 'I love Obama so much. He’s so right. It’s time to be PROGRESSIVE. we can’t having stinking old farts running our country.', 'Douglas Zang': "Thank you, Mr. President, for continuing to lead when there's a vacuum of leadership.", 'Sancho G': 'I agree...Vote Trump!! #MAGA #Trump2020', 'Doabit': 'This is exactly what we needed! Thank you so much!', 'Stygian Renegade': 'That epic shade', 'Joshua Etchison': "I wasn't going to vote because I just moved to California, but as of last week, I'm officially registered to vote.  Yay.", 'Rafael Sierra': '/r/FellowKids', 'Matthew Gaston': 'It is sooo easy to be cynical and give excuses.Thanks Obama for the timely reminder.', 'Katherine Silva': 'so cool!!!'}{'bvierville1': 'He’s hip and cool, yeah!', 'Melissa Fletcher': '#REDTSUNAMIMIDTERMS2018', 'The Heart Of A Blackbird': 'Russia and China are voting for me already.', 'Riley Martin': "Hey Russian trolls! Doesn't it suck how you can't get a job in Russia better than internet troll? I don't blame your women for choosing to be mail-order brides for lonely Westerners instead of staying with your non-providing ass. It's almost as bad as your third-world life expectancy. I guess dying from liver failure becaure of alcoholism is the only escape for Russian men. Glad I don't live in that shit hole run by an angry little munchkin.", 'Maxime Racicot': 'Thank you for your continuing service Mr President.', 'Mike Stanfill': 'Ahhhh. A real president!', 'P. consuela banana H.': "He disappears for how long and now he has opinions?? Ugh. He had no problems taking corporate money he's just as bad as the rest.  We can do better.", 'Michael': 'I was planning to anyways, but thanks for reminding me why more than ever that decent people need to stop people like you and other liberals.', '21cad12': 'Excellent video! Good humor for a serious matter! Thank you!', 'Allyn Howell': "We don't care about you this year more than any other year we especially need to get rid of Democrats liberal Democrats your time is done.", 'Raven Poe': 'Damn. I sure miss this wonderful man.', 'TriEdgedPrism': "0:55 the biggest lie in politics that every people still believe. That's what he was supposed to bring, CHANGE. When did it happen? It's all the same. Look this is not about Democrat or Republicain, It's about the whole system. Where this guy can sit there and enjoy thousand dollars plus being constantly called mr.president while you fucking struggle to buy food for your child or get them treated in hospital. No matter if you liked Obama policies or not, he will still get thousand dollars until the end of his life while you will stay miserable, wondering why. Don't bring Trump into this please, this video isn't about him and i don't like it more than Obama, both suck, all politician really sucks.", 'ERP Exposure 2': 'Thank you for reminding us to vote REPUBLICAN candidates, Mr Obama!', '1banana2kiwis': 'This guy sucked as president. What a bore....all talk.... says allllllll the right things. Bullshitter.', 'Mike Zickar': 'Nailed it!', 'yodamaster103': "Don't boo, vote!", 'munchkin432': 'Love it. Vote!', 'Ria Swaynie': 'I love Obama so much. He’s so right. It’s time to be PROGRESSIVE. we can’t having stinking old farts running our country.', 'Douglas Zang': "Thank you, Mr. President, for continuing to lead when there's a vacuum of leadership.", 'Sancho G': 'I agree...Vote Trump!! #MAGA #Trump2020', 'Doabit': 'This is exactly what we needed! Thank you so much!', 'Stygian Renegade': 'That epic shade', 'Joshua Etchison': "I wasn't going to vote because I just moved to California, but as of last week, I'm officially registered to vote.  Yay.", 'Rafael Sierra': '/r/FellowKids', 'Matthew Gaston': 'It is sooo easy to be cynical and give excuses.Thanks Obama for the timely reminder.', 'Katherine Silva': 'so cool!!!'}{'bvierville1': 'He’s hip and cool, yeah!', 'Melissa Fletcher': '#REDTSUNAMIMIDTERMS2018', 'The Heart Of A Blackbird': 'Russia and China are voting for me already.', 'Riley Martin': "Hey Russian trolls! Doesn't it suck how you can't get a job in Russia better than internet troll? I don't blame your women for choosing to be mail-order brides for lonely Westerners instead of staying with your non-providing ass. It's almost as bad as your third-world life expectancy. I guess dying from liver failure becaure of alcoholism is the only escape for Russian men. Glad I don't live in that shit hole run by an angry little munchkin.", 'Maxime Racicot': 'Thank you for your continuing service Mr President.', 'Mike Stanfill': 'Ahhhh. A real president!', 'P. consuela banana H.': "He disappears for how long and now he has opinions?? Ugh. He had no problems taking corporate money he's just as bad as the rest.  We can do better.", 'Michael': 'I was planning to anyways, but thanks for reminding me why more than ever that decent people need to stop people like you and other liberals.', '21cad12': 'Excellent video! Good humor for a serious matter! Thank you!', 'Allyn Howell': "We don't care about you this year more than any other year we especially need to get rid of Democrats liberal Democrats your time is done.", 'Raven Poe': 'Damn. I sure miss this wonderful man.', 'TriEdgedPrism': "0:55 the biggest lie in politics that every people still believe. That's what he was supposed to bring, CHANGE. When did it happen? It's all the same. Look this is not about Democrat or Republicain, It's about the whole system. Where this guy can sit there and enjoy thousand dollars plus being constantly called mr.president while you fucking struggle to buy food for your child or get them treated in hospital. No matter if you liked Obama policies or not, he will still get thousand dollars until the end of his life while you will stay miserable, wondering why. Don't bring Trump into this please, this video isn't about him and i don't like it more than Obama, both suck, all politician really sucks.", 'ERP Exposure 2': 'Thank you for reminding us to vote REPUBLICAN candidates, Mr Obama!', '1banana2kiwis': 'This guy sucked as president. What a bore....all talk.... says allllllll the right things. Bullshitter.', 'Mike Zickar': 'Nailed it!', 'yodamaster103': "Don't boo, vote!", 'munchkin432': 'Love it. Vote!', 'Ria Swaynie': 'I love Obama so much. He’s so right. It’s time to be PROGRESSIVE. we can’t having stinking old farts running our country.', 'Douglas Zang': "Thank you, Mr. President, for continuing to lead when there's a vacuum of leadership.", 'Sancho G': 'I agree...Vote Trump!! #MAGA #Trump2020', 'Doabit': 'This is exactly what we needed! Thank you so much!', 'Stygian Renegade': 'That epic shade', 'Joshua Etchison': "I wasn't going to vote because I just moved to California, but as of last week, I'm officially registered to vote.  Yay.", 'Rafael Sierra': '/r/FellowKids', 'Matthew Gaston': 'It is sooo easy to be cynical and give excuses.Thanks Obama for the timely reminder.', 'Katherine Silva': 'so cool!!!'}{'bvierville1': 'He’s hip and cool, yeah!', 'Melissa Fletcher': '#REDTSUNAMIMIDTERMS2018', 'The Heart Of A Blackbird': 'Russia and China are voting for me already.', 'Riley Martin': "Hey Russian trolls! Doesn't it suck how you can't get a job in Russia better than internet troll? I don't blame your women for choosing to be mail-order brides for lonely Westerners instead of staying with your non-providing ass. It's almost as bad as your third-world life expectancy. I guess dying from liver failure becaure of alcoholism is the only escape for Russian men. Glad I don't live in that shit hole run by an angry little munchkin.", 'Maxime Racicot': 'Thank you for your continuing service Mr President.', 'Mike Stanfill': 'Ahhhh. A real president!', 'P. consuela banana H.': "He disappears for how long and now he has opinions?? Ugh. He had no problems taking corporate money he's just as bad as the rest.  We can do better.", 'Michael': 'I was planning to anyways, but thanks for reminding me why more than ever that decent people need to stop people like you and other liberals.', '21cad12': 'Excellent video! Good humor for a serious matter! Thank you!', 'Allyn Howell': "We don't care about you this year more than any other year we especially need to get rid of Democrats liberal Democrats your time is done.", 'Raven Poe': 'Damn. I sure miss this wonderful man.', 'TriEdgedPrism': "0:55 the biggest lie in politics that every people still believe. That's what he was supposed to bring, CHANGE. When did it happen? It's all the same. Look this is not about Democrat or Republicain, It's about the whole system. Where this guy can sit there and enjoy thousand dollars plus being constantly called mr.president while you fucking struggle to buy food for your child or get them treated in hospital. No matter if you liked Obama policies or not, he will still get thousand dollars until the end of his life while you will stay miserable, wondering why. Don't bring Trump into this please, this video isn't about him and i don't like it more than Obama, both suck, all politician really sucks.", 'ERP Exposure 2': 'Thank you for reminding us to vote REPUBLICAN candidates, Mr Obama!', '1banana2kiwis': 'This guy sucked as president. What a bore....all talk.... says allllllll the right things. Bullshitter.', 'Mike Zickar': 'Nailed it!', 'yodamaster103': "Don't boo, vote!", 'munchkin432': 'Love it. Vote!', 'Ria Swaynie': 'I love Obama so much. He’s so right. It’s time to be PROGRESSIVE. we can’t having stinking old farts running our country.', 'Douglas Zang': "Thank you, Mr. President, for continuing to lead when there's a vacuum of leadership.", 'Sancho G': 'I agree...Vote Trump!! #MAGA #Trump2020', 'Doabit': 'This is exactly what we needed! Thank you so much!', 'Stygian Renegade': 'That epic shade', 'Joshua Etchison': "I wasn't going to vote because I just moved to California, but as of last week, I'm officially registered to vote.  Yay.", 'Rafael Sierra': '/r/FellowKids', 'Matthew Gaston': 'It is sooo easy to be cynical and give excuses.Thanks Obama for the timely reminder.', 'Katherine Silva': 'so cool!!!'}{'bvierville1': 'He’s hip and cool, yeah!', 'Melissa Fletcher': '#REDTSUNAMIMIDTERMS2018', 'The Heart Of A Blackbird': 'Russia and China are voting for me already.', 'Riley Martin': "Hey Russian trolls! Doesn't it suck how you can't get a job in Russia better than internet troll? I don't blame your women for choosing to be mail-order brides for lonely Westerners instead of staying with your non-providing ass. It's almost as bad as your third-world life expectancy. I guess dying from liver failure becaure of alcoholism is the only escape for Russian men. Glad I don't live in that shit hole run by an angry little munchkin.", 'Maxime Racicot': 'Thank you for your continuing service Mr President.', 'Mike Stanfill': 'Ahhhh. A real president!', 'P. consuela banana H.': "He disappears for how long and now he has opinions?? Ugh. He had no problems taking corporate money he's just as bad as the rest.  We can do better.", 'Michael': 'I was planning to anyways, but thanks for reminding me why more than ever that decent people need to stop people like you and other liberals.', '21cad12': 'Excellent video! Good humor for a serious matter! Thank you!', 'Allyn Howell': "We don't care about you this year more than any other year we especially need to get rid of Democrats liberal Democrats your time is done.", 'Raven Poe': 'Damn. I sure miss this wonderful man.', 'TriEdgedPrism': "0:55 the biggest lie in politics that every people still believe. That's what he was supposed to bring, CHANGE. When did it happen? It's all the same. Look this is not about Democrat or Republicain, It's about the whole system. Where this guy can sit there and enjoy thousand dollars plus being constantly called mr.president while you fucking struggle to buy food for your child or get them treated in hospital. No matter if you liked Obama policies or not, he will still get thousand dollars until the end of his life while you will stay miserable, wondering why. Don't bring Trump into this please, this video isn't about him and i don't like it more than Obama, both suck, all politician really sucks.", 'ERP Exposure 2': 'Thank you for reminding us to vote REPUBLICAN candidates, Mr Obama!', '1banana2kiwis': 'This guy sucked as president. What a bore....all talk.... says allllllll the right things. Bullshitter.', 'Mike Zickar': 'Nailed it!', 'yodamaster103': "Don't boo, vote!", 'munchkin432': 'Love it. Vote!', 'Ria Swaynie': 'I love Obama so much. He’s so right. It’s time to be PROGRESSIVE. we can’t having stinking old farts running our country.', 'Douglas Zang': "Thank you, Mr. President, for continuing to lead when there's a vacuum of leadership.", 'Sancho G': 'I agree...Vote Trump!! #MAGA #Trump2020', 'Doabit': 'This is exactly what we needed! Thank you so much!', 'Stygian Renegade': 'That epic shade', 'Joshua Etchison': "I wasn't going to vote because I just moved to California, but as of last week, I'm officially registered to vote.  Yay.", 'Rafael Sierra': '/r/FellowKids', 'Matthew Gaston': 'It is sooo easy to be cynical and give excuses.Thanks Obama for the timely reminder.', 'Katherine Silva': 'so cool!!!'}{'bvierville1': 'He’s hip and cool, yeah!', 'Melissa Fletcher': '#REDTSUNAMIMIDTERMS2018', 'The Heart Of A Blackbird': 'Russia and China are voting for me already.', 'Riley Martin': "Hey Russian trolls! Doesn't it suck how you can't get a job in Russia better than internet troll? I don't blame your women for choosing to be mail-order brides for lonely Westerners instead of staying with your non-providing ass. It's almost as bad as your third-world life expectancy. I guess dying from liver failure becaure of alcoholism is the only escape for Russian men. Glad I don't live in that shit hole run by an angry little munchkin.", 'Maxime Racicot': 'Thank you for your continuing service Mr President.', 'Mike Stanfill': 'Ahhhh. A real president!', 'P. consuela banana H.': "He disappears for how long and now he has opinions?? Ugh. He had no problems taking corporate money he's just as bad as the rest.  We can do better.", 'Michael': 'I was planning to anyways, but thanks for reminding me why more than ever that decent people need to stop people like you and other liberals.', '21cad12': 'Excellent video! Good humor for a serious matter! Thank you!', 'Allyn Howell': "We don't care about you this year more than any other year we especially need to get rid of Democrats liberal Democrats your time is done.", 'Raven Poe': 'Damn. I sure miss this wonderful man.', 'TriEdgedPrism': "0:55 the biggest lie in politics that every people still believe. That's what he was supposed to bring, CHANGE. When did it happen? It's all the same. Look this is not about Democrat or Republicain, It's about the whole system. Where this guy can sit there and enjoy thousand dollars plus being constantly called mr.president while you fucking struggle to buy food for your child or get them treated in hospital. No matter if you liked Obama policies or not, he will still get thousand dollars until the end of his life while you will stay miserable, wondering why. Don't bring Trump into this please, this video isn't about him and i don't like it more than Obama, both suck, all politician really sucks.", 'ERP Exposure 2': 'Thank you for reminding us to vote REPUBLICAN candidates, Mr Obama!', '1banana2kiwis': 'This guy sucked as president. What a bore....all talk.... says allllllll the right things. Bullshitter.', 'Mike Zickar': 'Nailed it!', 'yodamaster103': "Don't boo, vote!", 'munchkin432': 'Love it. Vote!', 'Ria Swaynie': 'I love Obama so much. He’s so right. It’s time to be PROGRESSIVE. we can’t having stinking old farts running our country.', 'Douglas Zang': "Thank you, Mr. President, for continuing to lead when there's a vacuum of leadership.", 'Sancho G': 'I agree...Vote Trump!! #MAGA #Trump2020', 'Doabit': 'This is exactly what we needed! Thank you so much!', 'Stygian Renegade': 'That epic shade', 'Joshua Etchison': "I wasn't going to vote because I just moved to California, but as of last week, I'm officially registered to vote.  Yay.", 'Rafael Sierra': '/r/FellowKids', 'Matthew Gaston': 'It is sooo easy to be cynical and give excuses.Thanks Obama for the timely reminder.', 'Katherine Silva': 'so cool!!!'}{'bvierville1': 'He’s hip and cool, yeah!', 'Melissa Fletcher': '#REDTSUNAMIMIDTERMS2018', 'The Heart Of A Blackbird': 'Russia and China are voting for me already.', 'Riley Martin': "Hey Russian trolls! Doesn't it suck how you can't get a job in Russia better than internet troll? I don't blame your women for choosing to be mail-order brides for lonely Westerners instead of staying with your non-providing ass. It's almost as bad as your third-world life expectancy. I guess dying from liver failure becaure of alcoholism is the only escape for Russian men. Glad I don't live in that shit hole run by an angry little munchkin.", 'Maxime Racicot': 'Thank you for your continuing service Mr President.', 'Mike Stanfill': 'Ahhhh. A real president!', 'P. consuela banana H.': "He disappears for how long and now he has opinions?? Ugh. He had no problems taking corporate money he's just as bad as the rest.  We can do better.", 'Michael': 'I was planning to anyways, but thanks for reminding me why more than ever that decent people need to stop people like you and other liberals.', '21cad12': 'Excellent video! Good humor for a serious matter! Thank you!', 'Allyn Howell': "We don't care about you this year more than any other year we especially need to get rid of Democrats liberal Democrats your time is done.", 'Raven Poe': 'Damn. I sure miss this wonderful man.', 'TriEdgedPrism': "0:55 the biggest lie in politics that every people still believe. That's what he was supposed to bring, CHANGE. When did it happen? It's all the same. Look this is not about Democrat or Republicain, It's about the whole system. Where this guy can sit there and enjoy thousand dollars plus being constantly called mr.president while you fucking struggle to buy food for your child or get them treated in hospital. No matter if you liked Obama policies or not, he will still get thousand dollars until the end of his life while you will stay miserable, wondering why. Don't bring Trump into this please, this video isn't about him and i don't like it more than Obama, both suck, all politician really sucks.", 'ERP Exposure 2': 'Thank you for reminding us to vote REPUBLICAN candidates, Mr Obama!', '1banana2kiwis': 'This guy sucked as president. What a bore....all talk.... says allllllll the right things. Bullshitter.', 'Mike Zickar': 'Nailed it!', 'yodamaster103': "Don't boo, vote!", 'munchkin432': 'Love it. Vote!', 'Ria Swaynie': 'I love Obama so much. He’s so right. It’s time to be PROGRESSIVE. we can’t having stinking old farts running our country.', 'Douglas Zang': "Thank you, Mr. President, for continuing to lead when there's a vacuum of leadership.", 'Sancho G': 'I agree...Vote Trump!! #MAGA #Trump2020', 'Doabit': 'This is exactly what we needed! Thank you so much!', 'Stygian Renegade': 'That epic shade', 'Joshua Etchison': "I wasn't going to vote because I just moved to California, but as of last week, I'm officially registered to vote.  Yay.", 'Rafael Sierra': '/r/FellowKids', 'Matthew Gaston': 'It is sooo easy to be cynical and give excuses.Thanks Obama for the timely reminder.', 'Katherine Silva': 'so cool!!!'}{'bvierville1': 'He’s hip and cool, yeah!', 'Melissa Fletcher': '#REDTSUNAMIMIDTERMS2018', 'The Heart Of A Blackbird': 'Russia and China are voting for me already.', 'Riley Martin': "Hey Russian trolls! Doesn't it suck how you can't get a job in Russia better than internet troll? I don't blame your women for choosing to be mail-order brides for lonely Westerners instead of staying with your non-providing ass. It's almost as bad as your third-world life expectancy. I guess dying from liver failure becaure of alcoholism is the only escape for Russian men. Glad I don't live in that shit hole run by an angry little munchkin.", 'Maxime Racicot': 'Thank you for your continuing service Mr President.', 'Mike Stanfill': 'Ahhhh. A real president!', 'P. consuela banana H.': "He disappears for how long and now he has opinions?? Ugh. He had no problems taking corporate money he's just as bad as the rest.  We can do better.", 'Michael': 'I was planning to anyways, but thanks for reminding me why more than ever that decent people need to stop people like you and other liberals.', '21cad12': 'Excellent video! Good humor for a serious matter! Thank you!', 'Allyn Howell': "We don't care about you this year more than any other year we especially need to get rid of Democrats liberal Democrats your time is done.", 'Raven Poe': 'Damn. I sure miss this wonderful man.', 'TriEdgedPrism': "0:55 the biggest lie in politics that every people still believe. That's what he was supposed to bring, CHANGE. When did it happen? It's all the same. Look this is not about Democrat or Republicain, It's about the whole system. Where this guy can sit there and enjoy thousand dollars plus being constantly called mr.president while you fucking struggle to buy food for your child or get them treated in hospital. No matter if you liked Obama policies or not, he will still get thousand dollars until the end of his life while you will stay miserable, wondering why. Don't bring Trump into this please, this video isn't about him and i don't like it more than Obama, both suck, all politician really sucks.", 'ERP Exposure 2': 'Thank you for reminding us to vote REPUBLICAN candidates, Mr Obama!', '1banana2kiwis': 'This guy sucked as president. What a bore....all talk.... says allllllll the right things. Bullshitter.', 'Mike Zickar': 'Nailed it!', 'yodamaster103': "Don't boo, vote!", 'munchkin432': 'Love it. Vote!', 'Ria Swaynie': 'I love Obama so much. He’s so right. It’s time to be PROGRESSIVE. we can’t having stinking old farts running our country.', 'Douglas Zang': "Thank you, Mr. President, for continuing to lead when there's a vacuum of leadership.", 'Sancho G': 'I agree...Vote Trump!! #MAGA #Trump2020', 'Doabit': 'This is exactly what we needed! Thank you so much!', 'Stygian Renegade': 'That epic shade', 'Joshua Etchison': "I wasn't going to vote because I just moved to California, but as of last week, I'm officially registered to vote.  Yay.", 'Rafael Sierra': '/r/FellowKids', 'Matthew Gaston': 'It is sooo easy to be cynical and give excuses.Thanks Obama for the timely reminder.', 'Katherine Silva': 'so cool!!!'}{'bvierville1': 'He’s hip and cool, yeah!', 'Melissa Fletcher': '#REDTSUNAMIMIDTERMS2018', 'The Heart Of A Blackbird': 'Russia and China are voting for me already.', 'Riley Martin': "Hey Russian trolls! Doesn't it suck how you can't get a job in Russia better than internet troll? I don't blame your women for choosing to be mail-order brides for lonely Westerners instead of staying with your non-providing ass. It's almost as bad as your third-world life expectancy. I guess dying from liver failure becaure of alcoholism is the only escape for Russian men. Glad I don't live in that shit hole run by an angry little munchkin.", 'Maxime Racicot': 'Thank you for your continuing service Mr President.', 'Mike Stanfill': 'Ahhhh. A real president!', 'P. consuela banana H.': "He disappears for how long and now he has opinions?? Ugh. He had no problems taking corporate money he's just as bad as the rest.  We can do better.", 'Michael': 'I was planning to anyways, but thanks for reminding me why more than ever that decent people need to stop people like you and other liberals.', '21cad12': 'Excellent video! Good humor for a serious matter! Thank you!', 'Allyn Howell': "We don't care about you this year more than any other year we especially need to get rid of Democrats liberal Democrats your time is done.", 'Raven Poe': 'Damn. I sure miss this wonderful man.', 'TriEdgedPrism': "0:55 the biggest lie in politics that every people still believe. That's what he was supposed to bring, CHANGE. When did it happen? It's all the same. Look this is not about Democrat or Republicain, It's about the whole system. Where this guy can sit there and enjoy thousand dollars plus being constantly called mr.president while you fucking struggle to buy food for your child or get them treated in hospital. No matter if you liked Obama policies or not, he will still get thousand dollars until the end of his life while you will stay miserable, wondering why. Don't bring Trump into this please, this video isn't about him and i don't like it more than Obama, both suck, all politician really sucks.", 'ERP Exposure 2': 'Thank you for reminding us to vote REPUBLICAN candidates, Mr Obama!', '1banana2kiwis': 'This guy sucked as president. What a bore....all talk.... says allllllll the right things. Bullshitter.', 'Mike Zickar': 'Nailed it!', 'yodamaster103': "Don't boo, vote!", 'munchkin432': 'Love it. Vote!', 'Ria Swaynie': 'I love Obama so much. He’s so right. It’s time to be PROGRESSIVE. we can’t having stinking old farts running our country.', 'Douglas Zang': "Thank you, Mr. President, for continuing to lead when there's a vacuum of leadership.", 'Sancho G': 'I agree...Vote Trump!! #MAGA #Trump2020', 'Doabit': 'This is exactly what we needed! Thank you so much!', 'Stygian Renegade': 'That epic shade', 'Joshua Etchison': "I wasn't going to vote because I just moved to California, but as of last week, I'm officially registered to vote.  Yay.", 'Rafael Sierra': '/r/FellowKids', 'Matthew Gaston': 'It is sooo easy to be cynical and give excuses.Thanks Obama for the timely reminder.', 'Katherine Silva': 'so cool!!!'}{'bvierville1': 'He’s hip and cool, yeah!', 'Melissa Fletcher': '#REDTSUNAMIMIDTERMS2018', 'The Heart Of A Blackbird': 'Russia and China are voting for me already.', 'Riley Martin': "Hey Russian trolls! Doesn't it suck how you can't get a job in Russia better than internet troll? I don't blame your women for choosing to be mail-order brides for lonely Westerners instead of staying with your non-providing ass. It's almost as bad as your third-world life expectancy. I guess dying from liver failure becaure of alcoholism is the only escape for Russian men. Glad I don't live in that shit hole run by an angry little munchkin.", 'Maxime Racicot': 'Thank you for your continuing service Mr President.', 'Mike Stanfill': 'Ahhhh. A real president!', 'P. consuela banana H.': "He disappears for how long and now he has opinions?? Ugh. He had no problems taking corporate money he's just as bad as the rest.  We can do better.", 'Michael': 'I was planning to anyways, but thanks for reminding me why more than ever that decent people need to stop people like you and other liberals.', '21cad12': 'Excellent video! Good humor for a serious matter! Thank you!', 'Allyn Howell': "We don't care about you this year more than any other year we especially need to get rid of Democrats liberal Democrats your time is done.", 'Raven Poe': 'Damn. I sure miss this wonderful man.', 'TriEdgedPrism': "0:55 the biggest lie in politics that every people still believe. That's what he was supposed to bring, CHANGE. When did it happen? It's all the same. Look this is not about Democrat or Republicain, It's about the whole system. Where this guy can sit there and enjoy thousand dollars plus being constantly called mr.president while you fucking struggle to buy food for your child or get them treated in hospital. No matter if you liked Obama policies or not, he will still get thousand dollars until the end of his life while you will stay miserable, wondering why. Don't bring Trump into this please, this video isn't about him and i don't like it more than Obama, both suck, all politician really sucks.", 'ERP Exposure 2': 'Thank you for reminding us to vote REPUBLICAN candidates, Mr Obama!', '1banana2kiwis': 'This guy sucked as president. What a bore....all talk.... says allllllll the right things. Bullshitter.', 'Mike Zickar': 'Nailed it!', 'yodamaster103': "Don't boo, vote!", 'munchkin432': 'Love it. Vote!', 'Ria Swaynie': 'I love Obama so much. He’s so right. It’s time to be PROGRESSIVE. we can’t having stinking old farts running our country.', 'Douglas Zang': "Thank you, Mr. President, for continuing to lead when there's a vacuum of leadership.", 'Sancho G': 'I agree...Vote Trump!! #MAGA #Trump2020', 'Doabit': 'This is exactly what we needed! Thank you so much!', 'Stygian Renegade': 'That epic shade', 'Joshua Etchison': "I wasn't going to vote because I just moved to California, but as of last week, I'm officially registered to vote.  Yay.", 'Rafael Sierra': '/r/FellowKids', 'Matthew Gaston': 'It is sooo easy to be cynical and give excuses.Thanks Obama for the timely reminder.', 'Katherine Silva': 'so cool!!!'}{'bvierville1': 'He’s hip and cool, yeah!', 'Melissa Fletcher': '#REDTSUNAMIMIDTERMS2018', 'The Heart Of A Blackbird': 'Russia and China are voting for me already.', 'Riley Martin': "Hey Russian trolls! Doesn't it suck how you can't get a job in Russia better than internet troll? I don't blame your women for choosing to be mail-order brides for lonely Westerners instead of staying with your non-providing ass. It's almost as bad as your third-world life expectancy. I guess dying from liver failure becaure of alcoholism is the only escape for Russian men. Glad I don't live in that shit hole run by an angry little munchkin.", 'Maxime Racicot': 'Thank you for your continuing service Mr President.', 'Mike Stanfill': 'Ahhhh. A real president!', 'P. consuela banana H.': "He disappears for how long and now he has opinions?? Ugh. He had no problems taking corporate money he's just as bad as the rest.  We can do better.", 'Michael': 'I was planning to anyways, but thanks for reminding me why more than ever that decent people need to stop people like you and other liberals.', '21cad12': 'Excellent video! Good humor for a serious matter! Thank you!', 'Allyn Howell': "We don't care about you this year more than any other year we especially need to get rid of Democrats liberal Democrats your time is done.", 'Raven Poe': 'Damn. I sure miss this wonderful man.', 'TriEdgedPrism': "0:55 the biggest lie in politics that every people still believe. That's what he was supposed to bring, CHANGE. When did it happen? It's all the same. Look this is not about Democrat or Republicain, It's about the whole system. Where this guy can sit there and enjoy thousand dollars plus being constantly called mr.president while you fucking struggle to buy food for your child or get them treated in hospital. No matter if you liked Obama policies or not, he will still get thousand dollars until the end of his life while you will stay miserable, wondering why. Don't bring Trump into this please, this video isn't about him and i don't like it more than Obama, both suck, all politician really sucks.", 'ERP Exposure 2': 'Thank you for reminding us to vote REPUBLICAN candidates, Mr Obama!', '1banana2kiwis': 'This guy sucked as president. What a bore....all talk.... says allllllll the right things. Bullshitter.', 'Mike Zickar': 'Nailed it!', 'yodamaster103': "Don't boo, vote!", 'munchkin432': 'Love it. Vote!', 'Ria Swaynie': 'I love Obama so much. He’s so right. It’s time to be PROGRESSIVE. we can’t having stinking old farts running our country.', 'Douglas Zang': "Thank you, Mr. President, for continuing to lead when there's a vacuum of leadership.", 'Sancho G': 'I agree...Vote Trump!! #MAGA #Trump2020', 'Doabit': 'This is exactly what we needed! Thank you so much!', 'Stygian Renegade': 'That epic shade', 'Joshua Etchison': "I wasn't going to vote because I just moved to California, but as of last week, I'm officially registered to vote.  Yay.", 'Rafael Sierra': '/r/FellowKids', 'Matthew Gaston': 'It is sooo easy to be cynical and give excuses.Thanks Obama for the timely reminder.', 'Katherine Silva': 'so cool!!!'}{'bvierville1': 'He’s hip and cool, yeah!', 'Melissa Fletcher': '#REDTSUNAMIMIDTERMS2018', 'The Heart Of A Blackbird': 'Russia and China are voting for me already.', 'Riley Martin': "Hey Russian trolls! Doesn't it suck how you can't get a job in Russia better than internet troll? I don't blame your women for choosing to be mail-order brides for lonely Westerners instead of staying with your non-providing ass. It's almost as bad as your third-world life expectancy. I guess dying from liver failure becaure of alcoholism is the only escape for Russian men. Glad I don't live in that shit hole run by an angry little munchkin.", 'Maxime Racicot': 'Thank you for your continuing service Mr President.', 'Mike Stanfill': 'Ahhhh. A real president!', 'P. consuela banana H.': "He disappears for how long and now he has opinions?? Ugh. He had no problems taking corporate money he's just as bad as the rest.  We can do better.", 'Michael': 'I was planning to anyways, but thanks for reminding me why more than ever that decent people need to stop people like you and other liberals.', '21cad12': 'Excellent video! Good humor for a serious matter! Thank you!', 'Allyn Howell': "We don't care about you this year more than any other year we especially need to get rid of Democrats liberal Democrats your time is done.", 'Raven Poe': 'Damn. I sure miss this wonderful man.', 'TriEdgedPrism': "0:55 the biggest lie in politics that every people still believe. That's what he was supposed to bring, CHANGE. When did it happen? It's all the same. Look this is not about Democrat or Republicain, It's about the whole system. Where this guy can sit there and enjoy thousand dollars plus being constantly called mr.president while you fucking struggle to buy food for your child or get them treated in hospital. No matter if you liked Obama policies or not, he will still get thousand dollars until the end of his life while you will stay miserable, wondering why. Don't bring Trump into this please, this video isn't about him and i don't like it more than Obama, both suck, all politician really sucks.", 'ERP Exposure 2': 'Thank you for reminding us to vote REPUBLICAN candidates, Mr Obama!', '1banana2kiwis': 'This guy sucked as president. What a bore....all talk.... says allllllll the right things. Bullshitter.', 'Mike Zickar': 'Nailed it!', 'yodamaster103': "Don't boo, vote!", 'munchkin432': 'Love it. Vote!', 'Ria Swaynie': 'I love Obama so much. He’s so right. It’s time to be PROGRESSIVE. we can’t having stinking old farts running our country.', 'Douglas Zang': "Thank you, Mr. President, for continuing to lead when there's a vacuum of leadership.", 'Sancho G': 'I agree...Vote Trump!! #MAGA #Trump2020', 'Doabit': 'This is exactly what we needed! Thank you so much!', 'Stygian Renegade': 'That epic shade', 'Joshua Etchison': "I wasn't going to vote because I just moved to California, but as of last week, I'm officially registered to vote.  Yay.", 'Rafael Sierra': '/r/FellowKids', 'Matthew Gaston': 'It is sooo easy to be cynical and give excuses.Thanks Obama for the timely reminder.', 'Katherine Silva': 'so cool!!!'}{'bvierville1': 'He’s hip and cool, yeah!', 'Melissa Fletcher': '#REDTSUNAMIMIDTERMS2018', 'The Heart Of A Blackbird': 'Russia and China are voting for me already.', 'Riley Martin': "Hey Russian trolls! Doesn't it suck how you can't get a job in Russia better than internet troll? I don't blame your women for choosing to be mail-order brides for lonely Westerners instead of staying with your non-providing ass. It's almost as bad as your third-world life expectancy. I guess dying from liver failure becaure of alcoholism is the only escape for Russian men. Glad I don't live in that shit hole run by an angry little munchkin.", 'Maxime Racicot': 'Thank you for your continuing service Mr President.', 'Mike Stanfill': 'Ahhhh. A real president!', 'P. consuela banana H.': "He disappears for how long and now he has opinions?? Ugh. He had no problems taking corporate money he's just as bad as the rest.  We can do better.", 'Michael': 'I was planning to anyways, but thanks for reminding me why more than ever that decent people need to stop people like you and other liberals.', '21cad12': 'Excellent video! Good humor for a serious matter! Thank you!', 'Allyn Howell': "We don't care about you this year more than any other year we especially need to get rid of Democrats liberal Democrats your time is done.", 'Raven Poe': 'Damn. I sure miss this wonderful man.', 'TriEdgedPrism': "0:55 the biggest lie in politics that every people still believe. That's what he was supposed to bring, CHANGE. When did it happen? It's all the same. Look this is not about Democrat or Republicain, It's about the whole system. Where this guy can sit there and enjoy thousand dollars plus being constantly called mr.president while you fucking struggle to buy food for your child or get them treated in hospital. No matter if you liked Obama policies or not, he will still get thousand dollars until the end of his life while you will stay miserable, wondering why. Don't bring Trump into this please, this video isn't about him and i don't like it more than Obama, both suck, all politician really sucks.", 'ERP Exposure 2': 'Thank you for reminding us to vote REPUBLICAN candidates, Mr Obama!', '1banana2kiwis': 'This guy sucked as president. What a bore....all talk.... says allllllll the right things. Bullshitter.', 'Mike Zickar': 'Nailed it!', 'yodamaster103': "Don't boo, vote!", 'munchkin432': 'Love it. Vote!', 'Ria Swaynie': 'I love Obama so much. He’s so right. It’s time to be PROGRESSIVE. we can’t having stinking old farts running our country.', 'Douglas Zang': "Thank you, Mr. President, for continuing to lead when there's a vacuum of leadership.", 'Sancho G': 'I agree...Vote Trump!! #MAGA #Trump2020', 'Doabit': 'This is exactly what we needed! Thank you so much!', 'Stygian Renegade': 'That epic shade', 'Joshua Etchison': "I wasn't going to vote because I just moved to California, but as of last week, I'm officially registered to vote.  Yay.", 'Rafael Sierra': '/r/FellowKids', 'Matthew Gaston': 'It is sooo easy to be cynical and give excuses.Thanks Obama for the timely reminder.', 'Katherine Silva': 'so cool!!!'}{'bvierville1': 'He’s hip and cool, yeah!', 'Melissa Fletcher': '#REDTSUNAMIMIDTERMS2018', 'The Heart Of A Blackbird': 'Russia and China are voting for me already.', 'Riley Martin': "Hey Russian trolls! Doesn't it suck how you can't get a job in Russia better than internet troll? I don't blame your women for choosing to be mail-order brides for lonely Westerners instead of staying with your non-providing ass. It's almost as bad as your third-world life expectancy. I guess dying from liver failure becaure of alcoholism is the only escape for Russian men. Glad I don't live in that shit hole run by an angry little munchkin.", 'Maxime Racicot': 'Thank you for your continuing service Mr President.', 'Mike Stanfill': 'Ahhhh. A real president!', 'P. consuela banana H.': "He disappears for how long and now he has opinions?? Ugh. He had no problems taking corporate money he's just as bad as the rest.  We can do better.", 'Michael': 'I was planning to anyways, but thanks for reminding me why more than ever that decent people need to stop people like you and other liberals.', '21cad12': 'Excellent video! Good humor for a serious matter! Thank you!', 'Allyn Howell': "We don't care about you this year more than any other year we especially need to get rid of Democrats liberal Democrats your time is done.", 'Raven Poe': 'Damn. I sure miss this wonderful man.', 'TriEdgedPrism': "0:55 the biggest lie in politics that every people still believe. That's what he was supposed to bring, CHANGE. When did it happen? It's all the same. Look this is not about Democrat or Republicain, It's about the whole system. Where this guy can sit there and enjoy thousand dollars plus being constantly called mr.president while you fucking struggle to buy food for your child or get them treated in hospital. No matter if you liked Obama policies or not, he will still get thousand dollars until the end of his life while you will stay miserable, wondering why. Don't bring Trump into this please, this video isn't about him and i don't like it more than Obama, both suck, all politician really sucks."}